PropPoxVaccine.cpp

class _PMD	size(12):
	+---
 0	| mdisp
 4	| pdisp
 8	| vdisp
	+---

class _TypeDescriptor	size(8):
	+---
 0	| pVFTable
 4	| spare
 8	| name
	+---

class _s__CatchableType	size(28):
	+---
 0	| properties
 4	| pType
 8	| _PMD thisDisplacement
20	| sizeOrOffset
24	| copyFunction
	+---

class _s__CatchableTypeArray	size(4):
	+---
 0	| nCatchableTypes
 4	| arrayOfCatchableTypes
	+---

class _s__ThrowInfo	size(16):
	+---
 0	| attributes
 4	| pmfnUnwind
 8	| pForwardCompat
12	| pCatchableTypeArray
	+---

class _s__RTTIBaseClassDescriptor2	size(28):
	+---
 0	| pTypeDescriptor
 4	| numContainedBases
 8	| _PMD where
20	| attributes
24	| pClassDescriptor
	+---

class _s__RTTIBaseClassArray	size(1):
	+---
 0	| arrayOfBaseClassDescriptors
	+---

class _s__RTTIClassHierarchyDescriptor	size(16):
	+---
 0	| signature
 4	| attributes
 8	| numBaseClasses
12	| pBaseClassArray
	+---

class _s__RTTICompleteObjectLocator	size(20):
	+---
 0	| signature
 4	| offset
 8	| cdOffset
12	| pTypeDescriptor
16	| pClassDescriptor
	+---

class __s_GUID	size(16):
	+---
 0	| Data1
 4	| Data2
 6	| Data3
 8	| Data4
	+---

class __vc_attributes::helper_attributes::default_valueAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::helper_attributes::attributeAttribute	size(8):
	+---
 0	| ValidOn
 4	| AllowMultiple
 5	| Inherited
  	| <alignment member> (size=2)
	+---

class __vc_attributes::helper_attributes::source_annotation_attributeAttribute	size(8):
	+---
 0	| ValidOn
 4	| AllowMultiple
  	| <alignment member> (size=3)
	+---

class __vc_attributes::helper_attributes::v1_earlyAttribute	size(1):
	+---
	+---

class __vc_attributes::helper_attributes::v1_nameAttribute	size(4):
	+---
 0	| name
	+---

class __vc_attributes::helper_attributes::v1_alttypeAttribute	size(4):
	+---
 0	| type_e type
	+---

class __vc_attributes::helper_attributes::usageAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::helper_attributes::repeatableAttribute	size(1):
	+---
	+---

class __vc_attributes::helper_attributes::as_stringAttribute	size(1):
	+---
	+---

class __vc_attributes::helper_attributes::process_earlyAttribute	size(1):
	+---
	+---

class __vc_attributes::helper_attributes::notify_atlprovAttribute	size(1):
	+---
	+---

class __vc_attributes::helper_attributes::help_stringAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::helper_attributes::requires_valueAttribute	size(1):
	+---
	+---

class __vc_attributes::helper_attributes::multi_valueAttribute	size(1):
	+---
	+---

class __vc_attributes::event_receiverAttribute	size(8):
	+---
 0	| type_e type
 4	| layout_dependent
  	| <alignment member> (size=3)
	+---

class __vc_attributes::no_injected_textAttribute	size(1):
	+---
 0	| value
	+---

class __vc_attributes::emitidlAttribute	size(8):
	+---
 0	| value
 4	| defaultimports
  	| <alignment member> (size=3)
	+---

class __vc_attributes::exportAttribute	size(1):
	+---
	+---

class __vc_attributes::idl_moduleAttribute	size(32):
	+---
 0	| name
 4	| dllname
 8	| version
12	| uuid
16	| helpstring
20	| helpstringcontext
24	| helpcontext
28	| hidden
29	| restricted
  	| <alignment member> (size=2)
	+---

class __vc_attributes::idl_quoteAttribute	size(4):
	+---
 0	| text
	+---

class __vc_attributes::implementsAttribute	size(8):
	+---
 0	| interfaces
 4	| dispinterfaces
	+---

class __vc_attributes::importidlAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::includelibAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::library_blockAttribute	size(1):
	+---
	+---

class __vc_attributes::satypeAttribute	size(4):
	+---
 0	| type
	+---

class __vc_attributes::propgetAttribute	size(1):
	+---
	+---

class __vc_attributes::propputAttribute	size(1):
	+---
	+---

class __vc_attributes::propputrefAttribute	size(1):
	+---
	+---

class __vc_attributes::providerAttribute	size(12):
	+---
 0	| name
 4	| uuid
 8	| cookies
	+---

class __vc_attributes::coclassAttribute	size(1):
	+---
	+---

class __vc_attributes::controlAttribute	size(1):
	+---
	+---

class __vc_attributes::customAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::dispinterfaceAttribute	size(1):
	+---
	+---

class __vc_attributes::dualAttribute	size(1):
	+---
	+---

class __vc_attributes::lcidAttribute	size(1):
	+---
	+---

class __vc_attributes::objectAttribute	size(1):
	+---
	+---

class __vc_attributes::progidAttribute	size(4):
	+---
 0	| name
	+---

class __vc_attributes::threadingAttribute	size(4):
	+---
 0	| threading_e value
	+---

class __vc_attributes::uuidAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::versionAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::vi_progidAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::moduleAttribute	size(56):
	+---
 0	| type_e type
 4	| name
 8	| version
12	| uuid
16	| lcid
20	| control
  	| <alignment member> (size=3)
24	| helpstring
28	| helpstringcontext
32	| helpstringdll
36	| helpfile
40	| helpcontext
44	| hidden
45	| restricted
  	| <alignment member> (size=2)
48	| custom
52	| resource_name
	+---

class __vc_attributes::aggregatableAttribute	size(4):
	+---
 0	| type_e type
	+---

class __vc_attributes::appobjectAttribute	size(1):
	+---
	+---

class __vc_attributes::async_uuidAttribute	size(4):
	+---
 0	| uuid
	+---

class __vc_attributes::bindableAttribute	size(1):
	+---
	+---

class __vc_attributes::call_asAttribute	size(4):
	+---
 0	| local_proc
	+---

class __vc_attributes::caseAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::cpp_quoteAttribute	size(4):
	+---
 0	| string
	+---

class __vc_attributes::defaultAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::defaultbindAttribute	size(1):
	+---
	+---

class __vc_attributes::defaultcollelemAttribute	size(1):
	+---
	+---

class __vc_attributes::defaultvalueAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::defaultvtableAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::displaybindAttribute	size(1):
	+---
	+---

class __vc_attributes::entryAttribute	size(4):
	+---
 0	| entry_id
	+---

class __vc_attributes::first_isAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::helpcontextAttribute	size(4):
	+---
 0	| helpcontext_value
	+---

class __vc_attributes::helpfileAttribute	size(4):
	+---
 0	| filename
	+---

class __vc_attributes::helpstringAttribute	size(4):
	+---
 0	| help_text_string
	+---

class __vc_attributes::helpstringcontextAttribute	size(4):
	+---
 0	| contextid
	+---

class __vc_attributes::helpstringdllAttribute	size(4):
	+---
 0	| dllname
	+---

class __vc_attributes::hiddenAttribute	size(1):
	+---
	+---

class __vc_attributes::idAttribute	size(4):
	+---
 0	| id_num
	+---

class __vc_attributes::iid_isAttribute	size(4):
	+---
 0	| limited_expression
	+---

class __vc_attributes::immediatebindAttribute	size(1):
	+---
	+---

class __vc_attributes::importAttribute	size(4):
	+---
 0	| idl_file
	+---

class __vc_attributes::importlibAttribute	size(4):
	+---
 0	| tlb_file
	+---

class __vc_attributes::inAttribute	size(1):
	+---
	+---

class __vc_attributes::includeAttribute	size(4):
	+---
 0	| include_file
	+---

class __vc_attributes::last_isAttribute	size(4):
	+---
 0	| expression
	+---

class __vc_attributes::length_isAttribute	size(4):
	+---
 0	| expression
	+---

class __vc_attributes::licensedAttribute	size(1):
	+---
	+---

class __vc_attributes::localAttribute	size(1):
	+---
	+---

class __vc_attributes::max_isAttribute	size(4):
	+---
 0	| expression
	+---

class __vc_attributes::ms_unionAttribute	size(1):
	+---
	+---

class __vc_attributes::nonbrowsableAttribute	size(1):
	+---
	+---

class __vc_attributes::noncreatableAttribute	size(1):
	+---
	+---

class __vc_attributes::nonextensibleAttribute	size(1):
	+---
	+---

class __vc_attributes::odlAttribute	size(1):
	+---
	+---

class __vc_attributes::oleautomationAttribute	size(1):
	+---
	+---

class __vc_attributes::optionalAttribute	size(1):
	+---
	+---

class __vc_attributes::outAttribute	size(1):
	+---
	+---

class __vc_attributes::pointer_defaultAttribute	size(4):
	+---
 0	| type_e type
	+---

class __vc_attributes::pragmaAttribute	size(4):
	+---
 0	| token_sequence
	+---

class __vc_attributes::ptrAttribute	size(1):
	+---
	+---

class __vc_attributes::publicAttribute	size(1):
	+---
	+---

class __vc_attributes::rangeAttribute	size(8):
	+---
 0	| low_val
 4	| high_val
	+---

class __vc_attributes::readonlyAttribute	size(1):
	+---
	+---

class __vc_attributes::refAttribute	size(1):
	+---
	+---

class __vc_attributes::requesteditAttribute	size(1):
	+---
	+---

class __vc_attributes::restrictedAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::retvalAttribute	size(1):
	+---
	+---

class __vc_attributes::size_isAttribute	size(4):
	+---
 0	| expression
	+---

class __vc_attributes::stringAttribute	size(1):
	+---
	+---

class __vc_attributes::sourceAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::switch_isAttribute	size(4):
	+---
 0	| limited_expression
	+---

class __vc_attributes::switch_typeAttribute	size(4):
	+---
 0	| switch_type_specifier
	+---

class __vc_attributes::transmit_asAttribute	size(4):
	+---
 0	| xmit_type
	+---

class __vc_attributes::uidefaultAttribute	size(1):
	+---
	+---

class __vc_attributes::uniqueAttribute	size(1):
	+---
	+---

class __vc_attributes::usesgetlasterrorAttribute	size(1):
	+---
	+---

class __vc_attributes::v1_enumAttribute	size(1):
	+---
	+---

class __vc_attributes::varargAttribute	size(1):
	+---
	+---

class __vc_attributes::wire_marshalAttribute	size(4):
	+---
 0	| wire_type
	+---

class __vc_attributes::event_sourceAttribute	size(12):
	+---
 0	| type_e type
 4	| optimize_e optimize
 8	| decorate
  	| <alignment member> (size=3)
	+---

class __vc_attributes::hookAttribute	size(16):
	+---
 0	| event
 4	| source
 8	| handler
12	| receiver
	+---

class __vc_attributes::unhookAttribute	size(16):
	+---
 0	| event
 4	| source
 8	| handler
12	| receiver
	+---

class __vc_attributes::atl::synchronizeAttribute	size(1):
	+---
	+---

class __vc_attributes::atl::soap_handlerAttribute	size(20):
	+---
 0	| name
 4	| namespace
 8	| protocol
12	| style
16	| use
	+---

class __vc_attributes::atl::soap_methodAttribute	size(4):
	+---
 0	| name
	+---

class __vc_attributes::atl::soap_headerAttribute	size(8):
	+---
 0	| value
 4	| required
 5	| in
 6	| out
  	| <alignment member> (size=1)
	+---

class __vc_attributes::atl::soap_namespaceAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::atl::com_interface_entryAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::atl::support_error_infoAttribute	size(4):
	+---
 0	| error_interface
	+---

class __vc_attributes::atl::aggregatesAttribute	size(4):
	+---
 0	| clsid
	+---

class __vc_attributes::atl::implements_categoryAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::atl::requires_categoryAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::atl::rdxAttribute	size(12):
	+---
 0	| key
 4	| valuename
 8	| regtype
	+---

class __vc_attributes::atl::registration_scriptAttribute	size(4):
	+---
 0	| script
	+---

class __vc_attributes::atl::db_sourceAttribute	size(12):
	+---
 0	| source
 4	| name
 8	| hresult
	+---

class __vc_attributes::atl::db_commandAttribute	size(24):
	+---
 0	| command
 4	| name
 8	| source_name
12	| hresult
16	| bindings
20	| bulk_fetch
	+---

class __vc_attributes::atl::db_tableAttribute	size(20):
	+---
 0	| table
 4	| name
 8	| source_name
12	| hresult
16	| bulk_fetch
	+---

class __vc_attributes::atl::db_accessorAttribute	size(8):
	+---
 0	| id
 4	| auto_
  	| <alignment member> (size=3)
	+---

class __vc_attributes::atl::db_columnAttribute	size(24):
	+---
 0	| ordinal
 4	| dbtype
 8	| precision
12	| scale
16	| status
20	| length
	+---

class __vc_attributes::atl::db_paramAttribute	size(28):
	+---
 0	| ordinal
 4	| paramtype
 8	| dbtype
12	| precision
16	| scale
20	| status
24	| length
	+---

class __vc_attributes::atl::tag_nameAttribute	size(8):
	+---
 0	| name
 4	| parse_func
	+---

class __vc_attributes::atl::request_handlerAttribute	size(8):
	+---
 0	| name
 4	| sdl
	+---

class __vc_attributes::atl::perfmonAttribute	size(8):
	+---
 0	| name
 4	| register
  	| <alignment member> (size=3)
	+---

class __vc_attributes::atl::perf_objectAttribute	size(32):
	+---
 0	| name_res
 4	| help_res
 8	| namestring
12	| helpstring
16	| detail
20	| no_instances
  	| <alignment member> (size=3)
24	| class_
28	| maxinstnamelen
	+---

class __vc_attributes::atl::perf_counterAttribute	size(40):
	+---
 0	| namestring
 4	| helpstring
 8	| name_res
12	| help_res
16	| countertype
20	| defscale
24	| default_counter
  	| <alignment member> (size=3)
28	| detail
32	| max_counter_size
36	| countertype_string
	+---

class __crt_locale_data_public	size(12):
	+---
 0	| _locale_pctype
 4	| _locale_mb_cur_max
 8	| _locale_lc_codepage
	+---

class __crt_locale_pointers	size(8):
	+---
 0	| locinfo
 4	| mbcinfo
	+---

class _Mbstatet	size(8):
	+---
 0	| _Wchar
 4	| _Byte
 6	| _State
	+---

class std::_Lockit	size(4):
	+---
 0	| _Locktype
	+---

class std::_Init_locks	size(1):
	+---
	+---

class std::_Nil	size(1):
	+---
	+---

class std::integral_constant<bool,0>	size(1):
	+---
	+---

class std::integral_constant<bool,1>	size(1):
	+---
	+---

class std::_Is_integral<bool>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_integral<char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_integral<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_integral<signed char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_integral<wchar_t>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_integral<char16_t>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_integral<char32_t>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_integral<unsigned short>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_integral<short>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_integral<unsigned int>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_integral<int>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_integral<unsigned long>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_integral<long>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_integral<unsigned __int64>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_integral<__int64>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_floating_point<float>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_floating_point<double>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_floating_point<long double>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class EANonCopyable	size(1):
	+---
	+---

class <unnamed-tag>	size(16):
	+---
 0	| quot
 8	| rem
	+---

class _exception	size(32):
	+---
 0	| type
 4	| name
 8	| arg1
16	| arg2
24	| retval
	+---

class _complex	size(16):
	+---
 0	| x
 8	| y
	+---

class <unnamed-tag>	size(8):
	+---
 0	| _Sh
 0	| _Val
	+---

class <unnamed-tag>	size(4):
	+---
 0	| _Sh
 0	| _Val
	+---

class <unnamed-tag>	size(8):
	+---
 0	| _Sh
 0	| _Val
	+---

class <unnamed-tag>	size(8):
	+---
 0	| _Word
 0	| _Float
 0	| _Double
 0	| _Long_double
	+---

class _Combined_type<float,double>	size(1):
	+---
	+---

class _Combined_type<float,long double>	size(1):
	+---
	+---

class _Real_widened<float,float>	size(1):
	+---
	+---

class _Real_widened<float,double>	size(1):
	+---
	+---

class _Real_widened<double,float>	size(1):
	+---
	+---

class _Real_widened<double,double>	size(1):
	+---
	+---

class _Real_type<float>	size(1):
	+---
	+---

class _Real_type<long double>	size(1):
	+---
	+---

class eastl::no_type	size(8):
	+---
 0	| padding
	+---

class eastl::unused	size(1):
	+---
	+---

class eastl::argument_sink	size(1):
	+---
	+---

class eastl::type_or<0,0,0,0,0>	size(1):
	+---
	+---

class eastl::type_and<1,1,1,1,1>	size(1):
	+---
	+---

class eastl::type_not<1>	size(1):
	+---
	+---

class eastl::integral_constant<bool,1>	size(1):
	+---
	+---

class eastl::integral_constant<bool,0>	size(1):
	+---
	+---

class eastl::add_reference_impl<void>	size(1):
	+---
	+---

class eastl::add_lvalue_reference<void>	size(1):
	+---
	+---

class eastl::add_lvalue_reference<void const >	size(1):
	+---
	+---

class eastl::add_lvalue_reference<void volatile >	size(1):
	+---
	+---

class eastl::add_lvalue_reference<void const volatile >	size(1):
	+---
	+---

class eastl::add_rvalue_reference<void>	size(1):
	+---
	+---

class eastl::add_rvalue_reference<void const >	size(1):
	+---
	+---

class eastl::add_rvalue_reference<void volatile >	size(1):
	+---
	+---

class eastl::add_rvalue_reference<void const volatile >	size(1):
	+---
	+---

class eastl::is_void<void>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_void<void const >	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_void<void volatile >	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_void<void const volatile >	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::has_void_arg<>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,0>)
	| +---
	+---

class eastl::is_integral_helper<unsigned char>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_integral_helper<unsigned short>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_integral_helper<unsigned int>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_integral_helper<unsigned long>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_integral_helper<unsigned __int64>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_integral_helper<signed char>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_integral_helper<short>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_integral_helper<int>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_integral_helper<long>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_integral_helper<__int64>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_integral_helper<bool>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_integral_helper<char>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_integral_helper<wchar_t>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_floating_point_helper<float>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_floating_point_helper<double>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_floating_point_helper<long double>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::make_signed<unsigned char>	size(1):
	+---
	+---

class eastl::make_signed<unsigned char const >	size(1):
	+---
	+---

class eastl::make_signed<unsigned short>	size(1):
	+---
	+---

class eastl::make_signed<unsigned short const >	size(1):
	+---
	+---

class eastl::make_signed<unsigned int>	size(1):
	+---
	+---

class eastl::make_signed<unsigned int const >	size(1):
	+---
	+---

class eastl::make_signed<unsigned long>	size(1):
	+---
	+---

class eastl::make_signed<unsigned long const >	size(1):
	+---
	+---

class eastl::make_signed<unsigned __int64>	size(1):
	+---
	+---

class eastl::make_signed<unsigned __int64 const >	size(1):
	+---
	+---

class eastl::make_unsigned<signed char>	size(1):
	+---
	+---

class eastl::make_unsigned<signed char const >	size(1):
	+---
	+---

class eastl::make_unsigned<short>	size(1):
	+---
	+---

class eastl::make_unsigned<short const >	size(1):
	+---
	+---

class eastl::make_unsigned<int>	size(1):
	+---
	+---

class eastl::make_unsigned<int const >	size(1):
	+---
	+---

class eastl::make_unsigned<long>	size(1):
	+---
	+---

class eastl::make_unsigned<long const >	size(1):
	+---
	+---

class eastl::make_unsigned<__int64>	size(1):
	+---
	+---

class eastl::make_unsigned<__int64 const >	size(1):
	+---
	+---

class eastl::make_unsigned<char>	size(1):
	+---
	+---

class eastl::make_unsigned<char const >	size(1):
	+---
	+---

class eastl::aligned_storage_helper<,unsigned int, ?? >::type	size(0):
	+---
 0	| mCharData
	+---

class eastl::aligned_storage_helper<,unsigned int, ?? ::$01>::type	size(0):
	+---
 0	| mCharData
	+---

class eastl::aligned_storage_helper<,unsigned int, ?? ::$03>::type	size(0):
	+---
 0	| mCharData
	+---

class eastl::aligned_storage_helper<,unsigned int, ?? ::$07>::type	size(0):
	+---
 0	| mCharData
	+---

class eastl::aligned_storage_helper<,unsigned int, ?? ::$0BA>::type	size(0):
	+---
 0	| mCharData
	+---

class eastl::aligned_storage_helper<,unsigned int, ?? ::$0CA>::type	size(0):
	+---
 0	| mCharData
	+---

class eastl::aligned_storage_helper<,unsigned int, ?? ::$0EA>::type	size(0):
	+---
 0	| mCharData
	+---

class eastl::aligned_storage_helper<,unsigned int, ?? ::$0IA>::type	size(0):
	+---
 0	| mCharData
	+---

class eastl::aligned_storage_helper<,unsigned int, ?? ::$0BAA>::type	size(0):
	+---
 0	| mCharData
	+---

class eastl::aligned_storage_helper<,unsigned int, ?? ::$0CAA>::type	size(0):
	+---
 0	| mCharData
	+---

class eastl::aligned_storage_helper<,unsigned int, ?? ::$0EAA>::type	size(0):
	+---
 0	| mCharData
	+---

class eastl::aligned_storage_helper<,unsigned int, ?? ::$0IAA>::type	size(0):
	+---
 0	| mCharData
	+---

class eastl::aligned_storage_helper<,unsigned int, ?? ::$0BAAA>::type	size(0):
	+---
 0	| mCharData
	+---

class eastl::is_signed_helper<signed char>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_signed_helper<short>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_signed_helper<int>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_signed_helper<long>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_signed_helper<__int64>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_signed_helper<float>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_signed_helper<double>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_signed_helper<long double>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_signed_helper<char>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_unsigned_helper<unsigned char>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_unsigned_helper<unsigned short>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_unsigned_helper<unsigned int>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_unsigned_helper<unsigned long>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_unsigned_helper<unsigned __int64>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_unsigned_helper<wchar_t>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::integral_constant<unsigned int,0>	size(1):
	+---
	+---

class eastl::allocator	size(1):
	+---
	+---

class eastl::dummy_allocator	size(1):
	+---
	+---

class _div_t	size(8):
	+---
 0	| quot
 4	| rem
	+---

class _ldiv_t	size(8):
	+---
 0	| quot
 4	| rem
	+---

class _lldiv_t	size(16):
	+---
 0	| quot
 8	| rem
	+---

class <unnamed-tag>	size(10):
	+---
 0	| ld
	+---

class <unnamed-tag>	size(8):
	+---
 0	| x
	+---

class <unnamed-tag>	size(4):
	+---
 0	| f
	+---

class <unnamed-tag>	size(8):
	+---
 0	| x
	+---

class <unnamed-tag>	size(12):
	+---
 0	| ld12
	+---

class std::plus<void>	size(1):
	+---
	+---

class std::minus<void>	size(1):
	+---
	+---

class std::multiplies<void>	size(1):
	+---
	+---

class std::equal_to<void>	size(1):
	+---
	+---

class std::less<void>	size(1):
	+---
	+---

class std::is_void<void>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_void<void const >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_void<void volatile >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_void<void const volatile >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::integral_constant<unsigned int,0>	size(1):
	+---
	+---

class std::_Maximum<>	size(1):
	+---
 0	| +--- (base class std::integral_constant<unsigned int,0>)
	| +---
	+---

class std::_Unique_tag_common_type	size(1):
	+---
	+---

class std::common_type<>	size(1):
	+---
	+---

class std::_Invoker_pmf_object	size(1):
	+---
	+---

class std::_Invoker_pmf_refwrap	size(1):
	+---
	+---

class std::_Invoker_pmf_pointer	size(1):
	+---
	+---

class std::_Invoker_pmd_object	size(1):
	+---
	+---

class std::_Invoker_pmd_refwrap	size(1):
	+---
	+---

class std::_Invoker_pmd_pointer	size(1):
	+---
	+---

class std::_Invoker_functor	size(1):
	+---
	+---

class std::_Unforced	size(1):
	+---
	+---

class std::_Invoker_ret<struct std::_Unforced,0>	size(1):
	+---
	+---

class std::_Unique_tag_invoke_traits	size(1):
	+---
	+---

class std::_Swappable_with_helper_unique_type	size(1):
	+---
	+---

class std::hash<float>	size(1):
	+---
	+---

class std::hash<double>	size(1):
	+---
	+---

class std::hash<long double>	size(1):
	+---
	+---

class std::hash<std::nullptr_t>	size(1):
	+---
	+---

class std::_Unique_tag_is_nothrow_hashable	size(1):
	+---
	+---

class _heapinfo	size(12):
	+---
 0	| _pentry
 4	| _size
 8	| _useflag
	+---

class __std_exception_data	size(8):
	+---
 0	| _What
 4	| _DoFree
  	| <alignment member> (size=3)
	+---

class std::exception	size(12):
	+---
 0	| {vfptr}
 4	| __std_exception_data _Data
	+---

std::exception::$vftable@:
	| &exception_meta
	|  0
 0	| &std::exception::{dtor} 
 1	| &std::exception::what 

std::exception::{dtor} this adjustor: 0
std::exception::what this adjustor: 0
std::exception::__delDtor this adjustor: 0
std::exception::__vecDelDtor this adjustor: 0

class std::bad_exception	size(12):
	+---
 0	| +--- (base class std::exception)
 0	| | {vfptr}
 4	| | __std_exception_data _Data
	| +---
	+---

std::bad_exception::$vftable@:
	| &bad_exception_meta
	|  0
 0	| &std::bad_exception::{dtor} 
 1	| &std::exception::what 

std::bad_exception::{dtor} this adjustor: 0
std::bad_exception::__delDtor this adjustor: 0
std::bad_exception::__vecDelDtor this adjustor: 0

class std::bad_alloc	size(12):
	+---
 0	| +--- (base class std::exception)
 0	| | {vfptr}
 4	| | __std_exception_data _Data
	| +---
	+---

std::bad_alloc::$vftable@:
	| &bad_alloc_meta
	|  0
 0	| &std::bad_alloc::{dtor} 
 1	| &std::exception::what 

std::bad_alloc::{dtor} this adjustor: 0
std::bad_alloc::__delDtor this adjustor: 0
std::bad_alloc::__vecDelDtor this adjustor: 0

class std::bad_array_new_length	size(12):
	+---
 0	| +--- (base class std::bad_alloc)
 0	| | +--- (base class std::exception)
 0	| | | {vfptr}
 4	| | | __std_exception_data _Data
	| | +---
	| +---
	+---

std::bad_array_new_length::$vftable@:
	| &bad_array_new_length_meta
	|  0
 0	| &std::bad_array_new_length::{dtor} 
 1	| &std::exception::what 

std::bad_array_new_length::{dtor} this adjustor: 0
std::bad_array_new_length::__delDtor this adjustor: 0
std::bad_array_new_length::__vecDelDtor this adjustor: 0

class std::exception_ptr	size(8):
	+---
 0	| _Data1
 4	| _Data2
	+---

class std::nested_exception	size(12):
	+---
 0	| {vfptr}
 4	| exception_ptr _Exc
	+---

std::nested_exception::$vftable@:
	| &nested_exception_meta
	|  0
 0	| &std::nested_exception::{dtor} 

std::nested_exception::{dtor} this adjustor: 0
std::nested_exception::__delDtor this adjustor: 0
std::nested_exception::__vecDelDtor this adjustor: 0

class std::nothrow_t	size(1):
	+---
	+---

class eastl::input_iterator_tag	size(1):
	+---
	+---

class eastl::output_iterator_tag	size(1):
	+---
	+---

class eastl::forward_iterator_tag	size(1):
	+---
 0	| +--- (base class eastl::input_iterator_tag)
	| +---
	+---

class eastl::bidirectional_iterator_tag	size(1):
	+---
 0	| +--- (base class eastl::forward_iterator_tag)
 0	| | +--- (base class eastl::input_iterator_tag)
	| | +---
	| +---
	+---

class eastl::random_access_iterator_tag	size(1):
	+---
 0	| +--- (base class eastl::bidirectional_iterator_tag)
 0	| | +--- (base class eastl::forward_iterator_tag)
 0	| | | +--- (base class eastl::input_iterator_tag)
	| | | +---
	| | +---
	| +---
	+---

class eastl::contiguous_iterator_tag	size(1):
	+---
 0	| +--- (base class eastl::random_access_iterator_tag)
 0	| | +--- (base class eastl::bidirectional_iterator_tag)
 0	| | | +--- (base class eastl::forward_iterator_tag)
 0	| | | | +--- (base class eastl::input_iterator_tag)
	| | | | +---
	| | | +---
	| | +---
	| +---
	+---

class eastl::iterator<struct eastl::output_iterator_tag,void,void,void,void>	size(1):
	+---
	+---

class eastl::advance_bi_impl<1>	size(1):
	+---
	+---

class <unnamed-tag>	size(16):
	+---
 0	| _Word
 0	| _Float
 0	| _Double
 0	| _Long_double
	+---

class eastl::Internal::numeric_limits_base	size(1):
	+---
	+---

class eastl::numeric_limits<bool>	size(1):
	+---
	+---

class eastl::numeric_limits<char>	size(1):
	+---
	+---

class eastl::numeric_limits<unsigned char>	size(1):
	+---
	+---

class eastl::numeric_limits<signed char>	size(1):
	+---
	+---

class eastl::numeric_limits<wchar_t>	size(1):
	+---
	+---

class eastl::numeric_limits<char16_t>	size(1):
	+---
	+---

class eastl::numeric_limits<char32_t>	size(1):
	+---
	+---

class eastl::numeric_limits<unsigned short>	size(1):
	+---
	+---

class eastl::numeric_limits<short>	size(1):
	+---
	+---

class eastl::numeric_limits<unsigned int>	size(1):
	+---
	+---

class eastl::numeric_limits<int>	size(1):
	+---
	+---

class eastl::numeric_limits<unsigned long>	size(1):
	+---
	+---

class eastl::numeric_limits<long>	size(1):
	+---
	+---

class eastl::numeric_limits<unsigned __int64>	size(1):
	+---
	+---

class eastl::numeric_limits<__int64>	size(1):
	+---
	+---

class eastl::numeric_limits<float>	size(1):
	+---
	+---

class eastl::numeric_limits<double>	size(1):
	+---
	+---

class eastl::numeric_limits<long double>	size(1):
	+---
	+---

class eastl::allocator_arg_t	size(1):
	+---
	+---

class eastl::less<void>	size(1):
	+---
	+---

class eastl::plus<void>	size(1):
	+---
	+---

class eastl::minus<void>	size(1):
	+---
	+---

class eastl::multiplies<void>	size(1):
	+---
	+---

class eastl::divides<void>	size(1):
	+---
	+---

class eastl::modulus<void>	size(1):
	+---
	+---

class eastl::negate<void>	size(1):
	+---
	+---

class eastl::equal_to<void>	size(1):
	+---
	+---

class eastl::not_equal_to<void>	size(1):
	+---
	+---

class eastl::greater<void>	size(1):
	+---
	+---

class eastl::greater_equal<void>	size(1):
	+---
	+---

class eastl::less_equal<void>	size(1):
	+---
	+---

class eastl::logical_and<void>	size(1):
	+---
	+---

class eastl::logical_or<void>	size(1):
	+---
	+---

class eastl::logical_not<void>	size(1):
	+---
	+---

class eastl::hash<bool>	size(1):
	+---
	+---

class eastl::hash<char>	size(1):
	+---
	+---

class eastl::hash<signed char>	size(1):
	+---
	+---

class eastl::hash<unsigned char>	size(1):
	+---
	+---

class eastl::hash<char16_t>	size(1):
	+---
	+---

class eastl::hash<char32_t>	size(1):
	+---
	+---

class eastl::hash<wchar_t>	size(1):
	+---
	+---

class eastl::hash<short>	size(1):
	+---
	+---

class eastl::hash<unsigned short>	size(1):
	+---
	+---

class eastl::hash<int>	size(1):
	+---
	+---

class eastl::hash<unsigned int>	size(1):
	+---
	+---

class eastl::hash<long>	size(1):
	+---
	+---

class eastl::hash<unsigned long>	size(1):
	+---
	+---

class eastl::hash<__int64>	size(1):
	+---
	+---

class eastl::hash<unsigned __int64>	size(1):
	+---
	+---

class eastl::hash<float>	size(1):
	+---
	+---

class eastl::hash<double>	size(1):
	+---
	+---

class eastl::hash<long double>	size(1):
	+---
	+---

class eastl::hash<char *>	size(1):
	+---
	+---

class eastl::hash<char const *>	size(1):
	+---
	+---

class eastl::hash<char16_t *>	size(1):
	+---
	+---

class eastl::hash<char16_t const *>	size(1):
	+---
	+---

class eastl::hash<char32_t *>	size(1):
	+---
	+---

class eastl::hash<char32_t const *>	size(1):
	+---
	+---

class eastl::detail::functor_storage_type::<unnamed-tag>	size(8):
	+---
 0	| first
 0	| padding
	+---

class eastl::detail::functor_storage_type	size(8):
	+---
 0	| first
 0	| padding
	+---

class eastl::detail::allocator_storage_type::<unnamed-tag>	size(8):
	+---
 0	| first
 0	| padding
	+---

class eastl::detail::allocator_storage_type	size(8):
	+---
 0	| first
 0	| padding
	+---

class eastl::detail::empty_struct	size(1):
	+---
	+---

class eastl::detail::total_storage_type	size(20):
	+---
 0	| allocator_storage_type allocator_storage
 8	| functor_storage_type functor
16	| function_table
	+---

class eastl::detail::function_table	size(16):
	+---
 0	| call_move_and_destroy
 4	| call_copy
 8	| call_copy_functor_only
12	| call_destroy
	+---

class eastl::Internal::in_place_tag	size(1):
	+---
	+---

class eastl::in_place_tag	size(1):
	+---
	+---

class eastl::iter_swap_impl<1>	size(1):
	+---
	+---

class eastl::integral_constant<unsigned int,2>	size(1):
	+---
	+---

class eastl::GetPair<0>	size(1):
	+---
	+---

class eastl::GetPair<1>	size(1):
	+---
	+---

class eastl::move_and_copy_helper<struct eastl::random_access_iterator_tag,0,0>	size(1):
	+---
	+---

class eastl::move_and_copy_helper<struct eastl::random_access_iterator_tag,1,0>	size(1):
	+---
	+---

class eastl::fill_imp<1>	size(1):
	+---
	+---

class eastl::fill_n_imp<1>	size(1):
	+---
	+---

class eastl::uniform_int_distribution<`template-type-parameter-1'>::param_type	size(0):
	+---
 0	| mA
 0	| mB
	+---

class __JUMP_BUFFER	size(64):
	+---
 0	| Ebp
 4	| Ebx
 8	| Edi
12	| Esi
16	| Esp
20	| Eip
24	| Registration
28	| TryLevel
32	| Cookie
36	| UnwindFunc
40	| UnwindData
	+---

class __m64	size(8):
	+---
 0	| m64_u64
 0	| m64_f32
 0	| m64_i8
 0	| m64_i16
 0	| m64_i32
 0	| m64_i64
 0	| m64_u8
 0	| m64_u16
 0	| m64_u32
	+---

class __m128	size(16):
	+---
 0	| m128_f32
 0	| m128_u64
 0	| m128_i8
 0	| m128_i16
 0	| m128_i32
 0	| m128_i64
 0	| m128_u8
 0	| m128_u16
 0	| m128_u32
	+---

class __m128i	size(16):
	+---
 0	| m128i_i8
 0	| m128i_i16
 0	| m128i_i32
 0	| m128i_i64
 0	| m128i_u8
 0	| m128i_u16
 0	| m128i_u32
 0	| m128i_u64
	+---

class __m128d	size(16):
	+---
 0	| m128d_f64
	+---

class __m256	size(32):
	+---
 0	| m256_f32
	+---

class __m256d	size(32):
	+---
 0	| m256d_f64
	+---

class __m256i	size(32):
	+---
 0	| m256i_i8
 0	| m256i_i16
 0	| m256i_i32
 0	| m256i_i64
 0	| m256i_u8
 0	| m256i_u16
 0	| m256i_u32
 0	| m256i_u64
	+---

class __m512	size(64):
	+---
 0	| m512_f32
	+---

class __m512d	size(64):
	+---
 0	| m512d_f64
	+---

class __m512i	size(64):
	+---
 0	| m512i_i8
 0	| m512i_i16
 0	| m512i_i32
 0	| m512i_i64
 0	| m512i_u8
 0	| m512i_u16
 0	| m512i_u32
 0	| m512i_u64
	+---

class eastl::move_and_copy_backward_helper<struct eastl::random_access_iterator_tag,1,0>	size(1):
	+---
	+---

class eastl::move_and_copy_backward_helper<struct eastl::random_access_iterator_tag,0,0>	size(1):
	+---
	+---

class eastl::remove_const<int>	size(1):
	+---
	+---

class eastl::remove_volatile<int>	size(1):
	+---
	+---

class eastl::remove_cv<int>	size(1):
	+---
	+---

class eastl::is_integral<int>	size(1):
	+---
 0	| +--- (base class eastl::is_integral_helper<int>)
 0	| | +--- (base class eastl::integral_constant<bool,1>)
	| | +---
	| +---
	+---

class eastl::is_floating_point_helper<int>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,0>)
	| +---
	+---

class eastl::is_floating_point<int>	size(1):
	+---
 0	| +--- (base class eastl::is_floating_point_helper<int>)
 0	| | +--- (base class eastl::integral_constant<bool,0>)
	| | +---
	| +---
	+---

class eastl::is_arithmetic<int>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::is_enum<int>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,0>)
	| +---
	+---

class eastl::is_mem_fun_pointer_value<int>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,0>)
	| +---
	+---

class eastl::is_member_function_pointer<int>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,0>)
	| +---
	+---

class eastl::is_member_pointer<int>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,0>)
	| +---
	+---

class eastl::is_same<int,std::nullptr_t>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,0>)
	| +---
	+---

class eastl::is_null_pointer<int>	size(1):
	+---
 0	| +--- (base class eastl::is_same<int,std::nullptr_t>)
 0	| | +--- (base class eastl::integral_constant<bool,0>)
	| | +---
	| +---
	+---

class eastl::is_scalar<int>	size(1):
	+---
 0	| +--- (base class eastl::integral_constant<bool,1>)
	| +---
	+---

class eastl::enable_if<0,int const &>	size(1):
	+---
	+---

class eastl::enable_if<1,int>	size(1):
	+---
	+---

class eastl::Internal::rotate_helper<struct eastl::forward_iterator_tag,1>	size(1):
	+---
	+---

class eastl::Internal::rotate_helper<struct eastl::bidirectional_iterator_tag,0>	size(1):
	+---
	+---

class eastl::Internal::rotate_helper<struct eastl::bidirectional_iterator_tag,1>	size(1):
	+---
	+---

class eastl::Internal::rotate_helper<struct eastl::random_access_iterator_tag,0>	size(1):
	+---
	+---

class eastl::Internal::rotate_helper<struct eastl::random_access_iterator_tag,1>	size(1):
	+---
	+---

class eastl::rbtree_node_base	size(16):
	+---
 0	| mColor
  	| <alignment member> (size=3)
 4	| mpNodeParent
 8	| mpNodeLeft
12	| mpNodeRight
	+---

class _iobuf	size(4):
	+---
 0	| _Placeholder
	+---

class _wfinddata32_t	size(540):
	+---
 0	| attrib
 4	| time_create
 8	| time_access
12	| time_write
16	| size
20	| name
	+---

class _wfinddata32i64_t	size(544):
	+---
 0	| attrib
 4	| time_create
 8	| time_access
12	| time_write
16	| size
24	| name
	+---

class _wfinddata64i32_t	size(560):
	+---
 0	| attrib
  	| <alignment member> (size=4)
 8	| time_create
16	| time_access
24	| time_write
32	| size
36	| name
  	| <alignment member> (size=4)
	+---

class _wfinddata64_t	size(560):
	+---
 0	| attrib
  	| <alignment member> (size=4)
 8	| time_create
16	| time_access
24	| time_write
32	| size
40	| name
	+---

class tm	size(36):
	+---
 0	| tm_sec
 4	| tm_min
 8	| tm_hour
12	| tm_mday
16	| tm_mon
20	| tm_year
24	| tm_wday
28	| tm_yday
32	| tm_isdst
	+---

class _stat32	size(36):
	+---
 0	| st_dev
 4	| st_ino
 6	| st_mode
 8	| st_nlink
10	| st_uid
12	| st_gid
  	| <alignment member> (size=2)
16	| st_rdev
20	| st_size
24	| st_atime
28	| st_mtime
32	| st_ctime
	+---

class _stat32i64	size(48):
	+---
 0	| st_dev
 4	| st_ino
 6	| st_mode
 8	| st_nlink
10	| st_uid
12	| st_gid
  	| <alignment member> (size=2)
16	| st_rdev
  	| <alignment member> (size=4)
24	| st_size
32	| st_atime
36	| st_mtime
40	| st_ctime
  	| <alignment member> (size=4)
	+---

class _stat64i32	size(48):
	+---
 0	| st_dev
 4	| st_ino
 6	| st_mode
 8	| st_nlink
10	| st_uid
12	| st_gid
  	| <alignment member> (size=2)
16	| st_rdev
20	| st_size
24	| st_atime
32	| st_mtime
40	| st_ctime
	+---

class _stat64	size(56):
	+---
 0	| st_dev
 4	| st_ino
 6	| st_mode
 8	| st_nlink
10	| st_uid
12	| st_gid
  	| <alignment member> (size=2)
16	| st_rdev
  	| <alignment member> (size=4)
24	| st_size
32	| st_atime
40	| st_mtime
48	| st_ctime
	+---

class stat	size(48):
	+---
 0	| st_dev
 4	| st_ino
 6	| st_mode
 8	| st_nlink
10	| st_uid
12	| st_gid
  	| <alignment member> (size=2)
16	| st_rdev
20	| st_size
24	| st_atime
32	| st_mtime
40	| st_ctime
	+---

class std::_Num_base	size(1):
	+---
	+---

class std::_Num_int_base	size(1):
	+---
 0	| +--- (base class std::_Num_base)
	| +---
	+---

class std::_Num_float_base	size(1):
	+---
 0	| +--- (base class std::_Num_base)
	| +---
	+---

class std::numeric_limits<char>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<wchar_t>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<bool>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<signed char>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<unsigned char>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<short>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<unsigned short>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<char16_t>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<int>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<unsigned int>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<long>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<unsigned long>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<char32_t>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<__int64>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<unsigned __int64>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<float>	size(1):
	+---
 0	| +--- (base class std::_Num_float_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<double>	size(1):
	+---
 0	| +--- (base class std::_Num_float_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<long double>	size(1):
	+---
 0	| +--- (base class std::_Num_float_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class _CrtMemState	size(52):
	+---
 0	| pBlockHeader
 4	| lCounts
24	| lSizes
44	| lHighWaterCount
48	| lTotalCount
	+---

class std::_Char_traits<char16_t,unsigned short>	size(1):
	+---
	+---

class std::char_traits<char16_t>	size(1):
	+---
 0	| +--- (base class std::_Char_traits<char16_t,unsigned short>)
	| +---
	+---

class std::_Char_traits<char32_t,unsigned int>	size(1):
	+---
	+---

class std::char_traits<char32_t>	size(1):
	+---
 0	| +--- (base class std::_Char_traits<char32_t,unsigned int>)
	| +---
	+---

class std::char_traits<wchar_t>	size(1):
	+---
	+---

class std::char_traits<unsigned short>	size(1):
	+---
	+---

class std::char_traits<char>	size(1):
	+---
	+---

class std::piecewise_construct_t	size(1):
	+---
	+---

class std::_Unique_tag_tuple_size_sfinae	size(1):
	+---
	+---

class std::integral_constant<unsigned int,2>	size(1):
	+---
	+---

class std::_Container_base0	size(1):
	+---
	+---

class std::_Iterator_base0	size(1):
	+---
	+---

class std::_Container_proxy	size(8):
	+---
 0	| _Mycont
 4	| _Myfirstiter
	+---

class std::_Container_base12	size(4):
	+---
 0	| _Myproxy
	+---

class std::_Iterator_base12	size(8):
	+---
 0	| _Myproxy
 4	| _Mynextiter
	+---

class std::_Zero_then_variadic_args_t	size(1):
	+---
	+---

class std::_One_then_variadic_args_t	size(1):
	+---
	+---

class std::input_iterator_tag	size(1):
	+---
	+---

class std::output_iterator_tag	size(1):
	+---
	+---

class std::forward_iterator_tag	size(1):
	+---
 0	| +--- (base class std::input_iterator_tag)
	| +---
	+---

class std::bidirectional_iterator_tag	size(1):
	+---
 0	| +--- (base class std::forward_iterator_tag)
 0	| | +--- (base class std::input_iterator_tag)
	| | +---
	| +---
	+---

class std::random_access_iterator_tag	size(1):
	+---
 0	| +--- (base class std::bidirectional_iterator_tag)
 0	| | +--- (base class std::forward_iterator_tag)
 0	| | | +--- (base class std::input_iterator_tag)
	| | | +---
	| | +---
	| +---
	+---

class std::_General_ptr_iterator_tag	size(1):
	+---
	+---

class std::_Trivially_copyable_ptr_iterator_tag	size(1):
	+---
 0	| +--- (base class std::_General_ptr_iterator_tag)
	| +---
	+---

class std::_Really_trivial_ptr_iterator_tag	size(1):
	+---
 0	| +--- (base class std::_Trivially_copyable_ptr_iterator_tag)
 0	| | +--- (base class std::_General_ptr_iterator_tag)
	| | +---
	| +---
	+---

class std::_Unused_parameter	size(1):
	+---
	+---

class std::_Distance_unknown	size(1):
	+---
	+---

class std::_Is_character<char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_character<signed char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_character<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::allocator_arg_t	size(1):
	+---
	+---

class std::_Has_no_alloc_construct_tag	size(1):
	+---
	+---

class std::_Has_no_alloc_destroy_tag	size(1):
	+---
	+---

class std::_Has_allocate_hint_tag	size(1):
	+---
	+---

class std::_Has_max_size_tag	size(1):
	+---
	+---

class std::_Has_select_on_container_copy_construction_tag	size(1):
	+---
	+---

class std::allocator<void>	size(1):
	+---
	+---

class std::_String_val<`template-type-parameter-1'>::_Bxty	size(0):
	+---
 0	| _Buf
 0	| _Ptr
 0	| _Alias
	+---

class std::logic_error	size(12):
	+---
 0	| +--- (base class std::exception)
 0	| | {vfptr}
 4	| | __std_exception_data _Data
	| +---
	+---

std::logic_error::$vftable@:
	| &logic_error_meta
	|  0
 0	| &std::logic_error::{dtor} 
 1	| &std::exception::what 

std::logic_error::{dtor} this adjustor: 0
std::logic_error::__delDtor this adjustor: 0
std::logic_error::__vecDelDtor this adjustor: 0

class std::is_const<char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::allocator<char>	size(1):
	+---
	+---

class std::_Is_default_allocator<class std::allocator<char>,void>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::conditional<1,struct std::_Default_allocator_traits<class std::allocator<char> >,struct std::_Normal_allocator_traits<class std::allocator<char> > >	size(1):
	+---
	+---

class std::_Default_allocator_traits<class std::allocator<char> >	size(1):
	+---
	+---

class std::allocator_traits<class std::allocator<char> >	size(1):
	+---
 0	| +--- (base class std::_Default_allocator_traits<class std::allocator<char> >)
	| +---
	+---

class std::is_same<unsigned int,unsigned int>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_same<int,int>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_same<char *,char *>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_same<char const *,char const *>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_simple_alloc<class std::allocator<char> >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::conditional<1,struct std::_Simple_types<char>,struct std::_String_iter_types<char,unsigned int,int,char *,char const *,char &,char const &> >	size(1):
	+---
	+---

class std::_String_base_types<char,class std::allocator<char> >	size(1):
	+---
	+---

class std::_Simple_types<char>	size(1):
	+---
	+---

class std::_String_val<struct std::_Simple_types<char> >::_Bxty	size(16):
	+---
 0	| _Buf
 0	| _Ptr
 0	| _Alias
	+---

class std::_String_val<struct std::_Simple_types<char> >	size(24):
	+---
 0	| +--- (base class std::_Container_base0)
	| +---
 0	| _Bxty _Bx
16	| _Mysize
20	| _Myres
	+---

class std::is_empty<class std::allocator<char> >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_final<class std::allocator<char> >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::_Compressed_pair<class std::allocator<char>,class std::_String_val<struct std::_Simple_types<char> >,1>	size(24):
	+---
 0	| +--- (base class std::allocator<char>)
	| +---
 0	| ?$_String_val@U?$_Simple_types@D@std@@ _Myval2
	+---

class std::_String_alloc<struct std::_String_base_types<char,class std::allocator<char> > >	size(24):
	+---
 0	| ?$_Compressed_pair@V?$allocator@D@std@@V?$_String_val@U?$_Simple_types@D@std@@@2@$00 _Mypair
	+---

class std::is_same<char,char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_specialization<struct std::char_traits<char>,struct std::char_traits>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_trivial<char *>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_empty<struct std::_Container_base0>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_nothrow_constructible<class std::allocator<char> >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_nothrow_default_constructible<class std::allocator<char> >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::basic_string<char,struct std::char_traits<char>,class std::allocator<char> >	size(24):
	+---
 0	| +--- (base class std::_String_alloc<struct std::_String_base_types<char,class std::allocator<char> > >)
 0	| | ?$_Compressed_pair@V?$allocator@D@std@@V?$_String_val@U?$_Simple_types@D@std@@@2@$00 _Mypair
	| +---
	+---

class std::domain_error	size(12):
	+---
 0	| +--- (base class std::logic_error)
 0	| | +--- (base class std::exception)
 0	| | | {vfptr}
 4	| | | __std_exception_data _Data
	| | +---
	| +---
	+---

std::domain_error::$vftable@:
	| &domain_error_meta
	|  0
 0	| &std::domain_error::{dtor} 
 1	| &std::exception::what 

std::domain_error::{dtor} this adjustor: 0
std::domain_error::__delDtor this adjustor: 0
std::domain_error::__vecDelDtor this adjustor: 0

class std::invalid_argument	size(12):
	+---
 0	| +--- (base class std::logic_error)
 0	| | +--- (base class std::exception)
 0	| | | {vfptr}
 4	| | | __std_exception_data _Data
	| | +---
	| +---
	+---

std::invalid_argument::$vftable@:
	| &invalid_argument_meta
	|  0
 0	| &std::invalid_argument::{dtor} 
 1	| &std::exception::what 

std::invalid_argument::{dtor} this adjustor: 0
std::invalid_argument::__delDtor this adjustor: 0
std::invalid_argument::__vecDelDtor this adjustor: 0

class std::length_error	size(12):
	+---
 0	| +--- (base class std::logic_error)
 0	| | +--- (base class std::exception)
 0	| | | {vfptr}
 4	| | | __std_exception_data _Data
	| | +---
	| +---
	+---

std::length_error::$vftable@:
	| &length_error_meta
	|  0
 0	| &std::length_error::{dtor} 
 1	| &std::exception::what 

std::length_error::{dtor} this adjustor: 0
std::length_error::__delDtor this adjustor: 0
std::length_error::__vecDelDtor this adjustor: 0

class std::out_of_range	size(12):
	+---
 0	| +--- (base class std::logic_error)
 0	| | +--- (base class std::exception)
 0	| | | {vfptr}
 4	| | | __std_exception_data _Data
	| | +---
	| +---
	+---

std::out_of_range::$vftable@:
	| &out_of_range_meta
	|  0
 0	| &std::out_of_range::{dtor} 
 1	| &std::exception::what 

std::out_of_range::{dtor} this adjustor: 0
std::out_of_range::__delDtor this adjustor: 0
std::out_of_range::__vecDelDtor this adjustor: 0

class std::runtime_error	size(12):
	+---
 0	| +--- (base class std::exception)
 0	| | {vfptr}
 4	| | __std_exception_data _Data
	| +---
	+---

std::runtime_error::$vftable@:
	| &runtime_error_meta
	|  0
 0	| &std::runtime_error::{dtor} 
 1	| &std::exception::what 

std::runtime_error::{dtor} this adjustor: 0
std::runtime_error::__delDtor this adjustor: 0
std::runtime_error::__vecDelDtor this adjustor: 0

class std::overflow_error	size(12):
	+---
 0	| +--- (base class std::runtime_error)
 0	| | +--- (base class std::exception)
 0	| | | {vfptr}
 4	| | | __std_exception_data _Data
	| | +---
	| +---
	+---

std::overflow_error::$vftable@:
	| &overflow_error_meta
	|  0
 0	| &std::overflow_error::{dtor} 
 1	| &std::exception::what 

std::overflow_error::{dtor} this adjustor: 0
std::overflow_error::__delDtor this adjustor: 0
std::overflow_error::__vecDelDtor this adjustor: 0

class std::underflow_error	size(12):
	+---
 0	| +--- (base class std::runtime_error)
 0	| | +--- (base class std::exception)
 0	| | | {vfptr}
 4	| | | __std_exception_data _Data
	| | +---
	| +---
	+---

std::underflow_error::$vftable@:
	| &underflow_error_meta
	|  0
 0	| &std::underflow_error::{dtor} 
 1	| &std::exception::what 

std::underflow_error::{dtor} this adjustor: 0
std::underflow_error::__delDtor this adjustor: 0
std::underflow_error::__vecDelDtor this adjustor: 0

class std::range_error	size(12):
	+---
 0	| +--- (base class std::runtime_error)
 0	| | +--- (base class std::exception)
 0	| | | {vfptr}
 4	| | | __std_exception_data _Data
	| | +---
	| +---
	+---

std::range_error::$vftable@:
	| &range_error_meta
	|  0
 0	| &std::range_error::{dtor} 
 1	| &std::exception::what 

std::range_error::{dtor} this adjustor: 0
std::range_error::__delDtor this adjustor: 0
std::range_error::__vecDelDtor this adjustor: 0

class CPatcher	size(1):
	+---
	+---

class _PROCESSOR_NUMBER	size(4):
	+---
 0	| Group
 2	| Number
 3	| Reserved
	+---

class _GROUP_AFFINITY	size(12):
	+---
 0	| Mask
 4	| Group
 6	| Reserved
	+---

class _FLOAT128	size(16):
	+---
 0	| LowPart
 8	| HighPart
	+---

class _LARGE_INTEGER::<unnamed-tag>	size(8):
	+---
 0	| LowPart
 4	| HighPart
	+---

class _LARGE_INTEGER::<unnamed-tag>	size(8):
	+---
 0	| LowPart
 4	| HighPart
	+---

class _LARGE_INTEGER	size(8):
	+---
 0	| LowPart
 4	| HighPart
 0	| <unnamed-type-u> u
 0	| QuadPart
	+---

class _ULARGE_INTEGER::<unnamed-tag>	size(8):
	+---
 0	| LowPart
 4	| HighPart
	+---

class _ULARGE_INTEGER::<unnamed-tag>	size(8):
	+---
 0	| LowPart
 4	| HighPart
	+---

class _ULARGE_INTEGER	size(8):
	+---
 0	| LowPart
 4	| HighPart
 0	| <unnamed-type-u> u
 0	| QuadPart
	+---

class _LUID	size(8):
	+---
 0	| LowPart
 4	| HighPart
	+---

class _LIST_ENTRY	size(8):
	+---
 0	| Flink
 4	| Blink
	+---

class _SINGLE_LIST_ENTRY	size(4):
	+---
 0	| Next
	+---

class LIST_ENTRY32	size(8):
	+---
 0	| Flink
 4	| Blink
	+---

class LIST_ENTRY64	size(16):
	+---
 0	| Flink
 8	| Blink
	+---

class _GUID	size(16):
	+---
 0	| Data1
 4	| Data2
 6	| Data3
 8	| Data4
	+---

class _OBJECTID	size(20):
	+---
 0	| _GUID Lineage
16	| Uniquifier
	+---

class _ENUM_FLAG_INTEGER_FOR_SIZE<1>	size(1):
	+---
	+---

class _ENUM_FLAG_INTEGER_FOR_SIZE<2>	size(1):
	+---
	+---

class _ENUM_FLAG_INTEGER_FOR_SIZE<4>	size(1):
	+---
	+---

class _ENUM_FLAG_INTEGER_FOR_SIZE<8>	size(1):
	+---
	+---

class _M128A	size(16):
	+---
 0	| Low
 8	| High
	+---

class _XSAVE_FORMAT	size(512):
	+---
 0	| ControlWord
 2	| StatusWord
 4	| TagWord
 5	| Reserved1
 6	| ErrorOpcode
 8	| ErrorOffset
12	| ErrorSelector
14	| Reserved2
16	| DataOffset
20	| DataSelector
22	| Reserved3
24	| MxCsr
28	| MxCsr_Mask
32	| FloatRegisters
160	| XmmRegisters
288	| Reserved4
	+---

class _XSAVE_AREA_HEADER	size(64):
	+---
 0	| Mask
 8	| CompactionMask
16	| Reserved2
	+---

class _XSAVE_AREA	size(576):
	+---
 0	| _XSAVE_FORMAT LegacyState
512	| _XSAVE_AREA_HEADER Header
	+---

class _XSTATE_CONTEXT	size(32):
	+---
 0	| Mask
 8	| Length
12	| Reserved1
16	| Area
20	| Reserved2
24	| Buffer
28	| Reserved3
	+---

class _SCOPE_TABLE_AMD64::<unnamed-tag>	size(16):
	+---
 0	| BeginAddress
 4	| EndAddress
 8	| HandlerAddress
12	| JumpTarget
	+---

class _SCOPE_TABLE_AMD64	size(20):
	+---
 0	| Count
 4	| ScopeRecord
	+---

class _SCOPE_TABLE_ARM::<unnamed-tag>	size(16):
	+---
 0	| BeginAddress
 4	| EndAddress
 8	| HandlerAddress
12	| JumpTarget
	+---

class _SCOPE_TABLE_ARM	size(20):
	+---
 0	| Count
 4	| ScopeRecord
	+---

class _SCOPE_TABLE_ARM64::<unnamed-tag>	size(16):
	+---
 0	| BeginAddress
 4	| EndAddress
 8	| HandlerAddress
12	| JumpTarget
	+---

class _SCOPE_TABLE_ARM64	size(20):
	+---
 0	| Count
 4	| ScopeRecord
	+---

class _FLOATING_SAVE_AREA	size(112):
	+---
 0	| ControlWord
 4	| StatusWord
 8	| TagWord
12	| ErrorOffset
16	| ErrorSelector
20	| DataOffset
24	| DataSelector
28	| RegisterArea
108	| Spare0
	+---

class _CONTEXT	size(716):
	+---
 0	| ContextFlags
 4	| Dr0
 8	| Dr1
12	| Dr2
16	| Dr3
20	| Dr6
24	| Dr7
28	| _FLOATING_SAVE_AREA FloatSave
140	| SegGs
144	| SegFs
148	| SegEs
152	| SegDs
156	| Edi
160	| Esi
164	| Ebx
168	| Edx
172	| Ecx
176	| Eax
180	| Ebp
184	| Eip
188	| SegCs
192	| EFlags
196	| Esp
200	| SegSs
204	| ExtendedRegisters
	+---

class _LDT_ENTRY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0	| BaseMid
 1	| Flags1
 2	| Flags2
 3	| BaseHi
	+---

class _LDT_ENTRY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| BaseMid (bitstart=0,nbits=8)
 0.	| Type (bitstart=8,nbits=5)
 0.	| Dpl (bitstart=13,nbits=2)
 0.	| Pres (bitstart=15,nbits=1)
 0.	| LimitHi (bitstart=16,nbits=4)
 0.	| Sys (bitstart=20,nbits=1)
 0.	| Reserved_0 (bitstart=21,nbits=1)
 0.	| Default_Big (bitstart=22,nbits=1)
 0.	| Granularity (bitstart=23,nbits=1)
 0.	| BaseHi (bitstart=24,nbits=8)
	+---

class _LDT_ENTRY::<unnamed-tag>	size(4):
	+---
 0	| <unnamed-type-Bytes> Bytes
 0	| <unnamed-type-Bits> Bits
	+---

class _LDT_ENTRY	size(8):
	+---
 0	| LimitLow
 2	| BaseLow
 4	| <unnamed-type-HighWord> HighWord
	+---

class _WOW64_FLOATING_SAVE_AREA	size(112):
	+---
 0	| ControlWord
 4	| StatusWord
 8	| TagWord
12	| ErrorOffset
16	| ErrorSelector
20	| DataOffset
24	| DataSelector
28	| RegisterArea
108	| Cr0NpxState
	+---

class _WOW64_CONTEXT	size(716):
	+---
 0	| ContextFlags
 4	| Dr0
 8	| Dr1
12	| Dr2
16	| Dr3
20	| Dr6
24	| Dr7
28	| _WOW64_FLOATING_SAVE_AREA FloatSave
140	| SegGs
144	| SegFs
148	| SegEs
152	| SegDs
156	| Edi
160	| Esi
164	| Ebx
168	| Edx
172	| Ecx
176	| Eax
180	| Ebp
184	| Eip
188	| SegCs
192	| EFlags
196	| Esp
200	| SegSs
204	| ExtendedRegisters
	+---

class _WOW64_LDT_ENTRY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0	| BaseMid
 1	| Flags1
 2	| Flags2
 3	| BaseHi
	+---

class _WOW64_LDT_ENTRY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| BaseMid (bitstart=0,nbits=8)
 0.	| Type (bitstart=8,nbits=5)
 0.	| Dpl (bitstart=13,nbits=2)
 0.	| Pres (bitstart=15,nbits=1)
 0.	| LimitHi (bitstart=16,nbits=4)
 0.	| Sys (bitstart=20,nbits=1)
 0.	| Reserved_0 (bitstart=21,nbits=1)
 0.	| Default_Big (bitstart=22,nbits=1)
 0.	| Granularity (bitstart=23,nbits=1)
 0.	| BaseHi (bitstart=24,nbits=8)
	+---

class _WOW64_LDT_ENTRY::<unnamed-tag>	size(4):
	+---
 0	| <unnamed-type-Bytes> Bytes
 0	| <unnamed-type-Bits> Bits
	+---

class _WOW64_LDT_ENTRY	size(8):
	+---
 0	| LimitLow
 2	| BaseLow
 4	| <unnamed-type-HighWord> HighWord
	+---

class _WOW64_DESCRIPTOR_TABLE_ENTRY	size(12):
	+---
 0	| Selector
 4	| _WOW64_LDT_ENTRY Descriptor
	+---

class _EXCEPTION_RECORD	size(80):
	+---
 0	| ExceptionCode
 4	| ExceptionFlags
 8	| ExceptionRecord
12	| ExceptionAddress
16	| NumberParameters
20	| ExceptionInformation
	+---

class _EXCEPTION_RECORD32	size(80):
	+---
 0	| ExceptionCode
 4	| ExceptionFlags
 8	| ExceptionRecord
12	| ExceptionAddress
16	| NumberParameters
20	| ExceptionInformation
	+---

class _EXCEPTION_RECORD64	size(152):
	+---
 0	| ExceptionCode
 4	| ExceptionFlags
 8	| ExceptionRecord
16	| ExceptionAddress
24	| NumberParameters
28	| __unusedAlignment
32	| ExceptionInformation
	+---

class _EXCEPTION_POINTERS	size(8):
	+---
 0	| ExceptionRecord
 4	| ContextRecord
	+---

class _GENERIC_MAPPING	size(16):
	+---
 0	| GenericRead
 4	| GenericWrite
 8	| GenericExecute
12	| GenericAll
	+---

class _LUID_AND_ATTRIBUTES	size(12):
	+---
 0	| _LUID Luid
 8	| Attributes
	+---

class _SID_IDENTIFIER_AUTHORITY	size(6):
	+---
 0	| Value
	+---

class _SID	size(12):
	+---
 0	| Revision
 1	| SubAuthorityCount
 2	| _SID_IDENTIFIER_AUTHORITY IdentifierAuthority
 8	| SubAuthority
	+---

class _SE_SID	size(68):
	+---
 0	| _SID Sid
 0	| Buffer
	+---

class _SID_AND_ATTRIBUTES	size(8):
	+---
 0	| Sid
 4	| Attributes
	+---

class _SID_AND_ATTRIBUTES_HASH	size(136):
	+---
 0	| SidCount
 4	| SidAttr
 8	| Hash
	+---

class _ACL	size(8):
	+---
 0	| AclRevision
 1	| Sbz1
 2	| AclSize
 4	| AceCount
 6	| Sbz2
	+---

class _ACE_HEADER	size(4):
	+---
 0	| AceType
 1	| AceFlags
 2	| AceSize
	+---

class _ACCESS_ALLOWED_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _ACCESS_DENIED_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _SYSTEM_AUDIT_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _SYSTEM_ALARM_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _SYSTEM_RESOURCE_ATTRIBUTE_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _SYSTEM_SCOPED_POLICY_ID_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _SYSTEM_MANDATORY_LABEL_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _SYSTEM_PROCESS_TRUST_LABEL_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _ACCESS_ALLOWED_OBJECT_ACE	size(48):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| Flags
12	| _GUID ObjectType
28	| _GUID InheritedObjectType
44	| SidStart
	+---

class _ACCESS_DENIED_OBJECT_ACE	size(48):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| Flags
12	| _GUID ObjectType
28	| _GUID InheritedObjectType
44	| SidStart
	+---

class _SYSTEM_AUDIT_OBJECT_ACE	size(48):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| Flags
12	| _GUID ObjectType
28	| _GUID InheritedObjectType
44	| SidStart
	+---

class _SYSTEM_ALARM_OBJECT_ACE	size(48):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| Flags
12	| _GUID ObjectType
28	| _GUID InheritedObjectType
44	| SidStart
	+---

class _ACCESS_ALLOWED_CALLBACK_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _ACCESS_DENIED_CALLBACK_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _SYSTEM_AUDIT_CALLBACK_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _SYSTEM_ALARM_CALLBACK_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE	size(48):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| Flags
12	| _GUID ObjectType
28	| _GUID InheritedObjectType
44	| SidStart
	+---

class _ACCESS_DENIED_CALLBACK_OBJECT_ACE	size(48):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| Flags
12	| _GUID ObjectType
28	| _GUID InheritedObjectType
44	| SidStart
	+---

class _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE	size(48):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| Flags
12	| _GUID ObjectType
28	| _GUID InheritedObjectType
44	| SidStart
	+---

class _SYSTEM_ALARM_CALLBACK_OBJECT_ACE	size(48):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| Flags
12	| _GUID ObjectType
28	| _GUID InheritedObjectType
44	| SidStart
	+---

class _ACL_REVISION_INFORMATION	size(4):
	+---
 0	| AclRevision
	+---

class _ACL_SIZE_INFORMATION	size(12):
	+---
 0	| AceCount
 4	| AclBytesInUse
 8	| AclBytesFree
	+---

class _SECURITY_DESCRIPTOR_RELATIVE	size(20):
	+---
 0	| Revision
 1	| Sbz1
 2	| Control
 4	| Owner
 8	| Group
12	| Sacl
16	| Dacl
	+---

class _SECURITY_DESCRIPTOR	size(20):
	+---
 0	| Revision
 1	| Sbz1
 2	| Control
 4	| Owner
 8	| Group
12	| Sacl
16	| Dacl
	+---

class _SECURITY_OBJECT_AI_PARAMS	size(8):
	+---
 0	| Size
 4	| ConstraintMask
	+---

class _OBJECT_TYPE_LIST	size(8):
	+---
 0	| Level
 2	| Sbz
 4	| ObjectType
	+---

class _PRIVILEGE_SET	size(20):
	+---
 0	| PrivilegeCount
 4	| Control
 8	| Privilege
	+---

class _ACCESS_REASONS	size(128):
	+---
 0	| Data
	+---

class _SE_SECURITY_DESCRIPTOR	size(12):
	+---
 0	| Size
 4	| Flags
 8	| SecurityDescriptor
	+---

class _SE_ACCESS_REQUEST	size(32):
	+---
 0	| Size
 4	| SeSecurityDescriptor
 8	| DesiredAccess
12	| PreviouslyGrantedAccess
16	| PrincipalSelfSid
20	| GenericMapping
24	| ObjectTypeListCount
28	| ObjectTypeList
	+---

class _SE_ACCESS_REPLY	size(24):
	+---
 0	| Size
 4	| ResultListCount
 8	| GrantedAccess
12	| AccessStatus
16	| AccessReason
20	| Privileges
	+---

class _TOKEN_USER	size(8):
	+---
 0	| _SID_AND_ATTRIBUTES User
	+---

class _SE_TOKEN_USER::<unnamed-tag>	size(8):
	+---
 0	| _TOKEN_USER TokenUser
 0	| _SID_AND_ATTRIBUTES User
	+---

class _SE_TOKEN_USER::<unnamed-tag>	size(68):
	+---
 0	| _SID Sid
 0	| Buffer
	+---

class _SE_TOKEN_USER	size(76):
	+---
 0	| _TOKEN_USER TokenUser
 0	| _SID_AND_ATTRIBUTES User
  	| <unnamed-tag> <alignment member> (size=8)
 8	| _SID Sid
 8	| Buffer
	+---

class _TOKEN_GROUPS	size(12):
	+---
 0	| GroupCount
 4	| Groups
	+---

class _TOKEN_PRIVILEGES	size(16):
	+---
 0	| PrivilegeCount
 4	| Privileges
	+---

class _TOKEN_OWNER	size(4):
	+---
 0	| Owner
	+---

class _TOKEN_PRIMARY_GROUP	size(4):
	+---
 0	| PrimaryGroup
	+---

class _TOKEN_DEFAULT_DACL	size(4):
	+---
 0	| DefaultDacl
	+---

class _TOKEN_USER_CLAIMS	size(4):
	+---
 0	| UserClaims
	+---

class _TOKEN_DEVICE_CLAIMS	size(4):
	+---
 0	| DeviceClaims
	+---

class _TOKEN_GROUPS_AND_PRIVILEGES	size(44):
	+---
 0	| SidCount
 4	| SidLength
 8	| Sids
12	| RestrictedSidCount
16	| RestrictedSidLength
20	| RestrictedSids
24	| PrivilegeCount
28	| PrivilegeLength
32	| Privileges
36	| _LUID AuthenticationId
	+---

class _TOKEN_LINKED_TOKEN	size(4):
	+---
 0	| LinkedToken
	+---

class _TOKEN_ELEVATION	size(4):
	+---
 0	| TokenIsElevated
	+---

class _TOKEN_MANDATORY_LABEL	size(8):
	+---
 0	| _SID_AND_ATTRIBUTES Label
	+---

class _TOKEN_MANDATORY_POLICY	size(4):
	+---
 0	| Policy
	+---

class _TOKEN_ACCESS_INFORMATION	size(56):
	+---
 0	| SidHash
 4	| RestrictedSidHash
 8	| Privileges
12	| _LUID AuthenticationId
20	| _TOKEN_TYPE TokenType
24	| _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel
28	| _TOKEN_MANDATORY_POLICY MandatoryPolicy
32	| Flags
36	| AppContainerNumber
40	| PackageSid
44	| CapabilitiesHash
48	| TrustLevelSid
52	| SecurityAttributes
	+---

class _TOKEN_AUDIT_POLICY	size(30):
	+---
 0	| PerUserPolicy
	+---

class _TOKEN_SOURCE	size(16):
	+---
 0	| SourceName
 8	| _LUID SourceIdentifier
	+---

class _TOKEN_STATISTICS	size(56):
	+---
 0	| _LUID TokenId
 8	| _LUID AuthenticationId
16	| _LARGE_INTEGER ExpirationTime
24	| _TOKEN_TYPE TokenType
28	| _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel
32	| DynamicCharged
36	| DynamicAvailable
40	| GroupCount
44	| PrivilegeCount
48	| _LUID ModifiedId
	+---

class _TOKEN_CONTROL	size(40):
	+---
 0	| _LUID TokenId
 8	| _LUID AuthenticationId
16	| _LUID ModifiedId
24	| _TOKEN_SOURCE TokenSource
	+---

class _TOKEN_ORIGIN	size(8):
	+---
 0	| _LUID OriginatingLogonSession
	+---

class _TOKEN_APPCONTAINER_INFORMATION	size(4):
	+---
 0	| TokenAppContainer
	+---

class _TOKEN_SID_INFORMATION	size(4):
	+---
 0	| Sid
	+---

class _CLAIM_SECURITY_ATTRIBUTE_FQBN_VALUE	size(16):
	+---
 0	| Version
 8	| Name
  	| <alignment member> (size=4)
	+---

class _CLAIM_SECURITY_ATTRIBUTE_OCTET_STRING_VALUE	size(8):
	+---
 0	| pValue
 4	| ValueLength
	+---

class _CLAIM_SECURITY_ATTRIBUTE_V1::<unnamed-tag>	size(4):
	+---
 0	| pInt64
 0	| pUint64
 0	| ppString
 0	| pFqbn
 0	| pOctetString
	+---

class _CLAIM_SECURITY_ATTRIBUTE_V1	size(20):
	+---
 0	| Name
 4	| ValueType
 6	| Reserved
 8	| Flags
12	| ValueCount
16	| <unnamed-type-Values> Values
	+---

class _CLAIM_SECURITY_ATTRIBUTE_RELATIVE_V1::<unnamed-tag>	size(4):
	+---
 0	| pInt64
 0	| pUint64
 0	| ppString
 0	| pFqbn
 0	| pOctetString
	+---

class _CLAIM_SECURITY_ATTRIBUTE_RELATIVE_V1	size(20):
	+---
 0	| Name
 4	| ValueType
 6	| Reserved
 8	| Flags
12	| ValueCount
16	| <unnamed-type-Values> Values
	+---

class _CLAIM_SECURITY_ATTRIBUTES_INFORMATION::<unnamed-tag>	size(4):
	+---
 0	| pAttributeV1
	+---

class _CLAIM_SECURITY_ATTRIBUTES_INFORMATION	size(12):
	+---
 0	| Version
 2	| Reserved
 4	| AttributeCount
 8	| <unnamed-type-Attribute> Attribute
	+---

class _SECURITY_QUALITY_OF_SERVICE	size(12):
	+---
 0	| Length
 4	| _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel
 8	| ContextTrackingMode
 9	| EffectiveOnly
  	| <alignment member> (size=2)
	+---

class _SE_IMPERSONATION_STATE	size(12):
	+---
 0	| Token
 4	| CopyOnOpen
 5	| EffectiveOnly
  	| <alignment member> (size=2)
 8	| _SECURITY_IMPERSONATION_LEVEL Level
	+---

class _SECURITY_CAPABILITIES	size(16):
	+---
 0	| AppContainerSid
 4	| Capabilities
 8	| CapabilityCount
12	| Reserved
	+---

class _JOB_SET_ARRAY	size(12):
	+---
 0	| JobHandle
 4	| MemberLevel
 8	| Flags
	+---

class _EXCEPTION_REGISTRATION_RECORD	size(8):
	+---
 0	| Next
 4	| Handler
	+---

class _NT_TIB::<unnamed-tag>	size(4):
	+---
 0	| FiberData
 0	| Version
	+---

class _NT_TIB	size(28):
	+---
 0	| ExceptionList
 4	| StackBase
 8	| StackLimit
12	| SubSystemTib
  	| <unnamed-tag> <alignment member> (size=16)
16	| FiberData
16	| Version
20	| ArbitraryUserPointer
24	| Self
	+---

class _NT_TIB32::<unnamed-tag>	size(4):
	+---
 0	| FiberData
 0	| Version
	+---

class _NT_TIB32	size(28):
	+---
 0	| ExceptionList
 4	| StackBase
 8	| StackLimit
12	| SubSystemTib
  	| <unnamed-tag> <alignment member> (size=16)
16	| FiberData
16	| Version
20	| ArbitraryUserPointer
24	| Self
	+---

class _NT_TIB64::<unnamed-tag>	size(8):
	+---
 0	| FiberData
 0	| Version
	+---

class _NT_TIB64	size(56):
	+---
 0	| ExceptionList
 8	| StackBase
16	| StackLimit
24	| SubSystemTib
  	| <unnamed-tag> <alignment member> (size=32)
32	| FiberData
32	| Version
40	| ArbitraryUserPointer
48	| Self
	+---

class _UMS_CREATE_THREAD_ATTRIBUTES	size(12):
	+---
 0	| UmsVersion
 4	| UmsContext
 8	| UmsCompletionList
	+---

class _QUOTA_LIMITS	size(32):
	+---
 0	| PagedPoolLimit
 4	| NonPagedPoolLimit
 8	| MinimumWorkingSetSize
12	| MaximumWorkingSetSize
16	| PagefileLimit
  	| <alignment member> (size=4)
24	| _LARGE_INTEGER TimeLimit
	+---

class _RATE_QUOTA_LIMIT::<unnamed-tag>	size(4):
	+---
 0.	| RatePercent (bitstart=0,nbits=7)
 0.	| Reserved0 (bitstart=7,nbits=25)
	+---

class _RATE_QUOTA_LIMIT	size(4):
	+---
 0	| RateData
 0.	| RatePercent (bitstart=0,nbits=7)
 0.	| Reserved0 (bitstart=7,nbits=25)
	+---

class _QUOTA_LIMITS_EX	size(56):
	+---
 0	| PagedPoolLimit
 4	| NonPagedPoolLimit
 8	| MinimumWorkingSetSize
12	| MaximumWorkingSetSize
16	| PagefileLimit
  	| <alignment member> (size=4)
24	| _LARGE_INTEGER TimeLimit
32	| WorkingSetLimit
36	| Reserved2
40	| Reserved3
44	| Reserved4
48	| Flags
52	| _RATE_QUOTA_LIMIT CpuRateLimit
	+---

class _IO_COUNTERS	size(48):
	+---
 0	| ReadOperationCount
 8	| WriteOperationCount
16	| OtherOperationCount
24	| ReadTransferCount
32	| WriteTransferCount
40	| OtherTransferCount
	+---

class _PROCESS_MITIGATION_ASLR_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| EnableBottomUpRandomization (bitstart=0,nbits=1)
 0.	| EnableForceRelocateImages (bitstart=1,nbits=1)
 0.	| EnableHighEntropy (bitstart=2,nbits=1)
 0.	| DisallowStrippedImages (bitstart=3,nbits=1)
 0.	| ReservedFlags (bitstart=4,nbits=28)
	+---

class _PROCESS_MITIGATION_ASLR_POLICY::<unnamed-tag>	size(4):
	+---
 0	| Flags
 0.	| EnableBottomUpRandomization (bitstart=0,nbits=1)
 0.	| EnableForceRelocateImages (bitstart=1,nbits=1)
 0.	| EnableHighEntropy (bitstart=2,nbits=1)
 0.	| DisallowStrippedImages (bitstart=3,nbits=1)
 0.	| ReservedFlags (bitstart=4,nbits=28)
	+---

class _PROCESS_MITIGATION_ASLR_POLICY	size(4):
	+---
 0	| Flags
 0.	| EnableBottomUpRandomization (bitstart=0,nbits=1)
 0.	| EnableForceRelocateImages (bitstart=1,nbits=1)
 0.	| EnableHighEntropy (bitstart=2,nbits=1)
 0.	| DisallowStrippedImages (bitstart=3,nbits=1)
 0.	| ReservedFlags (bitstart=4,nbits=28)
	+---

class _PROCESS_MITIGATION_DEP_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| Enable (bitstart=0,nbits=1)
 0.	| DisableAtlThunkEmulation (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_DEP_POLICY::<unnamed-tag>	size(4):
	+---
 0	| Flags
 0.	| Enable (bitstart=0,nbits=1)
 0.	| DisableAtlThunkEmulation (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_DEP_POLICY	size(8):
	+---
 0	| Flags
 0.	| Enable (bitstart=0,nbits=1)
 0.	| DisableAtlThunkEmulation (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
 4	| Permanent
  	| <alignment member> (size=3)
	+---

class _PROCESS_MITIGATION_STRICT_HANDLE_CHECK_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| RaiseExceptionOnInvalidHandleReference (bitstart=0,nbits=1)
 0.	| HandleExceptionsPermanentlyEnabled (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_STRICT_HANDLE_CHECK_POLICY::<unnamed-tag>	size(4):
	+---
 0	| Flags
 0.	| RaiseExceptionOnInvalidHandleReference (bitstart=0,nbits=1)
 0.	| HandleExceptionsPermanentlyEnabled (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_STRICT_HANDLE_CHECK_POLICY	size(4):
	+---
 0	| Flags
 0.	| RaiseExceptionOnInvalidHandleReference (bitstart=0,nbits=1)
 0.	| HandleExceptionsPermanentlyEnabled (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_SYSTEM_CALL_DISABLE_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| DisallowWin32kSystemCalls (bitstart=0,nbits=1)
 0.	| ReservedFlags (bitstart=1,nbits=31)
	+---

class _PROCESS_MITIGATION_SYSTEM_CALL_DISABLE_POLICY::<unnamed-tag>	size(4):
	+---
 0	| Flags
 0.	| DisallowWin32kSystemCalls (bitstart=0,nbits=1)
 0.	| ReservedFlags (bitstart=1,nbits=31)
	+---

class _PROCESS_MITIGATION_SYSTEM_CALL_DISABLE_POLICY	size(4):
	+---
 0	| Flags
 0.	| DisallowWin32kSystemCalls (bitstart=0,nbits=1)
 0.	| ReservedFlags (bitstart=1,nbits=31)
	+---

class _PROCESS_MITIGATION_EXTENSION_POINT_DISABLE_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| DisableExtensionPoints (bitstart=0,nbits=1)
 0.	| ReservedFlags (bitstart=1,nbits=31)
	+---

class _PROCESS_MITIGATION_EXTENSION_POINT_DISABLE_POLICY::<unnamed-tag>	size(4):
	+---
 0	| Flags
 0.	| DisableExtensionPoints (bitstart=0,nbits=1)
 0.	| ReservedFlags (bitstart=1,nbits=31)
	+---

class _PROCESS_MITIGATION_EXTENSION_POINT_DISABLE_POLICY	size(4):
	+---
 0	| Flags
 0.	| DisableExtensionPoints (bitstart=0,nbits=1)
 0.	| ReservedFlags (bitstart=1,nbits=31)
	+---

class _PROCESS_MITIGATION_DYNAMIC_CODE_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| ProhibitDynamicCode (bitstart=0,nbits=1)
 0.	| ReservedFlags (bitstart=1,nbits=31)
	+---

class _PROCESS_MITIGATION_DYNAMIC_CODE_POLICY::<unnamed-tag>	size(4):
	+---
 0	| Flags
 0.	| ProhibitDynamicCode (bitstart=0,nbits=1)
 0.	| ReservedFlags (bitstart=1,nbits=31)
	+---

class _PROCESS_MITIGATION_DYNAMIC_CODE_POLICY	size(4):
	+---
 0	| Flags
 0.	| ProhibitDynamicCode (bitstart=0,nbits=1)
 0.	| ReservedFlags (bitstart=1,nbits=31)
	+---

class _PROCESS_MITIGATION_CONTROL_FLOW_GUARD_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| EnableControlFlowGuard (bitstart=0,nbits=1)
 0.	| ReservedFlags (bitstart=1,nbits=31)
	+---

class _PROCESS_MITIGATION_CONTROL_FLOW_GUARD_POLICY::<unnamed-tag>	size(4):
	+---
 0	| Flags
 0.	| EnableControlFlowGuard (bitstart=0,nbits=1)
 0.	| ReservedFlags (bitstart=1,nbits=31)
	+---

class _PROCESS_MITIGATION_CONTROL_FLOW_GUARD_POLICY	size(4):
	+---
 0	| Flags
 0.	| EnableControlFlowGuard (bitstart=0,nbits=1)
 0.	| ReservedFlags (bitstart=1,nbits=31)
	+---

class _PROCESS_MITIGATION_BINARY_SIGNATURE_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| MicrosoftSignedOnly (bitstart=0,nbits=1)
 0.	| StoreSignedOnly (bitstart=1,nbits=1)
 0.	| MitigationOptIn (bitstart=2,nbits=1)
 0.	| ReservedFlags (bitstart=3,nbits=29)
	+---

class _PROCESS_MITIGATION_BINARY_SIGNATURE_POLICY::<unnamed-tag>	size(4):
	+---
 0	| Flags
 0.	| MicrosoftSignedOnly (bitstart=0,nbits=1)
 0.	| StoreSignedOnly (bitstart=1,nbits=1)
 0.	| MitigationOptIn (bitstart=2,nbits=1)
 0.	| ReservedFlags (bitstart=3,nbits=29)
	+---

class _PROCESS_MITIGATION_BINARY_SIGNATURE_POLICY	size(4):
	+---
 0	| Flags
 0.	| MicrosoftSignedOnly (bitstart=0,nbits=1)
 0.	| StoreSignedOnly (bitstart=1,nbits=1)
 0.	| MitigationOptIn (bitstart=2,nbits=1)
 0.	| ReservedFlags (bitstart=3,nbits=29)
	+---

class _PROCESS_MITIGATION_FONT_DISABLE_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| DisableNonSystemFonts (bitstart=0,nbits=1)
 0.	| AuditNonSystemFontLoading (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_FONT_DISABLE_POLICY::<unnamed-tag>	size(4):
	+---
 0	| Flags
 0.	| DisableNonSystemFonts (bitstart=0,nbits=1)
 0.	| AuditNonSystemFontLoading (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_FONT_DISABLE_POLICY	size(4):
	+---
 0	| Flags
 0.	| DisableNonSystemFonts (bitstart=0,nbits=1)
 0.	| AuditNonSystemFontLoading (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_IMAGE_LOAD_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| NoRemoteImages (bitstart=0,nbits=1)
 0.	| NoLowMandatoryLabelImages (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_IMAGE_LOAD_POLICY::<unnamed-tag>	size(4):
	+---
 0	| Flags
 0.	| NoRemoteImages (bitstart=0,nbits=1)
 0.	| NoLowMandatoryLabelImages (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_IMAGE_LOAD_POLICY	size(4):
	+---
 0	| Flags
 0.	| NoRemoteImages (bitstart=0,nbits=1)
 0.	| NoLowMandatoryLabelImages (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _JOBOBJECT_BASIC_ACCOUNTING_INFORMATION	size(48):
	+---
 0	| _LARGE_INTEGER TotalUserTime
 8	| _LARGE_INTEGER TotalKernelTime
16	| _LARGE_INTEGER ThisPeriodTotalUserTime
24	| _LARGE_INTEGER ThisPeriodTotalKernelTime
32	| TotalPageFaultCount
36	| TotalProcesses
40	| ActiveProcesses
44	| TotalTerminatedProcesses
	+---

class _JOBOBJECT_BASIC_LIMIT_INFORMATION	size(48):
	+---
 0	| _LARGE_INTEGER PerProcessUserTimeLimit
 8	| _LARGE_INTEGER PerJobUserTimeLimit
16	| LimitFlags
20	| MinimumWorkingSetSize
24	| MaximumWorkingSetSize
28	| ActiveProcessLimit
32	| Affinity
36	| PriorityClass
40	| SchedulingClass
  	| <alignment member> (size=4)
	+---

class _JOBOBJECT_EXTENDED_LIMIT_INFORMATION	size(112):
	+---
 0	| _JOBOBJECT_BASIC_LIMIT_INFORMATION BasicLimitInformation
48	| _IO_COUNTERS IoInfo
96	| ProcessMemoryLimit
100	| JobMemoryLimit
104	| PeakProcessMemoryUsed
108	| PeakJobMemoryUsed
	+---

class _JOBOBJECT_BASIC_PROCESS_ID_LIST	size(12):
	+---
 0	| NumberOfAssignedProcesses
 4	| NumberOfProcessIdsInList
 8	| ProcessIdList
	+---

class _JOBOBJECT_BASIC_UI_RESTRICTIONS	size(4):
	+---
 0	| UIRestrictionsClass
	+---

class _JOBOBJECT_SECURITY_LIMIT_INFORMATION	size(20):
	+---
 0	| SecurityLimitFlags
 4	| JobToken
 8	| SidsToDisable
12	| PrivilegesToDelete
16	| RestrictedSids
	+---

class _JOBOBJECT_END_OF_JOB_TIME_INFORMATION	size(4):
	+---
 0	| EndOfJobTimeAction
	+---

class _JOBOBJECT_ASSOCIATE_COMPLETION_PORT	size(8):
	+---
 0	| CompletionKey
 4	| CompletionPort
	+---

class _JOBOBJECT_BASIC_AND_IO_ACCOUNTING_INFORMATION	size(96):
	+---
 0	| _JOBOBJECT_BASIC_ACCOUNTING_INFORMATION BasicInfo
48	| _IO_COUNTERS IoInfo
	+---

class _JOBOBJECT_JOBSET_INFORMATION	size(4):
	+---
 0	| MemberLevel
	+---

class _JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION	size(48):
	+---
 0	| IoReadBytesLimit
 8	| IoWriteBytesLimit
16	| _LARGE_INTEGER PerJobUserTimeLimit
24	| JobMemoryLimit
32	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
36	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL RateControlToleranceInterval
40	| LimitFlags
  	| <alignment member> (size=4)
	+---

class JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION_2::<unnamed-tag>	size(8):
	+---
 0	| JobHighMemoryLimit
 0	| JobMemoryLimit
	+---

class JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION_2::<unnamed-tag>	size(4):
	+---
 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlTolerance
	+---

class JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION_2::<unnamed-tag>	size(4):
	+---
 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL RateControlToleranceInterval
 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL CpuRateControlToleranceInterval
	+---

class JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION_2	size(72):
	+---
 0	| IoReadBytesLimit
 8	| IoWriteBytesLimit
16	| _LARGE_INTEGER PerJobUserTimeLimit
  	| <unnamed-tag> <alignment member> (size=24)
24	| JobHighMemoryLimit
24	| JobMemoryLimit
  	| <unnamed-tag> <alignment member> (size=32)
32	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
32	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlTolerance
  	| <unnamed-tag> <alignment member> (size=36)
36	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL RateControlToleranceInterval
36	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL CpuRateControlToleranceInterval
40	| LimitFlags
44	| _JOBOBJECT_RATE_CONTROL_TOLERANCE IoRateControlTolerance
48	| JobLowMemoryLimit
56	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL IoRateControlToleranceInterval
60	| _JOBOBJECT_RATE_CONTROL_TOLERANCE NetRateControlTolerance
64	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL NetRateControlToleranceInterval
  	| <alignment member> (size=4)
	+---

class _JOBOBJECT_LIMIT_VIOLATION_INFORMATION	size(80):
	+---
 0	| LimitFlags
 4	| ViolationLimitFlags
 8	| IoReadBytes
16	| IoReadBytesLimit
24	| IoWriteBytes
32	| IoWriteBytesLimit
40	| _LARGE_INTEGER PerJobUserTime
48	| _LARGE_INTEGER PerJobUserTimeLimit
56	| JobMemory
64	| JobMemoryLimit
72	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
76	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlToleranceLimit
	+---

class JOBOBJECT_LIMIT_VIOLATION_INFORMATION_2::<unnamed-tag>	size(8):
	+---
 0	| JobHighMemoryLimit
 0	| JobMemoryLimit
	+---

class JOBOBJECT_LIMIT_VIOLATION_INFORMATION_2::<unnamed-tag>	size(4):
	+---
 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlTolerance
	+---

class JOBOBJECT_LIMIT_VIOLATION_INFORMATION_2::<unnamed-tag>	size(4):
	+---
 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlToleranceLimit
 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlToleranceLimit
	+---

class JOBOBJECT_LIMIT_VIOLATION_INFORMATION_2	size(104):
	+---
 0	| LimitFlags
 4	| ViolationLimitFlags
 8	| IoReadBytes
16	| IoReadBytesLimit
24	| IoWriteBytes
32	| IoWriteBytesLimit
40	| _LARGE_INTEGER PerJobUserTime
48	| _LARGE_INTEGER PerJobUserTimeLimit
56	| JobMemory
  	| <unnamed-tag> <alignment member> (size=64)
64	| JobHighMemoryLimit
64	| JobMemoryLimit
  	| <unnamed-tag> <alignment member> (size=72)
72	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
72	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlTolerance
  	| <unnamed-tag> <alignment member> (size=76)
76	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlToleranceLimit
76	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlToleranceLimit
80	| JobLowMemoryLimit
88	| _JOBOBJECT_RATE_CONTROL_TOLERANCE IoRateControlTolerance
92	| _JOBOBJECT_RATE_CONTROL_TOLERANCE IoRateControlToleranceLimit
96	| _JOBOBJECT_RATE_CONTROL_TOLERANCE NetRateControlTolerance
100	| _JOBOBJECT_RATE_CONTROL_TOLERANCE NetRateControlToleranceLimit
	+---

class _JOBOBJECT_CPU_RATE_CONTROL_INFORMATION::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0	| MinRate
 2	| MaxRate
	+---

class _JOBOBJECT_CPU_RATE_CONTROL_INFORMATION::<unnamed-tag>	size(4):
	+---
 0	| CpuRate
 0	| Weight
 0	| MinRate
 2	| MaxRate
	+---

class _JOBOBJECT_CPU_RATE_CONTROL_INFORMATION	size(8):
	+---
 0	| ControlFlags
  	| <unnamed-tag> <alignment member> (size=4)
 4	| CpuRate
 4	| Weight
  	| <unnamed-tag> <alignment member> (size=4)
 4	| MinRate
 6	| MaxRate
  	| <unnamed-tag> <alignment member> (size=4)
	+---

class _ENUM_FLAG_SIZED_INTEGER<enum JOB_OBJECT_NET_RATE_CONTROL_FLAGS>	size(1):
	+---
	+---

class JOBOBJECT_NET_RATE_CONTROL_INFORMATION	size(16):
	+---
 0	| MaxBandwidth
 8	| JOB_OBJECT_NET_RATE_CONTROL_FLAGS ControlFlags
12	| DscpTag
  	| <alignment member> (size=3)
	+---

class _ENUM_FLAG_SIZED_INTEGER<enum JOB_OBJECT_IO_RATE_CONTROL_FLAGS>	size(1):
	+---
	+---

class JOBOBJECT_IO_RATE_CONTROL_INFORMATION_NATIVE	size(40):
	+---
 0	| MaxIops
 8	| MaxBandwidth
16	| ReservationIops
24	| VolumeName
28	| BaseIoSize
32	| JOB_OBJECT_IO_RATE_CONTROL_FLAGS ControlFlags
36	| VolumeNameLength
  	| <alignment member> (size=2)
	+---

class _SILOOBJECT_BASIC_INFORMATION	size(44):
	+---
 0	| _GUID SiloIdNumber
16	| _GUID SiloParentIdNumber
32	| NumberOfProcesses
36	| NumberOfChildSilos
40	| IsInServerSilo
  	| <alignment member> (size=3)
	+---

class _SILOOBJECT_ROOT_DIRECTORY	size(4):
	+---
 0	| DirectoryHandle
	+---

class _SERVERSILO_BASIC_INFORMATION	size(12):
	+---
 0	| ServiceSessionId
 4	| _SERVERSILO_STATE State
 8	| ExitStatus
	+---

class _CACHE_DESCRIPTOR	size(12):
	+---
 0	| Level
 1	| Associativity
 2	| LineSize
 4	| Size
 8	| _PROCESSOR_CACHE_TYPE Type
	+---

class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION::<unnamed-tag>::<unnamed-tag>	size(1):
	+---
 0	| Flags
	+---

class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0	| NodeNumber
	+---

class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION::<unnamed-tag>	size(16):
	+---
 0	| <unnamed-type-ProcessorCore> ProcessorCore
  	| <alignment member> (size=3)
 0	| <unnamed-type-NumaNode> NumaNode
 0	| _CACHE_DESCRIPTOR Cache
  	| <alignment member> (size=4)
 0	| Reserved
	+---

class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION	size(24):
	+---
 0	| ProcessorMask
 4	| _LOGICAL_PROCESSOR_RELATIONSHIP Relationship
  	| <unnamed-tag> <alignment member> (size=8)
 8	| <unnamed-type-ProcessorCore> ProcessorCore
  	| <alignment member> (size=3)
 8	| <unnamed-type-NumaNode> NumaNode
 8	| _CACHE_DESCRIPTOR Cache
  	| <alignment member> (size=4)
 8	| Reserved
	+---

class _PROCESSOR_RELATIONSHIP	size(36):
	+---
 0	| Flags
 1	| EfficiencyClass
 2	| Reserved
22	| GroupCount
24	| GroupMask
	+---

class _NUMA_NODE_RELATIONSHIP	size(36):
	+---
 0	| NodeNumber
 4	| Reserved
24	| _GROUP_AFFINITY GroupMask
	+---

class _CACHE_RELATIONSHIP	size(44):
	+---
 0	| Level
 1	| Associativity
 2	| LineSize
 4	| CacheSize
 8	| _PROCESSOR_CACHE_TYPE Type
12	| Reserved
32	| _GROUP_AFFINITY GroupMask
	+---

class _PROCESSOR_GROUP_INFO	size(44):
	+---
 0	| MaximumProcessorCount
 1	| ActiveProcessorCount
 2	| Reserved
40	| ActiveProcessorMask
	+---

class _GROUP_RELATIONSHIP	size(68):
	+---
 0	| MaximumGroupCount
 2	| ActiveGroupCount
 4	| Reserved
24	| GroupInfo
	+---

class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX::<unnamed-tag>	size(68):
	+---
 0	| _PROCESSOR_RELATIONSHIP Processor
 0	| _NUMA_NODE_RELATIONSHIP NumaNode
 0	| _CACHE_RELATIONSHIP Cache
 0	| _GROUP_RELATIONSHIP Group
	+---

class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX	size(76):
	+---
 0	| _LOGICAL_PROCESSOR_RELATIONSHIP Relationship
 4	| Size
  	| <unnamed-tag> <alignment member> (size=8)
 8	| _PROCESSOR_RELATIONSHIP Processor
 8	| _NUMA_NODE_RELATIONSHIP NumaNode
 8	| _CACHE_RELATIONSHIP Cache
 8	| _GROUP_RELATIONSHIP Group
	+---

class _SYSTEM_CPU_SET_INFORMATION::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(1):
	+---
 0.	| Parked (bitstart=0,nbits=1)
 0.	| Allocated (bitstart=1,nbits=1)
 0.	| AllocatedToTargetProcess (bitstart=2,nbits=1)
 0.	| RealTime (bitstart=3,nbits=1)
 0.	| ReservedFlags (bitstart=4,nbits=4)
	+---

class _SYSTEM_CPU_SET_INFORMATION::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(1):
	+---
 0	| AllFlags
 0.	| Parked (bitstart=0,nbits=1)
 0.	| Allocated (bitstart=1,nbits=1)
 0.	| AllocatedToTargetProcess (bitstart=2,nbits=1)
 0.	| RealTime (bitstart=3,nbits=1)
 0.	| ReservedFlags (bitstart=4,nbits=4)
	+---

class _SYSTEM_CPU_SET_INFORMATION::<unnamed-tag>::<unnamed-tag>	size(24):
	+---
 0	| Id
 4	| Group
 6	| LogicalProcessorIndex
 7	| CoreIndex
 8	| LastLevelCacheIndex
 9	| NumaNodeIndex
10	| EfficiencyClass
  	| <unnamed-tag> <alignment member> (size=11)
11	| AllFlags
  	| <unnamed-tag> <alignment member> (size=11)
11.	| Parked (bitstart=0,nbits=1)
11.	| Allocated (bitstart=1,nbits=1)
11.	| AllocatedToTargetProcess (bitstart=2,nbits=1)
11.	| RealTime (bitstart=3,nbits=1)
11.	| ReservedFlags (bitstart=4,nbits=4)
  	| <unnamed-tag> <alignment member> (size=11)
12	| Reserved
16	| AllocationTag
	+---

class _SYSTEM_CPU_SET_INFORMATION::<unnamed-tag>	size(24):
	+---
 0	| <unnamed-type-CpuSet> CpuSet
	+---

class _SYSTEM_CPU_SET_INFORMATION	size(32):
	+---
 0	| Size
 4	| _CPU_SET_INFORMATION_TYPE Type
  	| <unnamed-tag> <alignment member> (size=8)
 8	| <unnamed-type-CpuSet> CpuSet
	+---

class _SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION	size(8):
	+---
 0	| CycleTime
	+---

class _XSTATE_FEATURE	size(8):
	+---
 0	| Offset
 4	| Size
	+---

class _XSTATE_CONFIGURATION	size(816):
	+---
 0	| EnabledFeatures
 8	| EnabledVolatileFeatures
16	| Size
20.	| OptimizedSave (bitstart=0,nbits=1)
20.	| CompactionEnabled (bitstart=1,nbits=1)
24	| Features
536	| EnabledSupervisorFeatures
544	| AlignedFeatures
552	| AllFeatureSize
556	| AllFeatures
  	| <alignment member> (size=4)
	+---

class _MEMORY_BASIC_INFORMATION	size(28):
	+---
 0	| BaseAddress
 4	| AllocationBase
 8	| AllocationProtect
12	| RegionSize
16	| State
20	| Protect
24	| Type
	+---

class _MEMORY_BASIC_INFORMATION32	size(28):
	+---
 0	| BaseAddress
 4	| AllocationBase
 8	| AllocationProtect
12	| RegionSize
16	| State
20	| Protect
24	| Type
	+---

class _MEMORY_BASIC_INFORMATION64	size(48):
	+---
 0	| BaseAddress
 8	| AllocationBase
16	| AllocationProtect
20	| __alignment1
24	| RegionSize
32	| State
36	| Protect
40	| Type
44	| __alignment2
	+---

class _CFG_CALL_TARGET_INFO	size(8):
	+---
 0	| Offset
 4	| Flags
	+---

class _ENCLAVE_CREATE_INFO_SGX	size(4096):
	+---
 0	| Secs
	+---

class _ENCLAVE_INIT_INFO_SGX	size(4096):
	+---
 0	| SigStruct
1808	| Reserved1
2048	| EInitToken
2352	| Reserved2
	+---

class _FILE_ID_128	size(16):
	+---
 0	| Identifier
	+---

class _FILE_NOTIFY_INFORMATION	size(16):
	+---
 0	| NextEntryOffset
 4	| Action
 8	| FileNameLength
12	| FileName
  	| <alignment member> (size=2)
	+---

class _FILE_SEGMENT_ELEMENT	size(8):
	+---
 0	| Buffer
 0	| Alignment
	+---

class _REPARSE_GUID_DATA_BUFFER::<unnamed-tag>	size(1):
	+---
 0	| DataBuffer
	+---

class _REPARSE_GUID_DATA_BUFFER	size(28):
	+---
 0	| ReparseTag
 4	| ReparseDataLength
 6	| Reserved
 8	| _GUID ReparseGuid
24	| <unnamed-type-GenericReparseBuffer> GenericReparseBuffer
  	| <alignment member> (size=3)
	+---

class _SCRUB_DATA_INPUT	size(896):
	+---
 0	| Size
 4	| Flags
 8	| MaximumIos
12	| Reserved
80	| ResumeContext
	+---

class _SCRUB_PARITY_EXTENT	size(16):
	+---
 0	| Offset
 8	| Length
	+---

class _SCRUB_PARITY_EXTENT_DATA	size(24):
	+---
 0	| Size
 2	| Flags
 4	| NumberOfParityExtents
 6	| MaximumNumberOfParityExtents
 8	| ParityExtents
	+---

class _SCRUB_DATA_OUTPUT	size(896):
	+---
 0	| Size
 4	| Flags
 8	| Status
  	| <alignment member> (size=4)
16	| ErrorFileOffset
24	| ErrorLength
32	| NumberOfBytesRepaired
40	| NumberOfBytesFailed
48	| InternalFileReference
56	| ResumeContextLength
58	| ParityExtentDataOffset
60	| Reserved
80	| ResumeContext
	+---

class _SHARED_VIRTUAL_DISK_SUPPORT	size(8):
	+---
 0	| _SharedVirtualDiskSupportType SharedVirtualDiskSupport
 4	| _SharedVirtualDiskHandleState HandleState
	+---

class _NETWORK_APP_INSTANCE_EA	size(20):
	+---
 0	| _GUID AppInstanceID
16	| CsvFlags
	+---

class CM_Power_Data_s	size(56):
	+---
 0	| PD_Size
 4	| _DEVICE_POWER_STATE PD_MostRecentPowerState
 8	| PD_Capabilities
12	| PD_D1Latency
16	| PD_D2Latency
20	| PD_D3Latency
24	| PD_PowerStateMapping
52	| _SYSTEM_POWER_STATE PD_DeepestSystemWake
	+---

class _POWER_USER_PRESENCE	size(4):
	+---
 0	| POWER_USER_PRESENCE_TYPE UserPresence
	+---

class _POWER_SESSION_CONNECT	size(2):
	+---
 0	| Connected
 1	| Console
	+---

class _POWER_SESSION_TIMEOUTS	size(8):
	+---
 0	| InputTimeout
 4	| DisplayTimeout
	+---

class _POWER_SESSION_RIT_STATE	size(8):
	+---
 0	| Active
  	| <alignment member> (size=3)
 4	| LastInputTime
	+---

class _POWER_SESSION_WINLOGON	size(8):
	+---
 0	| SessionId
 4	| Console
 5	| Locked
  	| <alignment member> (size=2)
	+---

class _POWER_IDLE_RESILIENCY	size(8):
	+---
 0	| CoalescingTimeout
 4	| IdleResiliencyPeriod
	+---

class _POWER_MONITOR_INVOCATION	size(8):
	+---
 0	| On
 1	| Console
  	| <alignment member> (size=2)
 4	| POWER_MONITOR_REQUEST_REASON RequestReason
	+---

class _RESUME_PERFORMANCE	size(24):
	+---
 0	| PostTimeMs
  	| <alignment member> (size=4)
 8	| TotalResumeTimeMs
16	| ResumeCompleteTimestamp
	+---

class <unnamed-tag>	size(32):
	+---
 0	| Version
 4	| _GUID Guid
20	| SYSTEM_POWER_CONDITION PowerCondition
24	| DataLength
28	| Data
  	| <alignment member> (size=3)
	+---

class <unnamed-tag>	size(16):
	+---
 0	| _GUID Guid
	+---

class _APPLICATIONLAUNCH_SETTING_VALUE	size(16):
	+---
 0	| _LARGE_INTEGER ActivationTime
 8	| Flags
12	| ButtonInstanceID
	+---

class _POWER_PLATFORM_INFORMATION	size(1):
	+---
 0	| AoAc
	+---

class <unnamed-tag>	size(8):
	+---
 0	| Granularity
 4	| Capacity
	+---

class <unnamed-tag>	size(12):
	+---
 0	| Frequency
 4	| Flags
 8	| PercentFrequency
	+---

class <unnamed-tag>	size(32):
	+---
 0	| Latency
 4	| Power
 8	| TimeCheck
12	| PromotePercent
13	| DemotePercent
14	| StateType
15	| Reserved
16	| StateFlags
20	| Context
24	| IdleHandler
28	| Reserved1
	+---

class <unnamed-tag>	size(56):
	+---
 0	| Type
 4	| Count
 8	| TargetState
12	| OldState
16	| TargetProcessors
24	| State
	+---

class <unnamed-tag>	size(52):
	+---
 0	| Type
 4	| Count
 8	| TargetState
12	| OldState
16	| TargetProcessors
20	| State
	+---

class <unnamed-tag>	size(64):
	+---
 0	| Frequency
 4	| Power
 8	| PercentFrequency
 9	| IncreaseLevel
10	| DecreaseLevel
11	| Type
12	| IncreaseTime
16	| DecreaseTime
  	| <alignment member> (size=4)
24	| Control
32	| Status
40	| HitCount
44	| Reserved1
48	| Reserved2
56	| Reserved3
	+---

class <unnamed-tag>	size(144):
	+---
 0	| Count
 4	| MaxFrequency
 8	| CurrentState
12	| MaxPerfState
16	| MinPerfState
20	| LowestPerfState
24	| ThermalConstraint
28	| BusyAdjThreshold
29	| PolicyType
30	| Type
31	| Reserved
32	| TimerInterval
  	| <alignment member> (size=4)
40	| TargetProcessors
48	| PStateHandler
52	| PStateContext
56	| TStateHandler
60	| TStateContext
64	| FeedbackHandler
68	| Reserved1
72	| Reserved2
80	| State
	+---

class <unnamed-tag>	size(136):
	+---
 0	| Count
 4	| MaxFrequency
 8	| CurrentState
12	| MaxPerfState
16	| MinPerfState
20	| LowestPerfState
24	| ThermalConstraint
28	| BusyAdjThreshold
29	| PolicyType
30	| Type
31	| Reserved
32	| TimerInterval
36	| TargetProcessors
40	| PStateHandler
44	| PStateContext
48	| TStateHandler
52	| TStateContext
56	| FeedbackHandler
60	| Reserved1
64	| Reserved2
72	| State
	+---

class <unnamed-tag>	size(48):
	+---
 0	| IdleTransitions
 4	| FailedTransitions
 8	| InvalidBucketIndex
  	| <alignment member> (size=4)
16	| TotalTime
24	| IdleTimeBuckets
	+---

class <unnamed-tag>	size(72):
	+---
 0	| StateCount
 4	| TotalTransitions
 8	| ResetCount
  	| <alignment member> (size=4)
16	| StartTime
24	| State
	+---

class <unnamed-tag>	size(24):
	+---
 0	| TotalTimeUs
 8	| MinTimeUs
12	| MaxTimeUs
16	| Count
  	| <alignment member> (size=4)
	+---

class <unnamed-tag>	size(416):
	+---
 0	| TotalTime
 8	| IdleTransitions
12	| FailedTransitions
16	| InvalidBucketIndex
20	| MinTimeUs
24	| MaxTimeUs
28	| CancelledTransitions
32	| IdleTimeBuckets
	+---

class <unnamed-tag>	size(440):
	+---
 0	| StateCount
 4	| TotalTransitions
 8	| ResetCount
12	| AbortCount
16	| StartTime
24	| State
	+---

class <unnamed-tag>	size(20):
	+---
 0	| State
 4	| Status
 8	| Latency
12	| Speed
16	| Processor
	+---

class <unnamed-tag>	size(24):
	+---
 0	| State
 4	| Latency
 8	| Speed
  	| <alignment member> (size=4)
16	| Processors
	+---

class <unnamed-tag>	size(16):
	+---
 0	| NewState
 4	| OldState
 8	| Processors
	+---

class <unnamed-tag>	size(16):
	+---
 0	| ThermalConstraint
  	| <alignment member> (size=4)
 8	| Processors
	+---

class <unnamed-tag>	size(16):
	+---
 0	| Mode
  	| <alignment member> (size=7)
 8	| Processors
	+---

class <unnamed-tag>	size(12):
	+---
 0	| POWER_ACTION Action
 4	| Flags
 8	| EventCode
	+---

class <unnamed-tag>	size(24):
	+---
 0	| Enable
 1	| Spare
 4	| BatteryLevel
 8	| POWER_ACTION_POLICY PowerPolicy
20	| _SYSTEM_POWER_STATE MinSystemState
	+---

class _SYSTEM_POWER_POLICY	size(232):
	+---
 0	| Revision
 4	| POWER_ACTION_POLICY PowerButton
16	| POWER_ACTION_POLICY SleepButton
28	| POWER_ACTION_POLICY LidClose
40	| _SYSTEM_POWER_STATE LidOpenWake
44	| Reserved
48	| POWER_ACTION_POLICY Idle
60	| IdleTimeout
64	| IdleSensitivity
65	| DynamicThrottle
66	| Spare2
68	| _SYSTEM_POWER_STATE MinSleep
72	| _SYSTEM_POWER_STATE MaxSleep
76	| _SYSTEM_POWER_STATE ReducedLatencySleep
80	| WinLogonFlags
84	| Spare3
88	| DozeS4Timeout
92	| BroadcastCapacityResolution
96	| DischargePolicy
192	| VideoTimeout
196	| VideoDimDisplay
  	| <alignment member> (size=3)
200	| VideoReserved
212	| SpindownTimeout
216	| OptimizeForPower
217	| FanThrottleTolerance
218	| ForcedThrottle
219	| MinThrottle
220	| POWER_ACTION_POLICY OverThrottled
	+---

class <unnamed-tag>	size(8):
	+---
 0	| TimeCheck
 4	| DemotePercent
 5	| PromotePercent
 6	| Spare
	+---

class <unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(2):
	+---
 0.	| AllowScaling (bitstart=0,nbits=1)
 0.	| Disabled (bitstart=1,nbits=1)
 0.	| Reserved (bitstart=2,nbits=14)
	+---

class <unnamed-tag>::<unnamed-tag>	size(2):
	+---
 0	| AsWORD
 0.	| AllowScaling (bitstart=0,nbits=1)
 0.	| Disabled (bitstart=1,nbits=1)
 0.	| Reserved (bitstart=2,nbits=14)
	+---

class <unnamed-tag>	size(32):
	+---
 0	| Revision
 2	| <unnamed-type-Flags> Flags
 4	| PolicyCount
 8	| Policy
	+---

class _PROCESSOR_POWER_POLICY_INFO	size(20):
	+---
 0	| TimeCheck
 4	| DemoteLimit
 8	| PromoteLimit
12	| DemotePercent
13	| PromotePercent
14	| Spare
16.	| AllowDemotion (bitstart=0,nbits=1)
16.	| AllowPromotion (bitstart=1,nbits=1)
16.	| Reserved (bitstart=2,nbits=30)
	+---

class _PROCESSOR_POWER_POLICY	size(76):
	+---
 0	| Revision
 4	| DynamicThrottle
 5	| Spare
 8.	| DisableCStates (bitstart=0,nbits=1)
 8.	| Reserved (bitstart=1,nbits=31)
12	| PolicyCount
16	| Policy
	+---

class <unnamed-tag>::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(1):
	+---
 0.	| NoDomainAccounting (bitstart=0,nbits=1)
 0.	| IncreasePolicy (bitstart=1,nbits=2)
 0.	| DecreasePolicy (bitstart=3,nbits=2)
 0.	| Reserved (bitstart=5,nbits=3)
	+---

class <unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(1):
	+---
 0	| AsBYTE
 0.	| NoDomainAccounting (bitstart=0,nbits=1)
 0.	| IncreasePolicy (bitstart=1,nbits=2)
 0.	| DecreasePolicy (bitstart=3,nbits=2)
 0.	| Reserved (bitstart=5,nbits=3)
	+---

class <unnamed-tag>::<unnamed-tag>	size(1):
	+---
 0	| Spare
 0	| <unnamed-type-Flags> Flags
	+---

class <unnamed-tag>	size(28):
	+---
 0	| Revision
 4	| MaxThrottle
 5	| MinThrottle
 6	| BusyAdjThreshold
  	| <unnamed-tag> <alignment member> (size=7)
 7	| Spare
 7	| <unnamed-type-Flags> Flags
 8	| TimeCheck
12	| IncreaseTime
16	| DecreaseTime
20	| IncreasePercent
24	| DecreasePercent
	+---

class _ADMINISTRATOR_POWER_POLICY	size(24):
	+---
 0	| _SYSTEM_POWER_STATE MinSleep
 4	| _SYSTEM_POWER_STATE MaxSleep
 8	| MinVideoTimeout
12	| MaxVideoTimeout
16	| MinSpindownTimeout
20	| MaxSpindownTimeout
	+---

class _HIBERFILE_BUCKET	size(24):
	+---
 0	| MaxPhysicalMemory
 8	| PhysicalMemoryPercent
  	| <alignment member> (size=4)
	+---

class <unnamed-tag>	size(76):
	+---
 0	| PowerButtonPresent
 1	| SleepButtonPresent
 2	| LidPresent
 3	| SystemS1
 4	| SystemS2
 5	| SystemS3
 6	| SystemS4
 7	| SystemS5
 8	| HiberFilePresent
 9	| FullWake
10	| VideoDimPresent
11	| ApmPresent
12	| UpsPresent
13	| ThermalControl
14	| ProcessorThrottle
15	| ProcessorMinThrottle
16	| ProcessorMaxThrottle
17	| FastSystemS4
18	| Hiberboot
19	| WakeAlarmPresent
20	| AoAc
21	| DiskSpinDown
22	| HiberFileType
23	| AoAcConnectivitySupported
24	| spare3
30	| SystemBatteriesPresent
31	| BatteriesAreShortTerm
32	| BatteryScale
56	| _SYSTEM_POWER_STATE AcOnLineWake
60	| _SYSTEM_POWER_STATE SoftLidWake
64	| _SYSTEM_POWER_STATE RtcWake
68	| _SYSTEM_POWER_STATE MinDeviceWakeState
72	| _SYSTEM_POWER_STATE DefaultLowLatencyWake
	+---

class <unnamed-tag>	size(32):
	+---
 0	| AcOnLine
 1	| BatteryPresent
 2	| Charging
 3	| Discharging
 4	| Spare1
 7	| Tag
 8	| MaxCapacity
12	| RemainingCapacity
16	| Rate
20	| EstimatedTime
24	| DefaultAlert1
28	| DefaultAlert2
	+---

class _IMAGE_DOS_HEADER	size(64):
	+---
 0	| e_magic
 2	| e_cblp
 4	| e_cp
 6	| e_crlc
 8	| e_cparhdr
10	| e_minalloc
12	| e_maxalloc
14	| e_ss
16	| e_sp
18	| e_csum
20	| e_ip
22	| e_cs
24	| e_lfarlc
26	| e_ovno
28	| e_res
36	| e_oemid
38	| e_oeminfo
40	| e_res2
60	| e_lfanew
	+---

class _IMAGE_OS2_HEADER	size(64):
	+---
 0	| ne_magic
 2	| ne_ver
 3	| ne_rev
 4	| ne_enttab
 6	| ne_cbenttab
 8	| ne_crc
12	| ne_flags
14	| ne_autodata
16	| ne_heap
18	| ne_stack
20	| ne_csip
24	| ne_sssp
28	| ne_cseg
30	| ne_cmod
32	| ne_cbnrestab
34	| ne_segtab
36	| ne_rsrctab
38	| ne_restab
40	| ne_modtab
42	| ne_imptab
44	| ne_nrestab
48	| ne_cmovent
50	| ne_align
52	| ne_cres
54	| ne_exetyp
55	| ne_flagsothers
56	| ne_pretthunks
58	| ne_psegrefbytes
60	| ne_swaparea
62	| ne_expver
	+---

class _IMAGE_VXD_HEADER	size(196):
	+---
 0	| e32_magic
 2	| e32_border
 3	| e32_worder
 4	| e32_level
 8	| e32_cpu
10	| e32_os
12	| e32_ver
16	| e32_mflags
20	| e32_mpages
24	| e32_startobj
28	| e32_eip
32	| e32_stackobj
36	| e32_esp
40	| e32_pagesize
44	| e32_lastpagesize
48	| e32_fixupsize
52	| e32_fixupsum
56	| e32_ldrsize
60	| e32_ldrsum
64	| e32_objtab
68	| e32_objcnt
72	| e32_objmap
76	| e32_itermap
80	| e32_rsrctab
84	| e32_rsrccnt
88	| e32_restab
92	| e32_enttab
96	| e32_dirtab
100	| e32_dircnt
104	| e32_fpagetab
108	| e32_frectab
112	| e32_impmod
116	| e32_impmodcnt
120	| e32_impproc
124	| e32_pagesum
128	| e32_datapage
132	| e32_preload
136	| e32_nrestab
140	| e32_cbnrestab
144	| e32_nressum
148	| e32_autodata
152	| e32_debuginfo
156	| e32_debuglen
160	| e32_instpreload
164	| e32_instdemand
168	| e32_heapsize
172	| e32_res3
184	| e32_winresoff
188	| e32_winreslen
192	| e32_devid
194	| e32_ddkver
	+---

class _IMAGE_FILE_HEADER	size(20):
	+---
 0	| Machine
 2	| NumberOfSections
 4	| TimeDateStamp
 8	| PointerToSymbolTable
12	| NumberOfSymbols
16	| SizeOfOptionalHeader
18	| Characteristics
	+---

class _IMAGE_DATA_DIRECTORY	size(8):
	+---
 0	| VirtualAddress
 4	| Size
	+---

class _IMAGE_OPTIONAL_HEADER	size(224):
	+---
 0	| Magic
 2	| MajorLinkerVersion
 3	| MinorLinkerVersion
 4	| SizeOfCode
 8	| SizeOfInitializedData
12	| SizeOfUninitializedData
16	| AddressOfEntryPoint
20	| BaseOfCode
24	| BaseOfData
28	| ImageBase
32	| SectionAlignment
36	| FileAlignment
40	| MajorOperatingSystemVersion
42	| MinorOperatingSystemVersion
44	| MajorImageVersion
46	| MinorImageVersion
48	| MajorSubsystemVersion
50	| MinorSubsystemVersion
52	| Win32VersionValue
56	| SizeOfImage
60	| SizeOfHeaders
64	| CheckSum
68	| Subsystem
70	| DllCharacteristics
72	| SizeOfStackReserve
76	| SizeOfStackCommit
80	| SizeOfHeapReserve
84	| SizeOfHeapCommit
88	| LoaderFlags
92	| NumberOfRvaAndSizes
96	| DataDirectory
	+---

class _IMAGE_ROM_OPTIONAL_HEADER	size(56):
	+---
 0	| Magic
 2	| MajorLinkerVersion
 3	| MinorLinkerVersion
 4	| SizeOfCode
 8	| SizeOfInitializedData
12	| SizeOfUninitializedData
16	| AddressOfEntryPoint
20	| BaseOfCode
24	| BaseOfData
28	| BaseOfBss
32	| GprMask
36	| CprMask
52	| GpValue
	+---

class _IMAGE_OPTIONAL_HEADER64	size(240):
	+---
 0	| Magic
 2	| MajorLinkerVersion
 3	| MinorLinkerVersion
 4	| SizeOfCode
 8	| SizeOfInitializedData
12	| SizeOfUninitializedData
16	| AddressOfEntryPoint
20	| BaseOfCode
24	| ImageBase
32	| SectionAlignment
36	| FileAlignment
40	| MajorOperatingSystemVersion
42	| MinorOperatingSystemVersion
44	| MajorImageVersion
46	| MinorImageVersion
48	| MajorSubsystemVersion
50	| MinorSubsystemVersion
52	| Win32VersionValue
56	| SizeOfImage
60	| SizeOfHeaders
64	| CheckSum
68	| Subsystem
70	| DllCharacteristics
72	| SizeOfStackReserve
80	| SizeOfStackCommit
88	| SizeOfHeapReserve
96	| SizeOfHeapCommit
104	| LoaderFlags
108	| NumberOfRvaAndSizes
112	| DataDirectory
	+---

class _IMAGE_NT_HEADERS64	size(264):
	+---
 0	| Signature
 4	| _IMAGE_FILE_HEADER FileHeader
24	| _IMAGE_OPTIONAL_HEADER64 OptionalHeader
	+---

class _IMAGE_NT_HEADERS	size(248):
	+---
 0	| Signature
 4	| _IMAGE_FILE_HEADER FileHeader
24	| _IMAGE_OPTIONAL_HEADER OptionalHeader
	+---

class _IMAGE_ROM_HEADERS	size(76):
	+---
 0	| _IMAGE_FILE_HEADER FileHeader
20	| _IMAGE_ROM_OPTIONAL_HEADER OptionalHeader
	+---

class ANON_OBJECT_HEADER	size(32):
	+---
 0	| Sig1
 2	| Sig2
 4	| Version
 6	| Machine
 8	| TimeDateStamp
12	| _GUID ClassID
28	| SizeOfData
	+---

class ANON_OBJECT_HEADER_V2	size(44):
	+---
 0	| Sig1
 2	| Sig2
 4	| Version
 6	| Machine
 8	| TimeDateStamp
12	| _GUID ClassID
28	| SizeOfData
32	| Flags
36	| MetaDataSize
40	| MetaDataOffset
	+---

class ANON_OBJECT_HEADER_BIGOBJ	size(56):
	+---
 0	| Sig1
 2	| Sig2
 4	| Version
 6	| Machine
 8	| TimeDateStamp
12	| _GUID ClassID
28	| SizeOfData
32	| Flags
36	| MetaDataSize
40	| MetaDataOffset
44	| NumberOfSections
48	| PointerToSymbolTable
52	| NumberOfSymbols
	+---

class _IMAGE_SECTION_HEADER::<unnamed-tag>	size(4):
	+---
 0	| PhysicalAddress
 0	| VirtualSize
	+---

class _IMAGE_SECTION_HEADER	size(40):
	+---
 0	| Name
 8	| <unnamed-type-Misc> Misc
12	| VirtualAddress
16	| SizeOfRawData
20	| PointerToRawData
24	| PointerToRelocations
28	| PointerToLinenumbers
32	| NumberOfRelocations
34	| NumberOfLinenumbers
36	| Characteristics
	+---

class _IMAGE_SYMBOL::<unnamed-tag>::<unnamed-tag>	size(8):
	+---
 0	| Short
 4	| Long
	+---

class _IMAGE_SYMBOL::<unnamed-tag>	size(8):
	+---
 0	| ShortName
 0	| <unnamed-type-Name> Name
 0	| LongName
	+---

class _IMAGE_SYMBOL	size(18):
	+---
 0	| <unnamed-type-N> N
 8	| Value
12	| SectionNumber
14	| Type
16	| StorageClass
17	| NumberOfAuxSymbols
	+---

class _IMAGE_SYMBOL_EX::<unnamed-tag>::<unnamed-tag>	size(8):
	+---
 0	| Short
 4	| Long
	+---

class _IMAGE_SYMBOL_EX::<unnamed-tag>	size(8):
	+---
 0	| ShortName
 0	| <unnamed-type-Name> Name
 0	| LongName
	+---

class _IMAGE_SYMBOL_EX	size(20):
	+---
 0	| <unnamed-type-N> N
 8	| Value
12	| SectionNumber
16	| Type
18	| StorageClass
19	| NumberOfAuxSymbols
	+---

class IMAGE_AUX_SYMBOL_TOKEN_DEF	size(18):
	+---
 0	| bAuxType
 1	| bReserved
 2	| SymbolTableIndex
 6	| rgbReserved
	+---

class _IMAGE_AUX_SYMBOL::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0	| Linenumber
 2	| Size
	+---

class _IMAGE_AUX_SYMBOL::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0	| <unnamed-type-LnSz> LnSz
 0	| TotalSize
	+---

class _IMAGE_AUX_SYMBOL::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(8):
	+---
 0	| PointerToLinenumber
 4	| PointerToNextFunction
	+---

class _IMAGE_AUX_SYMBOL::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(8):
	+---
 0	| Dimension
	+---

class _IMAGE_AUX_SYMBOL::<unnamed-tag>::<unnamed-tag>	size(8):
	+---
 0	| <unnamed-type-Function> Function
 0	| <unnamed-type-Array> Array
	+---

class _IMAGE_AUX_SYMBOL::<unnamed-tag>	size(18):
	+---
 0	| TagIndex
 4	| <unnamed-type-Misc> Misc
 8	| <unnamed-type-FcnAry> FcnAry
16	| TvIndex
	+---

class _IMAGE_AUX_SYMBOL::<unnamed-tag>	size(18):
	+---
 0	| Name
	+---

class _IMAGE_AUX_SYMBOL::<unnamed-tag>	size(18):
	+---
 0	| Length
 4	| NumberOfRelocations
 6	| NumberOfLinenumbers
 8	| CheckSum
12	| Number
14	| Selection
15	| bReserved
16	| HighNumber
	+---

class _IMAGE_AUX_SYMBOL::<unnamed-tag>	size(18):
	+---
 0	| crc
 4	| rgbReserved
	+---

class _IMAGE_AUX_SYMBOL	size(18):
	+---
 0	| <unnamed-type-Sym> Sym
 0	| <unnamed-type-File> File
 0	| <unnamed-type-Section> Section
 0	| IMAGE_AUX_SYMBOL_TOKEN_DEF TokenDef
 0	| <unnamed-type-CRC> CRC
	+---

class _IMAGE_AUX_SYMBOL_EX::<unnamed-tag>	size(20):
	+---
 0	| WeakDefaultSymIndex
 4	| WeakSearchType
 8	| rgbReserved
	+---

class _IMAGE_AUX_SYMBOL_EX::<unnamed-tag>	size(20):
	+---
 0	| Name
	+---

class _IMAGE_AUX_SYMBOL_EX::<unnamed-tag>	size(20):
	+---
 0	| Length
 4	| NumberOfRelocations
 6	| NumberOfLinenumbers
 8	| CheckSum
12	| Number
14	| Selection
15	| bReserved
16	| HighNumber
18	| rgbReserved
	+---

class _IMAGE_AUX_SYMBOL_EX::<unnamed-tag>	size(20):
	+---
 0	| IMAGE_AUX_SYMBOL_TOKEN_DEF TokenDef
18	| rgbReserved
	+---

class _IMAGE_AUX_SYMBOL_EX::<unnamed-tag>	size(20):
	+---
 0	| crc
 4	| rgbReserved
	+---

class _IMAGE_AUX_SYMBOL_EX	size(20):
	+---
 0	| <unnamed-type-Sym> Sym
 0	| <unnamed-type-File> File
 0	| <unnamed-type-Section> Section
 0	| IMAGE_AUX_SYMBOL_TOKEN_DEF TokenDef
18	| rgbReserved
 0	| <unnamed-type-CRC> CRC
	+---

class _IMAGE_RELOCATION::<unnamed-tag>	size(4):
	+---
 0	| VirtualAddress
 0	| RelocCount
	+---

class _IMAGE_RELOCATION	size(10):
	+---
 0	| VirtualAddress
 0	| RelocCount
 4	| SymbolTableIndex
 8	| Type
	+---

class _IMAGE_LINENUMBER::<unnamed-tag>	size(4):
	+---
 0	| SymbolTableIndex
 0	| VirtualAddress
	+---

class _IMAGE_LINENUMBER	size(6):
	+---
 0	| <unnamed-type-Type> Type
 4	| Linenumber
	+---

class _IMAGE_BASE_RELOCATION	size(8):
	+---
 0	| VirtualAddress
 4	| SizeOfBlock
	+---

class _IMAGE_ARCHIVE_MEMBER_HEADER	size(60):
	+---
 0	| Name
16	| Date
28	| UserID
34	| GroupID
40	| Mode
48	| Size
58	| EndHeader
	+---

class _IMAGE_EXPORT_DIRECTORY	size(40):
	+---
 0	| Characteristics
 4	| TimeDateStamp
 8	| MajorVersion
10	| MinorVersion
12	| Name
16	| Base
20	| NumberOfFunctions
24	| NumberOfNames
28	| AddressOfFunctions
32	| AddressOfNames
36	| AddressOfNameOrdinals
	+---

class _IMAGE_IMPORT_BY_NAME	size(4):
	+---
 0	| Hint
 2	| Name
  	| <alignment member> (size=1)
	+---

class _IMAGE_THUNK_DATA64::<unnamed-tag>	size(8):
	+---
 0	| ForwarderString
 0	| Function
 0	| Ordinal
 0	| AddressOfData
	+---

class _IMAGE_THUNK_DATA64	size(8):
	+---
 0	| <unnamed-type-u1> u1
	+---

class _IMAGE_THUNK_DATA32::<unnamed-tag>	size(4):
	+---
 0	| ForwarderString
 0	| Function
 0	| Ordinal
 0	| AddressOfData
	+---

class _IMAGE_THUNK_DATA32	size(4):
	+---
 0	| <unnamed-type-u1> u1
	+---

class _IMAGE_TLS_DIRECTORY64::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| Reserved0 (bitstart=0,nbits=20)
 0.	| Alignment (bitstart=20,nbits=4)
 0.	| Reserved1 (bitstart=24,nbits=8)
	+---

class _IMAGE_TLS_DIRECTORY64::<unnamed-tag>	size(4):
	+---
 0	| Characteristics
 0.	| Reserved0 (bitstart=0,nbits=20)
 0.	| Alignment (bitstart=20,nbits=4)
 0.	| Reserved1 (bitstart=24,nbits=8)
	+---

class _IMAGE_TLS_DIRECTORY64	size(40):
	+---
 0	| StartAddressOfRawData
 8	| EndAddressOfRawData
16	| AddressOfIndex
24	| AddressOfCallBacks
32	| SizeOfZeroFill
  	| <unnamed-tag> <alignment member> (size=36)
36	| Characteristics
  	| <unnamed-tag> <alignment member> (size=36)
36.	| Reserved0 (bitstart=0,nbits=20)
36.	| Alignment (bitstart=20,nbits=4)
36.	| Reserved1 (bitstart=24,nbits=8)
  	| <unnamed-tag> <alignment member> (size=36)
	+---

class _IMAGE_TLS_DIRECTORY32::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| Reserved0 (bitstart=0,nbits=20)
 0.	| Alignment (bitstart=20,nbits=4)
 0.	| Reserved1 (bitstart=24,nbits=8)
	+---

class _IMAGE_TLS_DIRECTORY32::<unnamed-tag>	size(4):
	+---
 0	| Characteristics
 0.	| Reserved0 (bitstart=0,nbits=20)
 0.	| Alignment (bitstart=20,nbits=4)
 0.	| Reserved1 (bitstart=24,nbits=8)
	+---

class _IMAGE_TLS_DIRECTORY32	size(24):
	+---
 0	| StartAddressOfRawData
 4	| EndAddressOfRawData
 8	| AddressOfIndex
12	| AddressOfCallBacks
16	| SizeOfZeroFill
  	| <unnamed-tag> <alignment member> (size=20)
20	| Characteristics
  	| <unnamed-tag> <alignment member> (size=20)
20.	| Reserved0 (bitstart=0,nbits=20)
20.	| Alignment (bitstart=20,nbits=4)
20.	| Reserved1 (bitstart=24,nbits=8)
  	| <unnamed-tag> <alignment member> (size=20)
	+---

class _IMAGE_IMPORT_DESCRIPTOR::<unnamed-tag>	size(4):
	+---
 0	| Characteristics
 0	| OriginalFirstThunk
	+---

class _IMAGE_IMPORT_DESCRIPTOR	size(20):
	+---
 0	| Characteristics
 0	| OriginalFirstThunk
 4	| TimeDateStamp
 8	| ForwarderChain
12	| Name
16	| FirstThunk
	+---

class _IMAGE_BOUND_IMPORT_DESCRIPTOR	size(8):
	+---
 0	| TimeDateStamp
 4	| OffsetModuleName
 6	| NumberOfModuleForwarderRefs
	+---

class _IMAGE_BOUND_FORWARDER_REF	size(8):
	+---
 0	| TimeDateStamp
 4	| OffsetModuleName
 6	| Reserved
	+---

class _IMAGE_DELAYLOAD_DESCRIPTOR::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| RvaBased (bitstart=0,nbits=1)
 0.	| ReservedAttributes (bitstart=1,nbits=31)
	+---

class _IMAGE_DELAYLOAD_DESCRIPTOR::<unnamed-tag>	size(4):
	+---
 0	| AllAttributes
 0.	| RvaBased (bitstart=0,nbits=1)
 0.	| ReservedAttributes (bitstart=1,nbits=31)
	+---

class _IMAGE_DELAYLOAD_DESCRIPTOR	size(32):
	+---
 0	| <unnamed-type-Attributes> Attributes
 4	| DllNameRVA
 8	| ModuleHandleRVA
12	| ImportAddressTableRVA
16	| ImportNameTableRVA
20	| BoundImportAddressTableRVA
24	| UnloadInformationTableRVA
28	| TimeDateStamp
	+---

class _IMAGE_RESOURCE_DIRECTORY	size(16):
	+---
 0	| Characteristics
 4	| TimeDateStamp
 8	| MajorVersion
10	| MinorVersion
12	| NumberOfNamedEntries
14	| NumberOfIdEntries
	+---

class _IMAGE_RESOURCE_DIRECTORY_ENTRY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| NameOffset (bitstart=0,nbits=31)
 0.	| NameIsString (bitstart=31,nbits=1)
	+---

class _IMAGE_RESOURCE_DIRECTORY_ENTRY::<unnamed-tag>	size(4):
	+---
 0.	| NameOffset (bitstart=0,nbits=31)
 0.	| NameIsString (bitstart=31,nbits=1)
 0	| Name
 0	| Id
	+---

class _IMAGE_RESOURCE_DIRECTORY_ENTRY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| OffsetToDirectory (bitstart=0,nbits=31)
 0.	| DataIsDirectory (bitstart=31,nbits=1)
	+---

class _IMAGE_RESOURCE_DIRECTORY_ENTRY::<unnamed-tag>	size(4):
	+---
 0	| OffsetToData
 0.	| OffsetToDirectory (bitstart=0,nbits=31)
 0.	| DataIsDirectory (bitstart=31,nbits=1)
	+---

class _IMAGE_RESOURCE_DIRECTORY_ENTRY	size(8):
	+---
 0.	| NameOffset (bitstart=0,nbits=31)
 0.	| NameIsString (bitstart=31,nbits=1)
 0	| Name
 0	| Id
  	| <unnamed-tag> <alignment member> (size=4)
 4	| OffsetToData
  	| <unnamed-tag> <alignment member> (size=4)
 4.	| OffsetToDirectory (bitstart=0,nbits=31)
 4.	| DataIsDirectory (bitstart=31,nbits=1)
  	| <unnamed-tag> <alignment member> (size=4)
	+---

class _IMAGE_RESOURCE_DIRECTORY_STRING	size(4):
	+---
 0	| Length
 2	| NameString
  	| <alignment member> (size=1)
	+---

class _IMAGE_RESOURCE_DIR_STRING_U	size(4):
	+---
 0	| Length
 2	| NameString
	+---

class _IMAGE_RESOURCE_DATA_ENTRY	size(16):
	+---
 0	| OffsetToData
 4	| Size
 8	| CodePage
12	| Reserved
	+---

class _IMAGE_LOAD_CONFIG_CODE_INTEGRITY	size(12):
	+---
 0	| Flags
 2	| Catalog
 4	| CatalogOffset
 8	| Reserved
	+---

class _IMAGE_LOAD_CONFIG_DIRECTORY32	size(104):
	+---
 0	| Size
 4	| TimeDateStamp
 8	| MajorVersion
10	| MinorVersion
12	| GlobalFlagsClear
16	| GlobalFlagsSet
20	| CriticalSectionDefaultTimeout
24	| DeCommitFreeBlockThreshold
28	| DeCommitTotalFreeThreshold
32	| LockPrefixTable
36	| MaximumAllocationSize
40	| VirtualMemoryThreshold
44	| ProcessHeapFlags
48	| ProcessAffinityMask
52	| CSDVersion
54	| Reserved1
56	| EditList
60	| SecurityCookie
64	| SEHandlerTable
68	| SEHandlerCount
72	| GuardCFCheckFunctionPointer
76	| GuardCFDispatchFunctionPointer
80	| GuardCFFunctionTable
84	| GuardCFFunctionCount
88	| GuardFlags
92	| _IMAGE_LOAD_CONFIG_CODE_INTEGRITY CodeIntegrity
	+---

class _IMAGE_LOAD_CONFIG_DIRECTORY64	size(160):
	+---
 0	| Size
 4	| TimeDateStamp
 8	| MajorVersion
10	| MinorVersion
12	| GlobalFlagsClear
16	| GlobalFlagsSet
20	| CriticalSectionDefaultTimeout
24	| DeCommitFreeBlockThreshold
32	| DeCommitTotalFreeThreshold
40	| LockPrefixTable
48	| MaximumAllocationSize
56	| VirtualMemoryThreshold
64	| ProcessAffinityMask
72	| ProcessHeapFlags
76	| CSDVersion
78	| Reserved1
80	| EditList
88	| SecurityCookie
96	| SEHandlerTable
104	| SEHandlerCount
112	| GuardCFCheckFunctionPointer
120	| GuardCFDispatchFunctionPointer
128	| GuardCFFunctionTable
136	| GuardCFFunctionCount
144	| GuardFlags
148	| _IMAGE_LOAD_CONFIG_CODE_INTEGRITY CodeIntegrity
	+---

class _IMAGE_CE_RUNTIME_FUNCTION_ENTRY	size(8):
	+---
 0	| FuncStart
 4.	| PrologLen (bitstart=0,nbits=8)
 4.	| FuncLen (bitstart=8,nbits=22)
 4.	| ThirtyTwoBit (bitstart=30,nbits=1)
 4.	| ExceptionFlag (bitstart=31,nbits=1)
	+---

class _IMAGE_ARM_RUNTIME_FUNCTION_ENTRY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| Flag (bitstart=0,nbits=2)
 0.	| FunctionLength (bitstart=2,nbits=11)
 0.	| Ret (bitstart=13,nbits=2)
 0.	| H (bitstart=15,nbits=1)
 0.	| Reg (bitstart=16,nbits=3)
 0.	| R (bitstart=19,nbits=1)
 0.	| L (bitstart=20,nbits=1)
 0.	| C (bitstart=21,nbits=1)
 0.	| StackAdjust (bitstart=22,nbits=10)
	+---

class _IMAGE_ARM_RUNTIME_FUNCTION_ENTRY::<unnamed-tag>	size(4):
	+---
 0	| UnwindData
 0.	| Flag (bitstart=0,nbits=2)
 0.	| FunctionLength (bitstart=2,nbits=11)
 0.	| Ret (bitstart=13,nbits=2)
 0.	| H (bitstart=15,nbits=1)
 0.	| Reg (bitstart=16,nbits=3)
 0.	| R (bitstart=19,nbits=1)
 0.	| L (bitstart=20,nbits=1)
 0.	| C (bitstart=21,nbits=1)
 0.	| StackAdjust (bitstart=22,nbits=10)
	+---

class _IMAGE_ARM_RUNTIME_FUNCTION_ENTRY	size(8):
	+---
 0	| BeginAddress
  	| <unnamed-tag> <alignment member> (size=4)
 4	| UnwindData
  	| <unnamed-tag> <alignment member> (size=4)
 4.	| Flag (bitstart=0,nbits=2)
 4.	| FunctionLength (bitstart=2,nbits=11)
 4.	| Ret (bitstart=13,nbits=2)
 4.	| H (bitstart=15,nbits=1)
 4.	| Reg (bitstart=16,nbits=3)
 4.	| R (bitstart=19,nbits=1)
 4.	| L (bitstart=20,nbits=1)
 4.	| C (bitstart=21,nbits=1)
 4.	| StackAdjust (bitstart=22,nbits=10)
  	| <unnamed-tag> <alignment member> (size=4)
	+---

class _IMAGE_ARM64_RUNTIME_FUNCTION_ENTRY::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| Flag (bitstart=0,nbits=2)
 0.	| FunctionLength (bitstart=2,nbits=11)
 0.	| RegF (bitstart=13,nbits=3)
 0.	| RegI (bitstart=16,nbits=4)
 0.	| H (bitstart=20,nbits=1)
 0.	| CR (bitstart=21,nbits=2)
 0.	| FrameSize (bitstart=23,nbits=9)
	+---

class _IMAGE_ARM64_RUNTIME_FUNCTION_ENTRY::<unnamed-tag>	size(4):
	+---
 0	| UnwindData
 0.	| Flag (bitstart=0,nbits=2)
 0.	| FunctionLength (bitstart=2,nbits=11)
 0.	| RegF (bitstart=13,nbits=3)
 0.	| RegI (bitstart=16,nbits=4)
 0.	| H (bitstart=20,nbits=1)
 0.	| CR (bitstart=21,nbits=2)
 0.	| FrameSize (bitstart=23,nbits=9)
	+---

class _IMAGE_ARM64_RUNTIME_FUNCTION_ENTRY	size(8):
	+---
 0	| BeginAddress
  	| <unnamed-tag> <alignment member> (size=4)
 4	| UnwindData
  	| <unnamed-tag> <alignment member> (size=4)
 4.	| Flag (bitstart=0,nbits=2)
 4.	| FunctionLength (bitstart=2,nbits=11)
 4.	| RegF (bitstart=13,nbits=3)
 4.	| RegI (bitstart=16,nbits=4)
 4.	| H (bitstart=20,nbits=1)
 4.	| CR (bitstart=21,nbits=2)
 4.	| FrameSize (bitstart=23,nbits=9)
  	| <unnamed-tag> <alignment member> (size=4)
	+---

class _IMAGE_ALPHA64_RUNTIME_FUNCTION_ENTRY	size(40):
	+---
 0	| BeginAddress
 8	| EndAddress
16	| ExceptionHandler
24	| HandlerData
32	| PrologEndAddress
	+---

class _IMAGE_ALPHA_RUNTIME_FUNCTION_ENTRY	size(20):
	+---
 0	| BeginAddress
 4	| EndAddress
 8	| ExceptionHandler
12	| HandlerData
16	| PrologEndAddress
	+---

class _IMAGE_RUNTIME_FUNCTION_ENTRY::<unnamed-tag>	size(4):
	+---
 0	| UnwindInfoAddress
 0	| UnwindData
	+---

class _IMAGE_RUNTIME_FUNCTION_ENTRY	size(12):
	+---
 0	| BeginAddress
 4	| EndAddress
  	| <unnamed-tag> <alignment member> (size=8)
 8	| UnwindInfoAddress
 8	| UnwindData
	+---

class _IMAGE_DEBUG_DIRECTORY	size(28):
	+---
 0	| Characteristics
 4	| TimeDateStamp
 8	| MajorVersion
10	| MinorVersion
12	| Type
16	| SizeOfData
20	| AddressOfRawData
24	| PointerToRawData
	+---

class _IMAGE_COFF_SYMBOLS_HEADER	size(32):
	+---
 0	| NumberOfSymbols
 4	| LvaToFirstSymbol
 8	| NumberOfLinenumbers
12	| LvaToFirstLinenumber
16	| RvaToFirstByteOfCode
20	| RvaToLastByteOfCode
24	| RvaToFirstByteOfData
28	| RvaToLastByteOfData
	+---

class _FPO_DATA	size(16):
	+---
 0	| ulOffStart
 4	| cbProcSize
 8	| cdwLocals
12	| cdwParams
14.	| cbProlog (bitstart=0,nbits=8)
14.	| cbRegs (bitstart=8,nbits=3)
14.	| fHasSEH (bitstart=11,nbits=1)
14.	| fUseBP (bitstart=12,nbits=1)
14.	| reserved (bitstart=13,nbits=1)
14.	| cbFrame (bitstart=14,nbits=2)
	+---

class _IMAGE_DEBUG_MISC	size(16):
	+---
 0	| DataType
 4	| Length
 8	| Unicode
 9	| Reserved
12	| Data
  	| <alignment member> (size=3)
	+---

class _IMAGE_FUNCTION_ENTRY	size(12):
	+---
 0	| StartingAddress
 4	| EndingAddress
 8	| EndOfPrologue
	+---

class _IMAGE_FUNCTION_ENTRY64::<unnamed-tag>	size(8):
	+---
 0	| EndOfPrologue
 0	| UnwindInfoAddress
	+---

class _IMAGE_FUNCTION_ENTRY64	size(24):
	+---
 0	| StartingAddress
 8	| EndingAddress
  	| <unnamed-tag> <alignment member> (size=16)
16	| EndOfPrologue
16	| UnwindInfoAddress
	+---

class _IMAGE_SEPARATE_DEBUG_HEADER	size(48):
	+---
 0	| Signature
 2	| Flags
 4	| Machine
 6	| Characteristics
 8	| TimeDateStamp
12	| CheckSum
16	| ImageBase
20	| SizeOfImage
24	| NumberOfSections
28	| ExportedNamesSize
32	| DebugDirectorySize
36	| SectionAlignment
40	| Reserved
	+---

class _NON_PAGED_DEBUG_INFO	size(32):
	+---
 0	| Signature
 2	| Flags
 4	| Size
 8	| Machine
10	| Characteristics
12	| TimeDateStamp
16	| CheckSum
20	| SizeOfImage
24	| ImageBase
	+---

class _ImageArchitectureHeader	size(8):
	+---
 0.	| AmaskValue (bitstart=0,nbits=1)
 0.	| AmaskShift (bitstart=8,nbits=8)
 4	| FirstEntryRVA
	+---

class _ImageArchitectureEntry	size(8):
	+---
 0	| FixupInstRVA
 4	| NewInst
	+---

class IMPORT_OBJECT_HEADER::<unnamed-tag>	size(2):
	+---
 0	| Ordinal
 0	| Hint
	+---

class IMPORT_OBJECT_HEADER	size(20):
	+---
 0	| Sig1
 2	| Sig2
 4	| Version
 6	| Machine
 8	| TimeDateStamp
12	| SizeOfData
  	| <unnamed-tag> <alignment member> (size=16)
16	| Ordinal
16	| Hint
18.	| Type (bitstart=0,nbits=2)
18.	| NameType (bitstart=2,nbits=3)
18.	| Reserved (bitstart=5,nbits=11)
	+---

class IMAGE_COR20_HEADER::<unnamed-tag>	size(4):
	+---
 0	| EntryPointToken
 0	| EntryPointRVA
	+---

class IMAGE_COR20_HEADER	size(72):
	+---
 0	| cb
 4	| MajorRuntimeVersion
 6	| MinorRuntimeVersion
 8	| _IMAGE_DATA_DIRECTORY MetaData
16	| Flags
  	| <unnamed-tag> <alignment member> (size=20)
20	| EntryPointToken
20	| EntryPointRVA
24	| _IMAGE_DATA_DIRECTORY Resources
32	| _IMAGE_DATA_DIRECTORY StrongNameSignature
40	| _IMAGE_DATA_DIRECTORY CodeManagerTable
48	| _IMAGE_DATA_DIRECTORY VTableFixups
56	| _IMAGE_DATA_DIRECTORY ExportAddressTableJumps
64	| _IMAGE_DATA_DIRECTORY ManagedNativeHeader
	+---

class _SLIST_HEADER::<unnamed-tag>	size(8):
	+---
 0	| _SINGLE_LIST_ENTRY Next
 4	| Depth
 6	| CpuId
	+---

class _SLIST_HEADER	size(8):
	+---
 0	| Alignment
 0	| _SINGLE_LIST_ENTRY Next
 4	| Depth
 6	| CpuId
	+---

class _RTL_RUN_ONCE	size(4):
	+---
 0	| Ptr
	+---

class _RTL_BARRIER	size(24):
	+---
 0	| Reserved1
 4	| Reserved2
 8	| Reserved3
16	| Reserved4
20	| Reserved5
	+---

class _MESSAGE_RESOURCE_ENTRY	size(6):
	+---
 0	| Length
 2	| Flags
 4	| Text
  	| <alignment member> (size=1)
	+---

class _MESSAGE_RESOURCE_BLOCK	size(12):
	+---
 0	| LowId
 4	| HighId
 8	| OffsetToEntries
	+---

class _MESSAGE_RESOURCE_DATA	size(16):
	+---
 0	| NumberOfBlocks
 4	| Blocks
	+---

class _OSVERSIONINFOA	size(148):
	+---
 0	| dwOSVersionInfoSize
 4	| dwMajorVersion
 8	| dwMinorVersion
12	| dwBuildNumber
16	| dwPlatformId
20	| szCSDVersion
	+---

class _OSVERSIONINFOW	size(276):
	+---
 0	| dwOSVersionInfoSize
 4	| dwMajorVersion
 8	| dwMinorVersion
12	| dwBuildNumber
16	| dwPlatformId
20	| szCSDVersion
	+---

class _OSVERSIONINFOEXA	size(156):
	+---
 0	| dwOSVersionInfoSize
 4	| dwMajorVersion
 8	| dwMinorVersion
12	| dwBuildNumber
16	| dwPlatformId
20	| szCSDVersion
148	| wServicePackMajor
150	| wServicePackMinor
152	| wSuiteMask
154	| wProductType
155	| wReserved
	+---

class _OSVERSIONINFOEXW	size(284):
	+---
 0	| dwOSVersionInfoSize
 4	| dwMajorVersion
 8	| dwMinorVersion
12	| dwBuildNumber
16	| dwPlatformId
20	| szCSDVersion
276	| wServicePackMajor
278	| wServicePackMinor
280	| wSuiteMask
282	| wProductType
283	| wReserved
	+---

class _RTL_CRITICAL_SECTION_DEBUG	size(32):
	+---
 0	| Type
 2	| CreatorBackTraceIndex
 4	| CriticalSection
 8	| _LIST_ENTRY ProcessLocksList
16	| EntryCount
20	| ContentionCount
24	| Flags
28	| CreatorBackTraceIndexHigh
30	| SpareWORD
	+---

class _RTL_CRITICAL_SECTION	size(24):
	+---
 0	| DebugInfo
 4	| LockCount
 8	| RecursionCount
12	| OwningThread
16	| LockSemaphore
20	| SpinCount
	+---

class _RTL_SRWLOCK	size(4):
	+---
 0	| Ptr
	+---

class _RTL_CONDITION_VARIABLE	size(4):
	+---
 0	| Ptr
	+---

class _HEAP_OPTIMIZE_RESOURCES_INFORMATION	size(8):
	+---
 0	| Version
 4	| Flags
	+---

class _ACTIVATION_CONTEXT_QUERY_INDEX	size(8):
	+---
 0	| ulAssemblyIndex
 4	| ulFileIndexInAssembly
	+---

class _ASSEMBLY_FILE_DETAILED_INFORMATION	size(20):
	+---
 0	| ulFlags
 4	| ulFilenameLength
 8	| ulPathLength
12	| lpFileName
16	| lpFilePath
	+---

class _ACTIVATION_CONTEXT_ASSEMBLY_DETAILED_INFORMATION	size(88):
	+---
 0	| ulFlags
 4	| ulEncodedAssemblyIdentityLength
 8	| ulManifestPathType
12	| ulManifestPathLength
16	| _LARGE_INTEGER liManifestLastWriteTime
24	| ulPolicyPathType
28	| ulPolicyPathLength
32	| _LARGE_INTEGER liPolicyLastWriteTime
40	| ulMetadataSatelliteRosterIndex
44	| ulManifestVersionMajor
48	| ulManifestVersionMinor
52	| ulPolicyVersionMajor
56	| ulPolicyVersionMinor
60	| ulAssemblyDirectoryNameLength
64	| lpAssemblyEncodedAssemblyIdentity
68	| lpAssemblyManifestPath
72	| lpAssemblyPolicyPath
76	| lpAssemblyDirectoryName
80	| ulFileCount
  	| <alignment member> (size=4)
	+---

class _ACTIVATION_CONTEXT_RUN_LEVEL_INFORMATION	size(12):
	+---
 0	| ulFlags
 4	| ACTCTX_REQUESTED_RUN_LEVEL RunLevel
 8	| UiAccess
	+---

class _COMPATIBILITY_CONTEXT_ELEMENT	size(20):
	+---
 0	| _GUID Id
16	| ACTCTX_COMPATIBILITY_ELEMENT_TYPE Type
	+---

class _ACTIVATION_CONTEXT_COMPATIBILITY_INFORMATION	size(4):
	+---
 0	| ElementCount
 4	| Elements
	+---

class _SUPPORTED_OS_INFO	size(4):
	+---
 0	| MajorVersion
 2	| MinorVersion
	+---

class _ACTIVATION_CONTEXT_DETAILED_INFORMATION	size(48):
	+---
 0	| dwFlags
 4	| ulFormatVersion
 8	| ulAssemblyCount
12	| ulRootManifestPathType
16	| ulRootManifestPathChars
20	| ulRootConfigurationPathType
24	| ulRootConfigurationPathChars
28	| ulAppDirPathType
32	| ulAppDirPathChars
36	| lpRootManifestPath
40	| lpRootConfigurationPath
44	| lpAppDirPath
	+---

class _HARDWARE_COUNTER_DATA	size(16):
	+---
 0	| _HARDWARE_COUNTER_TYPE Type
 4	| Reserved
 8	| Value
	+---

class _PERFORMANCE_DATA	size(288):
	+---
 0	| Size
 2	| Version
 3	| HwCountersCount
 4	| ContextSwitchCount
 8	| WaitReasonBitMap
16	| CycleTime
24	| RetryCount
28	| Reserved
32	| HwCounters
	+---

class _EVENTLOGRECORD	size(56):
	+---
 0	| Length
 4	| Reserved
 8	| RecordNumber
12	| TimeGenerated
16	| TimeWritten
20	| EventID
24	| EventType
26	| NumStrings
28	| EventCategory
30	| ReservedFlags
32	| ClosingRecordNumber
36	| StringOffset
40	| UserSidLength
44	| UserSidOffset
48	| DataLength
52	| DataOffset
	+---

class _EVENTSFORLOGFILE	size(520):
	+---
 0	| ulSize
 4	| szLogicalLogFile
516	| ulNumRecords
520	| pEventLogRecords
	+---

class _PACKEDEVENTINFO	size(8):
	+---
 0	| ulSize
 4	| ulNumEventsForLogFile
 8	| ulOffsets
	+---

class _TAPE_ERASE	size(8):
	+---
 0	| Type
 4	| Immediate
  	| <alignment member> (size=3)
	+---

class _TAPE_PREPARE	size(8):
	+---
 0	| Operation
 4	| Immediate
  	| <alignment member> (size=3)
	+---

class _TAPE_WRITE_MARKS	size(12):
	+---
 0	| Type
 4	| Count
 8	| Immediate
  	| <alignment member> (size=3)
	+---

class _TAPE_GET_POSITION	size(16):
	+---
 0	| Type
 4	| Partition
 8	| _LARGE_INTEGER Offset
	+---

class _TAPE_SET_POSITION	size(24):
	+---
 0	| Method
 4	| Partition
 8	| _LARGE_INTEGER Offset
16	| Immediate
  	| <alignment member> (size=7)
	+---

class _TAPE_GET_DRIVE_PARAMETERS	size(32):
	+---
 0	| ECC
 1	| Compression
 2	| DataPadding
 3	| ReportSetmarks
 4	| DefaultBlockSize
 8	| MaximumBlockSize
12	| MinimumBlockSize
16	| MaximumPartitionCount
20	| FeaturesLow
24	| FeaturesHigh
28	| EOTWarningZoneSize
	+---

class _TAPE_SET_DRIVE_PARAMETERS	size(8):
	+---
 0	| ECC
 1	| Compression
 2	| DataPadding
 3	| ReportSetmarks
 4	| EOTWarningZoneSize
	+---

class _TAPE_GET_MEDIA_PARAMETERS	size(32):
	+---
 0	| _LARGE_INTEGER Capacity
 8	| _LARGE_INTEGER Remaining
16	| BlockSize
20	| PartitionCount
24	| WriteProtected
  	| <alignment member> (size=7)
	+---

class _TAPE_SET_MEDIA_PARAMETERS	size(4):
	+---
 0	| BlockSize
	+---

class _TAPE_CREATE_PARTITION	size(12):
	+---
 0	| Method
 4	| Count
 8	| Size
	+---

class _TAPE_WMI_OPERATIONS	size(12):
	+---
 0	| Method
 4	| DataBufferSize
 8	| DataBuffer
	+---

class _TRANSACTION_NOTIFICATION	size(24):
	+---
 0	| TransactionKey
 4	| TransactionNotification
 8	| _LARGE_INTEGER TmVirtualClock
16	| ArgumentLength
  	| <alignment member> (size=4)
	+---

class _TRANSACTION_NOTIFICATION_RECOVERY_ARGUMENT	size(32):
	+---
 0	| _GUID EnlistmentId
16	| _GUID UOW
	+---

class _TRANSACTION_NOTIFICATION_TM_ONLINE_ARGUMENT	size(20):
	+---
 0	| _GUID TmIdentity
16	| Flags
	+---

class _TRANSACTION_NOTIFICATION_SAVEPOINT_ARGUMENT	size(4):
	+---
 0	| SavepointId
	+---

class _TRANSACTION_NOTIFICATION_PROPAGATE_ARGUMENT	size(40):
	+---
 0	| PropagationCookie
 4	| _GUID UOW
20	| _GUID TmIdentity
36	| BufferLength
	+---

class _TRANSACTION_NOTIFICATION_MARSHAL_ARGUMENT	size(20):
	+---
 0	| MarshalCookie
 4	| _GUID UOW
	+---

class _KCRM_MARSHAL_HEADER	size(16):
	+---
 0	| VersionMajor
 4	| VersionMinor
 8	| NumProtocols
12	| Unused
	+---

class _KCRM_TRANSACTION_BLOB	size(172):
	+---
 0	| _GUID UOW
16	| _GUID TmIdentity
32	| IsolationLevel
36	| IsolationFlags
40	| Timeout
44	| Description
	+---

class _KCRM_PROTOCOL_BLOB	size(32):
	+---
 0	| _GUID ProtocolId
16	| StaticInfoLength
20	| TransactionIdInfoLength
24	| Unused1
28	| Unused2
	+---

class _TRANSACTION_BASIC_INFORMATION	size(24):
	+---
 0	| _GUID TransactionId
16	| State
20	| Outcome
	+---

class _TRANSACTIONMANAGER_BASIC_INFORMATION	size(24):
	+---
 0	| _GUID TmIdentity
16	| _LARGE_INTEGER VirtualClock
	+---

class _TRANSACTIONMANAGER_LOG_INFORMATION	size(16):
	+---
 0	| _GUID LogIdentity
	+---

class _TRANSACTIONMANAGER_LOGPATH_INFORMATION	size(8):
	+---
 0	| LogPathLength
 4	| LogPath
  	| <alignment member> (size=2)
	+---

class _TRANSACTIONMANAGER_RECOVERY_INFORMATION	size(8):
	+---
 0	| LastRecoveredLsn
	+---

class _TRANSACTIONMANAGER_OLDEST_INFORMATION	size(16):
	+---
 0	| _GUID OldestTransactionGuid
	+---

class _TRANSACTION_PROPERTIES_INFORMATION	size(32):
	+---
 0	| IsolationLevel
 4	| IsolationFlags
 8	| _LARGE_INTEGER Timeout
16	| Outcome
20	| DescriptionLength
24	| Description
  	| <alignment member> (size=6)
	+---

class _TRANSACTION_BIND_INFORMATION	size(4):
	+---
 0	| TmHandle
	+---

class _TRANSACTION_ENLISTMENT_PAIR	size(32):
	+---
 0	| _GUID EnlistmentId
16	| _GUID ResourceManagerId
	+---

class _TRANSACTION_ENLISTMENTS_INFORMATION	size(36):
	+---
 0	| NumberOfEnlistments
 4	| EnlistmentPair
	+---

class _TRANSACTION_SUPERIOR_ENLISTMENT_INFORMATION	size(32):
	+---
 0	| _TRANSACTION_ENLISTMENT_PAIR SuperiorEnlistmentPair
	+---

class _RESOURCEMANAGER_BASIC_INFORMATION	size(24):
	+---
 0	| _GUID ResourceManagerId
16	| DescriptionLength
20	| Description
  	| <alignment member> (size=2)
	+---

class _RESOURCEMANAGER_COMPLETION_INFORMATION	size(8):
	+---
 0	| IoCompletionPortHandle
 4	| CompletionKey
	+---

class _ENLISTMENT_BASIC_INFORMATION	size(48):
	+---
 0	| _GUID EnlistmentId
16	| _GUID TransactionId
32	| _GUID ResourceManagerId
	+---

class _ENLISTMENT_CRM_INFORMATION	size(48):
	+---
 0	| _GUID CrmTransactionManagerId
16	| _GUID CrmResourceManagerId
32	| _GUID CrmEnlistmentId
	+---

class _TRANSACTION_LIST_ENTRY	size(16):
	+---
 0	| _GUID UOW
	+---

class _TRANSACTION_LIST_INFORMATION	size(20):
	+---
 0	| NumberOfTransactions
 4	| TransactionInformation
	+---

class _KTMOBJECT_CURSOR	size(36):
	+---
 0	| _GUID LastQuery
16	| ObjectIdCount
20	| ObjectIds
	+---

class _TP_POOL_STACK_INFORMATION	size(8):
	+---
 0	| StackReserve
 4	| StackCommit
	+---

class _TP_CALLBACK_ENVIRON_V3::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| LongFunction (bitstart=0,nbits=1)
 0.	| Persistent (bitstart=1,nbits=1)
 0.	| Private (bitstart=2,nbits=30)
	+---

class _TP_CALLBACK_ENVIRON_V3::<unnamed-tag>	size(4):
	+---
 0	| Flags
 0	| <unnamed-type-s> s
	+---

class _TP_CALLBACK_ENVIRON_V3	size(40):
	+---
 0	| Version
 4	| Pool
 8	| CleanupGroup
12	| CleanupGroupCancelCallback
16	| RaceDll
20	| ActivationContext
24	| FinalizationCallback
28	| <unnamed-type-u> u
32	| _TP_CALLBACK_PRIORITY CallbackPriority
36	| Size
	+---

class HKEY__	size(4):
	+---
 0	| unused
	+---

class HMETAFILE__	size(4):
	+---
 0	| unused
	+---

class HINSTANCE__	size(4):
	+---
 0	| unused
	+---

class HRGN__	size(4):
	+---
 0	| unused
	+---

class HRSRC__	size(4):
	+---
 0	| unused
	+---

class HSPRITE__	size(4):
	+---
 0	| unused
	+---

class HLSURF__	size(4):
	+---
 0	| unused
	+---

class HSTR__	size(4):
	+---
 0	| unused
	+---

class HTASK__	size(4):
	+---
 0	| unused
	+---

class HWINSTA__	size(4):
	+---
 0	| unused
	+---

class HKL__	size(4):
	+---
 0	| unused
	+---

class _FILETIME	size(8):
	+---
 0	| dwLowDateTime
 4	| dwHighDateTime
	+---

class HWND__	size(4):
	+---
 0	| unused
	+---

class HHOOK__	size(4):
	+---
 0	| unused
	+---

class HACCEL__	size(4):
	+---
 0	| unused
	+---

class HBITMAP__	size(4):
	+---
 0	| unused
	+---

class HBRUSH__	size(4):
	+---
 0	| unused
	+---

class HCOLORSPACE__	size(4):
	+---
 0	| unused
	+---

class HDC__	size(4):
	+---
 0	| unused
	+---

class HGLRC__	size(4):
	+---
 0	| unused
	+---

class HDESK__	size(4):
	+---
 0	| unused
	+---

class HENHMETAFILE__	size(4):
	+---
 0	| unused
	+---

class HFONT__	size(4):
	+---
 0	| unused
	+---

class HICON__	size(4):
	+---
 0	| unused
	+---

class HMENU__	size(4):
	+---
 0	| unused
	+---

class HPALETTE__	size(4):
	+---
 0	| unused
	+---

class HPEN__	size(4):
	+---
 0	| unused
	+---

class HWINEVENTHOOK__	size(4):
	+---
 0	| unused
	+---

class HMONITOR__	size(4):
	+---
 0	| unused
	+---

class HUMPD__	size(4):
	+---
 0	| unused
	+---

class tagRECT	size(16):
	+---
 0	| left
 4	| top
 8	| right
12	| bottom
	+---

class _RECTL	size(16):
	+---
 0	| left
 4	| top
 8	| right
12	| bottom
	+---

class tagPOINT	size(8):
	+---
 0	| x
 4	| y
	+---

class _POINTL	size(8):
	+---
 0	| x
 4	| y
	+---

class tagSIZE	size(8):
	+---
 0	| cx
 4	| cy
	+---

class tagPOINTS	size(4):
	+---
 0	| x
 2	| y
	+---

class _SECURITY_ATTRIBUTES	size(12):
	+---
 0	| nLength
 4	| lpSecurityDescriptor
 8	| bInheritHandle
	+---

class _OVERLAPPED::<unnamed-tag>::<unnamed-tag>	size(8):
	+---
 0	| Offset
 4	| OffsetHigh
	+---

class _OVERLAPPED::<unnamed-tag>	size(8):
	+---
 0	| Offset
 4	| OffsetHigh
 0	| Pointer
	+---

class _OVERLAPPED	size(20):
	+---
 0	| Internal
 4	| InternalHigh
  	| <unnamed-tag> <alignment member> (size=8)
  	| <unnamed-tag> <alignment member> (size=8)
 8	| Offset
12	| OffsetHigh
  	| <unnamed-tag> <alignment member> (size=8)
 8	| Pointer
16	| hEvent
	+---

class _OVERLAPPED_ENTRY	size(16):
	+---
 0	| lpCompletionKey
 4	| lpOverlapped
 8	| Internal
12	| dwNumberOfBytesTransferred
	+---

class _SYSTEMTIME	size(16):
	+---
 0	| wYear
 2	| wMonth
 4	| wDayOfWeek
 6	| wDay
 8	| wHour
10	| wMinute
12	| wSecond
14	| wMilliseconds
	+---

class _WIN32_FIND_DATAA	size(320):
	+---
 0	| dwFileAttributes
 4	| _FILETIME ftCreationTime
12	| _FILETIME ftLastAccessTime
20	| _FILETIME ftLastWriteTime
28	| nFileSizeHigh
32	| nFileSizeLow
36	| dwReserved0
40	| dwReserved1
44	| cFileName
304	| cAlternateFileName
  	| <alignment member> (size=2)
	+---

class _WIN32_FIND_DATAW	size(592):
	+---
 0	| dwFileAttributes
 4	| _FILETIME ftCreationTime
12	| _FILETIME ftLastAccessTime
20	| _FILETIME ftLastWriteTime
28	| nFileSizeHigh
32	| nFileSizeLow
36	| dwReserved0
40	| dwReserved1
44	| cFileName
564	| cAlternateFileName
	+---

class _PROCESS_HEAP_ENTRY::<unnamed-tag>::<unnamed-tag>	size(16):
	+---
 0	| hMem
 4	| dwReserved
	+---

class _PROCESS_HEAP_ENTRY::<unnamed-tag>::<unnamed-tag>	size(16):
	+---
 0	| dwCommittedSize
 4	| dwUnCommittedSize
 8	| lpFirstBlock
12	| lpLastBlock
	+---

class _PROCESS_HEAP_ENTRY::<unnamed-tag>	size(16):
	+---
 0	| <unnamed-type-Block> Block
 0	| <unnamed-type-Region> Region
	+---

class _PROCESS_HEAP_ENTRY	size(28):
	+---
 0	| lpData
 4	| cbData
 8	| cbOverhead
 9	| iRegionIndex
10	| wFlags
  	| <unnamed-tag> <alignment member> (size=12)
12	| <unnamed-type-Block> Block
12	| <unnamed-type-Region> Region
	+---

class _REASON_CONTEXT::<unnamed-tag>::<unnamed-tag>	size(16):
	+---
 0	| LocalizedReasonModule
 4	| LocalizedReasonId
 8	| ReasonStringCount
12	| ReasonStrings
	+---

class _REASON_CONTEXT::<unnamed-tag>	size(16):
	+---
 0	| <unnamed-type-Detailed> Detailed
 0	| SimpleReasonString
	+---

class _REASON_CONTEXT	size(24):
	+---
 0	| Version
 4	| Flags
 8	| <unnamed-type-Reason> Reason
	+---

class _EXCEPTION_DEBUG_INFO	size(84):
	+---
 0	| _EXCEPTION_RECORD ExceptionRecord
80	| dwFirstChance
	+---

class _CREATE_THREAD_DEBUG_INFO	size(12):
	+---
 0	| hThread
 4	| lpThreadLocalBase
 8	| lpStartAddress
	+---

class _CREATE_PROCESS_DEBUG_INFO	size(40):
	+---
 0	| hFile
 4	| hProcess
 8	| hThread
12	| lpBaseOfImage
16	| dwDebugInfoFileOffset
20	| nDebugInfoSize
24	| lpThreadLocalBase
28	| lpStartAddress
32	| lpImageName
36	| fUnicode
  	| <alignment member> (size=2)
	+---

class _EXIT_THREAD_DEBUG_INFO	size(4):
	+---
 0	| dwExitCode
	+---

class _EXIT_PROCESS_DEBUG_INFO	size(4):
	+---
 0	| dwExitCode
	+---

class _LOAD_DLL_DEBUG_INFO	size(24):
	+---
 0	| hFile
 4	| lpBaseOfDll
 8	| dwDebugInfoFileOffset
12	| nDebugInfoSize
16	| lpImageName
20	| fUnicode
  	| <alignment member> (size=2)
	+---

class _UNLOAD_DLL_DEBUG_INFO	size(4):
	+---
 0	| lpBaseOfDll
	+---

class _OUTPUT_DEBUG_STRING_INFO	size(8):
	+---
 0	| lpDebugStringData
 4	| fUnicode
 6	| nDebugStringLength
	+---

class _RIP_INFO	size(8):
	+---
 0	| dwError
 4	| dwType
	+---

class _DEBUG_EVENT::<unnamed-tag>	size(84):
	+---
 0	| _EXCEPTION_DEBUG_INFO Exception
 0	| _CREATE_THREAD_DEBUG_INFO CreateThread
 0	| _CREATE_PROCESS_DEBUG_INFO CreateProcessInfo
 0	| _EXIT_THREAD_DEBUG_INFO ExitThread
 0	| _EXIT_PROCESS_DEBUG_INFO ExitProcess
 0	| _LOAD_DLL_DEBUG_INFO LoadDll
 0	| _UNLOAD_DLL_DEBUG_INFO UnloadDll
 0	| _OUTPUT_DEBUG_STRING_INFO DebugString
 0	| _RIP_INFO RipInfo
	+---

class _DEBUG_EVENT	size(96):
	+---
 0	| dwDebugEventCode
 4	| dwProcessId
 8	| dwThreadId
12	| <unnamed-type-u> u
	+---

class _WIN32_FILE_ATTRIBUTE_DATA	size(36):
	+---
 0	| dwFileAttributes
 4	| _FILETIME ftCreationTime
12	| _FILETIME ftLastAccessTime
20	| _FILETIME ftLastWriteTime
28	| nFileSizeHigh
32	| nFileSizeLow
	+---

class _BY_HANDLE_FILE_INFORMATION	size(52):
	+---
 0	| dwFileAttributes
 4	| _FILETIME ftCreationTime
12	| _FILETIME ftLastAccessTime
20	| _FILETIME ftLastWriteTime
28	| dwVolumeSerialNumber
32	| nFileSizeHigh
36	| nFileSizeLow
40	| nNumberOfLinks
44	| nFileIndexHigh
48	| nFileIndexLow
	+---

class _CREATEFILE2_EXTENDED_PARAMETERS	size(24):
	+---
 0	| dwSize
 4	| dwFileAttributes
 8	| dwFileFlags
12	| dwSecurityQosFlags
16	| lpSecurityAttributes
20	| hTemplateFile
	+---

class _WIN32_FIND_STREAM_DATA	size(600):
	+---
 0	| _LARGE_INTEGER StreamSize
 8	| cStreamName
	+---

class _HEAP_SUMMARY	size(20):
	+---
 0	| cb
 4	| cbAllocated
 8	| cbCommitted
12	| cbReserved
16	| cbMaxReserve
	+---

class _PROCESS_INFORMATION	size(16):
	+---
 0	| hProcess
 4	| hThread
 8	| dwProcessId
12	| dwThreadId
	+---

class _STARTUPINFOA	size(68):
	+---
 0	| cb
 4	| lpReserved
 8	| lpDesktop
12	| lpTitle
16	| dwX
20	| dwY
24	| dwXSize
28	| dwYSize
32	| dwXCountChars
36	| dwYCountChars
40	| dwFillAttribute
44	| dwFlags
48	| wShowWindow
50	| cbReserved2
52	| lpReserved2
56	| hStdInput
60	| hStdOutput
64	| hStdError
	+---

class _STARTUPINFOW	size(68):
	+---
 0	| cb
 4	| lpReserved
 8	| lpDesktop
12	| lpTitle
16	| dwX
20	| dwY
24	| dwXSize
28	| dwYSize
32	| dwXCountChars
36	| dwYCountChars
40	| dwFillAttribute
44	| dwFlags
48	| wShowWindow
50	| cbReserved2
52	| lpReserved2
56	| hStdInput
60	| hStdOutput
64	| hStdError
	+---

class _MEMORY_PRIORITY_INFORMATION	size(4):
	+---
 0	| MemoryPriority
	+---

class _APP_MEMORY_INFORMATION	size(32):
	+---
 0	| AvailableCommit
 8	| PrivateCommitUsage
16	| PeakPrivateCommitUsage
24	| TotalCommitUsage
	+---

class _EDP_PROCESS_STATE	size(32):
	+---
 0	| data
	+---

class _EDP_PROCESS_STATE_TLS	size(36):
	+---
 0	| _EDP_PROCESS_STATE EDPProcessState
32	| TlsIndex
	+---

class _PROCESS_MEMORY_EXHAUSTION_INFO	size(12):
	+---
 0	| Version
 2	| Reserved
 4	| _PROCESS_MEMORY_EXHAUSTION_TYPE Type
 8	| Value
	+---

class _SYSTEM_INFO::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0	| wProcessorArchitecture
 2	| wReserved
	+---

class _SYSTEM_INFO::<unnamed-tag>	size(4):
	+---
 0	| dwOemId
 0	| wProcessorArchitecture
 2	| wReserved
	+---

class _SYSTEM_INFO	size(36):
	+---
 0	| dwOemId
 0	| wProcessorArchitecture
 2	| wReserved
 4	| dwPageSize
 8	| lpMinimumApplicationAddress
12	| lpMaximumApplicationAddress
16	| dwActiveProcessorMask
20	| dwNumberOfProcessors
24	| dwProcessorType
28	| dwAllocationGranularity
32	| wProcessorLevel
34	| wProcessorRevision
	+---

class _MEMORYSTATUSEX	size(64):
	+---
 0	| dwLength
 4	| dwMemoryLoad
 8	| ullTotalPhys
16	| ullAvailPhys
24	| ullTotalPageFile
32	| ullAvailPageFile
40	| ullTotalVirtual
48	| ullAvailVirtual
56	| ullAvailExtendedVirtual
	+---

class _WIN32_MEMORY_RANGE_ENTRY	size(8):
	+---
 0	| VirtualAddress
 4	| NumberOfBytes
	+---

class JOBOBJECT_IO_RATE_CONTROL_INFORMATION	size(40):
	+---
 0	| MaxIops
 8	| MaxBandwidth
16	| ReservationIops
24	| VolumeName
28	| BaseIoSize
32	| ControlFlags
  	| <alignment member> (size=4)
	+---

class tagENUMUILANG	size(12):
	+---
 0	| NumOfEnumUILang
 4	| SizeOfEnumUIBuffer
 8	| pEnumUIBuffer
	+---

class _COMMPROP	size(64):
	+---
 0	| wPacketLength
 2	| wPacketVersion
 4	| dwServiceMask
 8	| dwReserved1
12	| dwMaxTxQueue
16	| dwMaxRxQueue
20	| dwMaxBaud
24	| dwProvSubType
28	| dwProvCapabilities
32	| dwSettableParams
36	| dwSettableBaud
40	| wSettableData
42	| wSettableStopParity
44	| dwCurrentTxQueue
48	| dwCurrentRxQueue
52	| dwProvSpec1
56	| dwProvSpec2
60	| wcProvChar
  	| <alignment member> (size=2)
	+---

class _COMSTAT	size(12):
	+---
 0.	| fCtsHold (bitstart=0,nbits=1)
 0.	| fDsrHold (bitstart=1,nbits=1)
 0.	| fRlsdHold (bitstart=2,nbits=1)
 0.	| fXoffHold (bitstart=3,nbits=1)
 0.	| fXoffSent (bitstart=4,nbits=1)
 0.	| fEof (bitstart=5,nbits=1)
 0.	| fTxim (bitstart=6,nbits=1)
 0.	| fReserved (bitstart=7,nbits=25)
 4	| cbInQue
 8	| cbOutQue
	+---

class _DCB	size(28):
	+---
 0	| DCBlength
 4	| BaudRate
 8.	| fBinary (bitstart=0,nbits=1)
 8.	| fParity (bitstart=1,nbits=1)
 8.	| fOutxCtsFlow (bitstart=2,nbits=1)
 8.	| fOutxDsrFlow (bitstart=3,nbits=1)
 8.	| fDtrControl (bitstart=4,nbits=2)
 8.	| fDsrSensitivity (bitstart=6,nbits=1)
 8.	| fTXContinueOnXoff (bitstart=7,nbits=1)
 8.	| fOutX (bitstart=8,nbits=1)
 8.	| fInX (bitstart=9,nbits=1)
 8.	| fErrorChar (bitstart=10,nbits=1)
 8.	| fNull (bitstart=11,nbits=1)
 8.	| fRtsControl (bitstart=12,nbits=2)
 8.	| fAbortOnError (bitstart=14,nbits=1)
 8.	| fDummy2 (bitstart=15,nbits=17)
12	| wReserved
14	| XonLim
16	| XoffLim
18	| ByteSize
19	| Parity
20	| StopBits
21	| XonChar
22	| XoffChar
23	| ErrorChar
24	| EofChar
25	| EvtChar
26	| wReserved1
	+---

class _COMMTIMEOUTS	size(20):
	+---
 0	| ReadIntervalTimeout
 4	| ReadTotalTimeoutMultiplier
 8	| ReadTotalTimeoutConstant
12	| WriteTotalTimeoutMultiplier
16	| WriteTotalTimeoutConstant
	+---

class _COMMCONFIG	size(52):
	+---
 0	| dwSize
 4	| wVersion
 6	| wReserved
 8	| _DCB dcb
36	| dwProviderSubType
40	| dwProviderOffset
44	| dwProviderSize
48	| wcProviderData
  	| <alignment member> (size=2)
	+---

class _MEMORYSTATUS	size(32):
	+---
 0	| dwLength
 4	| dwMemoryLoad
 8	| dwTotalPhys
12	| dwAvailPhys
16	| dwTotalPageFile
20	| dwAvailPageFile
24	| dwTotalVirtual
28	| dwAvailVirtual
	+---

class _JIT_DEBUG_INFO	size(40):
	+---
 0	| dwSize
 4	| dwProcessorArchitecture
 8	| dwThreadID
12	| dwReserved0
16	| lpExceptionAddress
24	| lpExceptionRecord
32	| lpContextRecord
	+---

class _OFSTRUCT	size(136):
	+---
 0	| cBytes
 1	| fFixedDisk
 2	| nErrCode
 4	| Reserved1
 6	| Reserved2
 8	| szPathName
	+---

class _UMS_SCHEDULER_STARTUP_INFO	size(16):
	+---
 0	| UmsVersion
 4	| CompletionList
 8	| SchedulerProc
12	| SchedulerParam
	+---

class _UMS_SYSTEM_THREAD_INFORMATION::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| IsUmsSchedulerThread (bitstart=0,nbits=1)
 0.	| IsUmsWorkerThread (bitstart=1,nbits=1)
	+---

class _UMS_SYSTEM_THREAD_INFORMATION::<unnamed-tag>	size(4):
	+---
 0.	| IsUmsSchedulerThread (bitstart=0,nbits=1)
 0.	| IsUmsWorkerThread (bitstart=1,nbits=1)
 0	| ThreadUmsFlags
	+---

class _UMS_SYSTEM_THREAD_INFORMATION	size(8):
	+---
 0	| UmsVersion
  	| <unnamed-tag> <alignment member> (size=4)
  	| <unnamed-tag> <alignment member> (size=4)
 4.	| IsUmsSchedulerThread (bitstart=0,nbits=1)
 4.	| IsUmsWorkerThread (bitstart=1,nbits=1)
  	| <unnamed-tag> <alignment member> (size=4)
 4	| ThreadUmsFlags
	+---

class _WIN32_STREAM_ID	size(24):
	+---
 0	| dwStreamId
 4	| dwStreamAttributes
 8	| _LARGE_INTEGER Size
16	| dwStreamNameSize
20	| cStreamName
  	| <alignment member> (size=2)
	+---

class _STARTUPINFOEXA	size(72):
	+---
 0	| _STARTUPINFOA StartupInfo
68	| lpAttributeList
	+---

class _STARTUPINFOEXW	size(72):
	+---
 0	| _STARTUPINFOW StartupInfo
68	| lpAttributeList
	+---

class COPYFILE2_MESSAGE::<unnamed-tag>::<unnamed-tag>	size(48):
	+---
 0	| dwStreamNumber
 4	| dwReserved
 8	| hSourceFile
12	| hDestinationFile
16	| _ULARGE_INTEGER uliChunkNumber
24	| _ULARGE_INTEGER uliChunkSize
32	| _ULARGE_INTEGER uliStreamSize
40	| _ULARGE_INTEGER uliTotalFileSize
	+---

class COPYFILE2_MESSAGE::<unnamed-tag>::<unnamed-tag>	size(64):
	+---
 0	| dwStreamNumber
 4	| dwFlags
 8	| hSourceFile
12	| hDestinationFile
16	| _ULARGE_INTEGER uliChunkNumber
24	| _ULARGE_INTEGER uliChunkSize
32	| _ULARGE_INTEGER uliStreamSize
40	| _ULARGE_INTEGER uliStreamBytesTransferred
48	| _ULARGE_INTEGER uliTotalFileSize
56	| _ULARGE_INTEGER uliTotalBytesTransferred
	+---

class COPYFILE2_MESSAGE::<unnamed-tag>::<unnamed-tag>	size(32):
	+---
 0	| dwStreamNumber
 4	| dwReserved
 8	| hSourceFile
12	| hDestinationFile
16	| _ULARGE_INTEGER uliStreamSize
24	| _ULARGE_INTEGER uliTotalFileSize
	+---

class COPYFILE2_MESSAGE::<unnamed-tag>::<unnamed-tag>	size(48):
	+---
 0	| dwStreamNumber
 4	| dwReserved
 8	| hSourceFile
12	| hDestinationFile
16	| _ULARGE_INTEGER uliStreamSize
24	| _ULARGE_INTEGER uliStreamBytesTransferred
32	| _ULARGE_INTEGER uliTotalFileSize
40	| _ULARGE_INTEGER uliTotalBytesTransferred
	+---

class COPYFILE2_MESSAGE::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0	| dwReserved
	+---

class COPYFILE2_MESSAGE::<unnamed-tag>::<unnamed-tag>	size(56):
	+---
 0	| _COPYFILE2_COPY_PHASE CopyPhase
 4	| dwStreamNumber
 8	| hrFailure
12	| dwReserved
16	| _ULARGE_INTEGER uliChunkNumber
24	| _ULARGE_INTEGER uliStreamSize
32	| _ULARGE_INTEGER uliStreamBytesTransferred
40	| _ULARGE_INTEGER uliTotalFileSize
48	| _ULARGE_INTEGER uliTotalBytesTransferred
	+---

class COPYFILE2_MESSAGE::<unnamed-tag>	size(64):
	+---
 0	| <unnamed-type-ChunkStarted> ChunkStarted
 0	| <unnamed-type-ChunkFinished> ChunkFinished
 0	| <unnamed-type-StreamStarted> StreamStarted
 0	| <unnamed-type-StreamFinished> StreamFinished
 0	| <unnamed-type-PollContinue> PollContinue
 0	| <unnamed-type-Error> Error
	+---

class COPYFILE2_MESSAGE	size(72):
	+---
 0	| _COPYFILE2_MESSAGE_TYPE Type
 4	| dwPadding
 8	| <unnamed-type-Info> Info
	+---

class COPYFILE2_EXTENDED_PARAMETERS	size(20):
	+---
 0	| dwSize
 4	| dwCopyFlags
 8	| pfCancel
12	| pProgressRoutine
16	| pvCallbackContext
	+---

class _EVENTLOG_FULL_INFORMATION	size(4):
	+---
 0	| dwFull
	+---

class _OPERATION_START_PARAMETERS	size(12):
	+---
 0	| Version
 4	| OperationId
 8	| Flags
	+---

class _OPERATION_END_PARAMETERS	size(12):
	+---
 0	| Version
 4	| OperationId
 8	| Flags
	+---

class tagHW_PROFILE_INFOA	size(124):
	+---
 0	| dwDockInfo
 4	| szHwProfileGuid
43	| szHwProfileName
  	| <alignment member> (size=1)
	+---

class tagHW_PROFILE_INFOW	size(244):
	+---
 0	| dwDockInfo
 4	| szHwProfileGuid
82	| szHwProfileName
  	| <alignment member> (size=2)
	+---

class _TIME_ZONE_INFORMATION	size(172):
	+---
 0	| Bias
 4	| StandardName
68	| _SYSTEMTIME StandardDate
84	| StandardBias
88	| DaylightName
152	| _SYSTEMTIME DaylightDate
168	| DaylightBias
	+---

class _TIME_DYNAMIC_ZONE_INFORMATION	size(432):
	+---
 0	| Bias
 4	| StandardName
68	| _SYSTEMTIME StandardDate
84	| StandardBias
88	| DaylightName
152	| _SYSTEMTIME DaylightDate
168	| DaylightBias
172	| TimeZoneKeyName
428	| DynamicDaylightTimeDisabled
  	| <alignment member> (size=3)
	+---

class _SYSTEM_POWER_STATUS	size(12):
	+---
 0	| ACLineStatus
 1	| BatteryFlag
 2	| BatteryLifePercent
 3	| SystemStatusFlag
 4	| BatteryLifeTime
 8	| BatteryFullLifeTime
	+---

class tagACTCTXA	size(32):
	+---
 0	| cbSize
 4	| dwFlags
 8	| lpSource
12	| wProcessorArchitecture
14	| wLangId
16	| lpAssemblyDirectory
20	| lpResourceName
24	| lpApplicationName
28	| hModule
	+---

class tagACTCTXW	size(32):
	+---
 0	| cbSize
 4	| dwFlags
 8	| lpSource
12	| wProcessorArchitecture
14	| wLangId
16	| lpAssemblyDirectory
20	| lpResourceName
24	| lpApplicationName
28	| hModule
	+---

class tagACTCTX_SECTION_KEYED_DATA_2600	size(40):
	+---
 0	| cbSize
 4	| ulDataFormatVersion
 8	| lpData
12	| ulLength
16	| lpSectionGlobalData
20	| ulSectionGlobalDataLength
24	| lpSectionBase
28	| ulSectionTotalLength
32	| hActCtx
36	| ulAssemblyRosterIndex
	+---

class tagACTCTX_SECTION_KEYED_DATA_ASSEMBLY_METADATA	size(20):
	+---
 0	| lpInformation
 4	| lpSectionBase
 8	| ulSectionLength
12	| lpSectionGlobalDataBase
16	| ulSectionGlobalDataLength
	+---

class tagACTCTX_SECTION_KEYED_DATA	size(64):
	+---
 0	| cbSize
 4	| ulDataFormatVersion
 8	| lpData
12	| ulLength
16	| lpSectionGlobalData
20	| ulSectionGlobalDataLength
24	| lpSectionBase
28	| ulSectionTotalLength
32	| hActCtx
36	| ulAssemblyRosterIndex
40	| ulFlags
44	| tagACTCTX_SECTION_KEYED_DATA_ASSEMBLY_METADATA AssemblyMetadata
	+---

class _ACTIVATION_CONTEXT_BASIC_INFORMATION	size(8):
	+---
 0	| hActCtx
 4	| dwFlags
	+---

class _FILE_BASIC_INFO	size(40):
	+---
 0	| _LARGE_INTEGER CreationTime
 8	| _LARGE_INTEGER LastAccessTime
16	| _LARGE_INTEGER LastWriteTime
24	| _LARGE_INTEGER ChangeTime
32	| FileAttributes
  	| <alignment member> (size=4)
	+---

class _FILE_STANDARD_INFO	size(24):
	+---
 0	| _LARGE_INTEGER AllocationSize
 8	| _LARGE_INTEGER EndOfFile
16	| NumberOfLinks
20	| DeletePending
21	| Directory
  	| <alignment member> (size=2)
	+---

class _FILE_NAME_INFO	size(8):
	+---
 0	| FileNameLength
 4	| FileName
  	| <alignment member> (size=2)
	+---

class _FILE_RENAME_INFO	size(16):
	+---
 0	| ReplaceIfExists
  	| <alignment member> (size=3)
 4	| RootDirectory
 8	| FileNameLength
12	| FileName
  	| <alignment member> (size=2)
	+---

class _FILE_ALLOCATION_INFO	size(8):
	+---
 0	| _LARGE_INTEGER AllocationSize
	+---

class _FILE_END_OF_FILE_INFO	size(8):
	+---
 0	| _LARGE_INTEGER EndOfFile
	+---

class _FILE_STREAM_INFO	size(32):
	+---
 0	| NextEntryOffset
 4	| StreamNameLength
 8	| _LARGE_INTEGER StreamSize
16	| _LARGE_INTEGER StreamAllocationSize
24	| StreamName
  	| <alignment member> (size=6)
	+---

class _FILE_COMPRESSION_INFO	size(16):
	+---
 0	| _LARGE_INTEGER CompressedFileSize
 8	| CompressionFormat
10	| CompressionUnitShift
11	| ChunkShift
12	| ClusterShift
13	| Reserved
	+---

class _FILE_ATTRIBUTE_TAG_INFO	size(8):
	+---
 0	| FileAttributes
 4	| ReparseTag
	+---

class _FILE_DISPOSITION_INFO	size(1):
	+---
 0	| DeleteFileA
	+---

class _FILE_ID_BOTH_DIR_INFO	size(112):
	+---
 0	| NextEntryOffset
 4	| FileIndex
 8	| _LARGE_INTEGER CreationTime
16	| _LARGE_INTEGER LastAccessTime
24	| _LARGE_INTEGER LastWriteTime
32	| _LARGE_INTEGER ChangeTime
40	| _LARGE_INTEGER EndOfFile
48	| _LARGE_INTEGER AllocationSize
56	| FileAttributes
60	| FileNameLength
64	| EaSize
68	| ShortNameLength
  	| <alignment member> (size=1)
70	| ShortName
  	| <alignment member> (size=2)
96	| _LARGE_INTEGER FileId
104	| FileName
  	| <alignment member> (size=6)
	+---

class _FILE_FULL_DIR_INFO	size(72):
	+---
 0	| NextEntryOffset
 4	| FileIndex
 8	| _LARGE_INTEGER CreationTime
16	| _LARGE_INTEGER LastAccessTime
24	| _LARGE_INTEGER LastWriteTime
32	| _LARGE_INTEGER ChangeTime
40	| _LARGE_INTEGER EndOfFile
48	| _LARGE_INTEGER AllocationSize
56	| FileAttributes
60	| FileNameLength
64	| EaSize
68	| FileName
  	| <alignment member> (size=2)
	+---

class _FILE_IO_PRIORITY_HINT_INFO	size(4):
	+---
 0	| _PRIORITY_HINT PriorityHint
	+---

class _FILE_ALIGNMENT_INFO	size(4):
	+---
 0	| AlignmentRequirement
	+---

class _FILE_STORAGE_INFO	size(28):
	+---
 0	| LogicalBytesPerSector
 4	| PhysicalBytesPerSectorForAtomicity
 8	| PhysicalBytesPerSectorForPerformance
12	| FileSystemEffectivePhysicalBytesPerSectorForAtomicity
16	| Flags
20	| ByteOffsetForSectorAlignment
24	| ByteOffsetForPartitionAlignment
	+---

class _FILE_ID_INFO	size(24):
	+---
 0	| VolumeSerialNumber
 8	| _FILE_ID_128 FileId
	+---

class _FILE_ID_EXTD_DIR_INFO	size(96):
	+---
 0	| NextEntryOffset
 4	| FileIndex
 8	| _LARGE_INTEGER CreationTime
16	| _LARGE_INTEGER LastAccessTime
24	| _LARGE_INTEGER LastWriteTime
32	| _LARGE_INTEGER ChangeTime
40	| _LARGE_INTEGER EndOfFile
48	| _LARGE_INTEGER AllocationSize
56	| FileAttributes
60	| FileNameLength
64	| EaSize
68	| ReparsePointTag
72	| _FILE_ID_128 FileId
88	| FileName
  	| <alignment member> (size=6)
	+---

class _FILE_REMOTE_PROTOCOL_INFO::<unnamed-tag>	size(32):
	+---
 0	| Reserved
	+---

class _FILE_REMOTE_PROTOCOL_INFO::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0	| Capabilities
	+---

class _FILE_REMOTE_PROTOCOL_INFO::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(8):
	+---
 0	| Capabilities
 4	| CachingFlags
	+---

class _FILE_REMOTE_PROTOCOL_INFO::<unnamed-tag>::<unnamed-tag>	size(12):
	+---
 0	| <unnamed-type-Server> Server
 4	| <unnamed-type-Share> Share
	+---

class _FILE_REMOTE_PROTOCOL_INFO::<unnamed-tag>	size(64):
	+---
 0	| <unnamed-type-Smb2> Smb2
 0	| Reserved
	+---

class _FILE_REMOTE_PROTOCOL_INFO	size(116):
	+---
 0	| StructureVersion
 2	| StructureSize
 4	| Protocol
 8	| ProtocolMajorVersion
10	| ProtocolMinorVersion
12	| ProtocolRevision
14	| Reserved
16	| Flags
20	| <unnamed-type-GenericReserved> GenericReserved
52	| <unnamed-type-ProtocolSpecific> ProtocolSpecific
	+---

class FILE_ID_DESCRIPTOR::<unnamed-tag>	size(16):
	+---
 0	| _LARGE_INTEGER FileId
 0	| _GUID ObjectId
 0	| _FILE_ID_128 ExtendedFileId
	+---

class FILE_ID_DESCRIPTOR	size(24):
	+---
 0	| dwSize
 4	| _FILE_ID_TYPE Type
  	| <unnamed-tag> <alignment member> (size=8)
 8	| _LARGE_INTEGER FileId
 8	| _GUID ObjectId
 8	| _FILE_ID_128 ExtendedFileId
	+---

class _DRAWPATRECT	size(20):
	+---
 0	| tagPOINT ptPosition
 8	| tagPOINT ptSize
16	| wStyle
18	| wPattern
	+---

class _PSINJECTDATA	size(8):
	+---
 0	| DataBytes
 4	| InjectionPoint
 6	| PageNumber
	+---

class _PSFEATURE_OUTPUT	size(8):
	+---
 0	| bPageIndependent
 4	| bSetPageDevice
	+---

class _PSFEATURE_CUSTPAPER	size(20):
	+---
 0	| lOrientation
 4	| lWidth
 8	| lHeight
12	| lWidthOffset
16	| lHeightOffset
	+---

class tagXFORM	size(24):
	+---
 0	| eM11
 4	| eM12
 8	| eM21
12	| eM22
16	| eDx
20	| eDy
	+---

class tagBITMAP	size(24):
	+---
 0	| bmType
 4	| bmWidth
 8	| bmHeight
12	| bmWidthBytes
16	| bmPlanes
18	| bmBitsPixel
20	| bmBits
	+---

class tagRGBTRIPLE	size(3):
	+---
 0	| rgbtBlue
 1	| rgbtGreen
 2	| rgbtRed
	+---

class tagRGBQUAD	size(4):
	+---
 0	| rgbBlue
 1	| rgbGreen
 2	| rgbRed
 3	| rgbReserved
	+---

class tagCIEXYZ	size(12):
	+---
 0	| ciexyzX
 4	| ciexyzY
 8	| ciexyzZ
	+---

class tagICEXYZTRIPLE	size(36):
	+---
 0	| tagCIEXYZ ciexyzRed
12	| tagCIEXYZ ciexyzGreen
24	| tagCIEXYZ ciexyzBlue
	+---

class tagLOGCOLORSPACEA	size(328):
	+---
 0	| lcsSignature
 4	| lcsVersion
 8	| lcsSize
12	| lcsCSType
16	| lcsIntent
20	| tagICEXYZTRIPLE lcsEndpoints
56	| lcsGammaRed
60	| lcsGammaGreen
64	| lcsGammaBlue
68	| lcsFilename
	+---

class tagLOGCOLORSPACEW	size(588):
	+---
 0	| lcsSignature
 4	| lcsVersion
 8	| lcsSize
12	| lcsCSType
16	| lcsIntent
20	| tagICEXYZTRIPLE lcsEndpoints
56	| lcsGammaRed
60	| lcsGammaGreen
64	| lcsGammaBlue
68	| lcsFilename
	+---

class tagBITMAPCOREHEADER	size(12):
	+---
 0	| bcSize
 4	| bcWidth
 6	| bcHeight
 8	| bcPlanes
10	| bcBitCount
	+---

class tagBITMAPINFOHEADER	size(40):
	+---
 0	| biSize
 4	| biWidth
 8	| biHeight
12	| biPlanes
14	| biBitCount
16	| biCompression
20	| biSizeImage
24	| biXPelsPerMeter
28	| biYPelsPerMeter
32	| biClrUsed
36	| biClrImportant
	+---

class <unnamed-tag>	size(108):
	+---
 0	| bV4Size
 4	| bV4Width
 8	| bV4Height
12	| bV4Planes
14	| bV4BitCount
16	| bV4V4Compression
20	| bV4SizeImage
24	| bV4XPelsPerMeter
28	| bV4YPelsPerMeter
32	| bV4ClrUsed
36	| bV4ClrImportant
40	| bV4RedMask
44	| bV4GreenMask
48	| bV4BlueMask
52	| bV4AlphaMask
56	| bV4CSType
60	| tagICEXYZTRIPLE bV4Endpoints
96	| bV4GammaRed
100	| bV4GammaGreen
104	| bV4GammaBlue
	+---

class <unnamed-tag>	size(124):
	+---
 0	| bV5Size
 4	| bV5Width
 8	| bV5Height
12	| bV5Planes
14	| bV5BitCount
16	| bV5Compression
20	| bV5SizeImage
24	| bV5XPelsPerMeter
28	| bV5YPelsPerMeter
32	| bV5ClrUsed
36	| bV5ClrImportant
40	| bV5RedMask
44	| bV5GreenMask
48	| bV5BlueMask
52	| bV5AlphaMask
56	| bV5CSType
60	| tagICEXYZTRIPLE bV5Endpoints
96	| bV5GammaRed
100	| bV5GammaGreen
104	| bV5GammaBlue
108	| bV5Intent
112	| bV5ProfileData
116	| bV5ProfileSize
120	| bV5Reserved
	+---

class tagBITMAPINFO	size(44):
	+---
 0	| tagBITMAPINFOHEADER bmiHeader
40	| bmiColors
	+---

class tagBITMAPCOREINFO	size(16):
	+---
 0	| tagBITMAPCOREHEADER bmciHeader
12	| bmciColors
  	| <alignment member> (size=1)
	+---

class tagBITMAPFILEHEADER	size(14):
	+---
 0	| bfType
 2	| bfSize
 6	| bfReserved1
 8	| bfReserved2
10	| bfOffBits
	+---

class tagFONTSIGNATURE	size(24):
	+---
 0	| fsUsb
16	| fsCsb
	+---

class tagCHARSETINFO	size(32):
	+---
 0	| ciCharset
 4	| ciACP
 8	| tagFONTSIGNATURE fs
	+---

class tagLOCALESIGNATURE	size(32):
	+---
 0	| lsUsb
16	| lsCsbDefault
24	| lsCsbSupported
	+---

class tagHANDLETABLE	size(4):
	+---
 0	| objectHandle
	+---

class tagMETARECORD	size(8):
	+---
 0	| rdSize
 4	| rdFunction
 6	| rdParm
	+---

class tagMETAFILEPICT	size(16):
	+---
 0	| mm
 4	| xExt
 8	| yExt
12	| hMF
	+---

class tagMETAHEADER	size(18):
	+---
 0	| mtType
 2	| mtHeaderSize
 4	| mtVersion
 6	| mtSize
10	| mtNoObjects
12	| mtMaxRecord
16	| mtNoParameters
	+---

class tagENHMETARECORD	size(12):
	+---
 0	| iType
 4	| nSize
 8	| dParm
	+---

class tagENHMETAHEADER	size(108):
	+---
 0	| iType
 4	| nSize
 8	| _RECTL rclBounds
24	| _RECTL rclFrame
40	| dSignature
44	| nVersion
48	| nBytes
52	| nRecords
56	| nHandles
58	| sReserved
60	| nDescription
64	| offDescription
68	| nPalEntries
72	| tagSIZE szlDevice
80	| tagSIZE szlMillimeters
88	| cbPixelFormat
92	| offPixelFormat
96	| bOpenGL
100	| tagSIZE szlMicrometers
	+---

class tagTEXTMETRICA	size(56):
	+---
 0	| tmHeight
 4	| tmAscent
 8	| tmDescent
12	| tmInternalLeading
16	| tmExternalLeading
20	| tmAveCharWidth
24	| tmMaxCharWidth
28	| tmWeight
32	| tmOverhang
36	| tmDigitizedAspectX
40	| tmDigitizedAspectY
44	| tmFirstChar
45	| tmLastChar
46	| tmDefaultChar
47	| tmBreakChar
48	| tmItalic
49	| tmUnderlined
50	| tmStruckOut
51	| tmPitchAndFamily
52	| tmCharSet
  	| <alignment member> (size=3)
	+---

class tagTEXTMETRICW	size(60):
	+---
 0	| tmHeight
 4	| tmAscent
 8	| tmDescent
12	| tmInternalLeading
16	| tmExternalLeading
20	| tmAveCharWidth
24	| tmMaxCharWidth
28	| tmWeight
32	| tmOverhang
36	| tmDigitizedAspectX
40	| tmDigitizedAspectY
44	| tmFirstChar
46	| tmLastChar
48	| tmDefaultChar
50	| tmBreakChar
52	| tmItalic
53	| tmUnderlined
54	| tmStruckOut
55	| tmPitchAndFamily
56	| tmCharSet
  	| <alignment member> (size=3)
	+---

class tagNEWTEXTMETRICA	size(72):
	+---
 0	| tmHeight
 4	| tmAscent
 8	| tmDescent
12	| tmInternalLeading
16	| tmExternalLeading
20	| tmAveCharWidth
24	| tmMaxCharWidth
28	| tmWeight
32	| tmOverhang
36	| tmDigitizedAspectX
40	| tmDigitizedAspectY
44	| tmFirstChar
45	| tmLastChar
46	| tmDefaultChar
47	| tmBreakChar
48	| tmItalic
49	| tmUnderlined
50	| tmStruckOut
51	| tmPitchAndFamily
52	| tmCharSet
  	| <alignment member> (size=3)
56	| ntmFlags
60	| ntmSizeEM
64	| ntmCellHeight
68	| ntmAvgWidth
	+---

class tagNEWTEXTMETRICW	size(76):
	+---
 0	| tmHeight
 4	| tmAscent
 8	| tmDescent
12	| tmInternalLeading
16	| tmExternalLeading
20	| tmAveCharWidth
24	| tmMaxCharWidth
28	| tmWeight
32	| tmOverhang
36	| tmDigitizedAspectX
40	| tmDigitizedAspectY
44	| tmFirstChar
46	| tmLastChar
48	| tmDefaultChar
50	| tmBreakChar
52	| tmItalic
53	| tmUnderlined
54	| tmStruckOut
55	| tmPitchAndFamily
56	| tmCharSet
  	| <alignment member> (size=3)
60	| ntmFlags
64	| ntmSizeEM
68	| ntmCellHeight
72	| ntmAvgWidth
	+---

class tagNEWTEXTMETRICEXA	size(96):
	+---
 0	| tagNEWTEXTMETRICA ntmTm
72	| tagFONTSIGNATURE ntmFontSig
	+---

class tagNEWTEXTMETRICEXW	size(100):
	+---
 0	| tagNEWTEXTMETRICW ntmTm
76	| tagFONTSIGNATURE ntmFontSig
	+---

class tagPELARRAY	size(20):
	+---
 0	| paXCount
 4	| paYCount
 8	| paXExt
12	| paYExt
16	| paRGBs
  	| <alignment member> (size=3)
	+---

class tagLOGBRUSH	size(12):
	+---
 0	| lbStyle
 4	| lbColor
 8	| lbHatch
	+---

class tagLOGBRUSH32	size(12):
	+---
 0	| lbStyle
 4	| lbColor
 8	| lbHatch
	+---

class tagLOGPEN	size(16):
	+---
 0	| lopnStyle
 4	| tagPOINT lopnWidth
12	| lopnColor
	+---

class tagEXTLOGPEN	size(28):
	+---
 0	| elpPenStyle
 4	| elpWidth
 8	| elpBrushStyle
12	| elpColor
16	| elpHatch
20	| elpNumEntries
24	| elpStyleEntry
	+---

class tagEXTLOGPEN32	size(28):
	+---
 0	| elpPenStyle
 4	| elpWidth
 8	| elpBrushStyle
12	| elpColor
16	| elpHatch
20	| elpNumEntries
24	| elpStyleEntry
	+---

class tagPALETTEENTRY	size(4):
	+---
 0	| peRed
 1	| peGreen
 2	| peBlue
 3	| peFlags
	+---

class tagLOGPALETTE	size(8):
	+---
 0	| palVersion
 2	| palNumEntries
 4	| palPalEntry
	+---

class tagLOGFONTA	size(60):
	+---
 0	| lfHeight
 4	| lfWidth
 8	| lfEscapement
12	| lfOrientation
16	| lfWeight
20	| lfItalic
21	| lfUnderline
22	| lfStrikeOut
23	| lfCharSet
24	| lfOutPrecision
25	| lfClipPrecision
26	| lfQuality
27	| lfPitchAndFamily
28	| lfFaceName
	+---

class tagLOGFONTW	size(92):
	+---
 0	| lfHeight
 4	| lfWidth
 8	| lfEscapement
12	| lfOrientation
16	| lfWeight
20	| lfItalic
21	| lfUnderline
22	| lfStrikeOut
23	| lfCharSet
24	| lfOutPrecision
25	| lfClipPrecision
26	| lfQuality
27	| lfPitchAndFamily
28	| lfFaceName
	+---

class tagENUMLOGFONTA	size(156):
	+---
 0	| tagLOGFONTA elfLogFont
60	| elfFullName
124	| elfStyle
	+---

class tagENUMLOGFONTW	size(284):
	+---
 0	| tagLOGFONTW elfLogFont
92	| elfFullName
220	| elfStyle
	+---

class tagENUMLOGFONTEXA	size(188):
	+---
 0	| tagLOGFONTA elfLogFont
60	| elfFullName
124	| elfStyle
156	| elfScript
	+---

class tagENUMLOGFONTEXW	size(348):
	+---
 0	| tagLOGFONTW elfLogFont
92	| elfFullName
220	| elfStyle
284	| elfScript
	+---

class tagPANOSE	size(10):
	+---
 0	| bFamilyType
 1	| bSerifStyle
 2	| bWeight
 3	| bProportion
 4	| bContrast
 5	| bStrokeVariation
 6	| bArmStyle
 7	| bLetterform
 8	| bMidline
 9	| bXHeight
	+---

class tagEXTLOGFONTA	size(192):
	+---
 0	| tagLOGFONTA elfLogFont
60	| elfFullName
124	| elfStyle
156	| elfVersion
160	| elfStyleSize
164	| elfMatch
168	| elfReserved
172	| elfVendorId
176	| elfCulture
180	| tagPANOSE elfPanose
  	| <alignment member> (size=2)
	+---

class tagEXTLOGFONTW	size(320):
	+---
 0	| tagLOGFONTW elfLogFont
92	| elfFullName
220	| elfStyle
284	| elfVersion
288	| elfStyleSize
292	| elfMatch
296	| elfReserved
300	| elfVendorId
304	| elfCulture
308	| tagPANOSE elfPanose
  	| <alignment member> (size=2)
	+---

class _devicemodeA::<unnamed-tag>::<unnamed-tag>	size(16):
	+---
 0	| dmOrientation
 2	| dmPaperSize
 4	| dmPaperLength
 6	| dmPaperWidth
 8	| dmScale
10	| dmCopies
12	| dmDefaultSource
14	| dmPrintQuality
	+---

class _devicemodeA::<unnamed-tag>::<unnamed-tag>	size(16):
	+---
 0	| _POINTL dmPosition
 8	| dmDisplayOrientation
12	| dmDisplayFixedOutput
	+---

class _devicemodeA::<unnamed-tag>	size(16):
	+---
 0	| dmOrientation
 2	| dmPaperSize
 4	| dmPaperLength
 6	| dmPaperWidth
 8	| dmScale
10	| dmCopies
12	| dmDefaultSource
14	| dmPrintQuality
 0	| _POINTL dmPosition
 8	| dmDisplayOrientation
12	| dmDisplayFixedOutput
	+---

class _devicemodeA::<unnamed-tag>	size(4):
	+---
 0	| dmDisplayFlags
 0	| dmNup
	+---

class _devicemodeA	size(156):
	+---
 0	| dmDeviceName
32	| dmSpecVersion
34	| dmDriverVersion
36	| dmSize
38	| dmDriverExtra
40	| dmFields
  	| <unnamed-tag> <alignment member> (size=44)
  	| <unnamed-tag> <alignment member> (size=44)
44	| dmOrientation
46	| dmPaperSize
48	| dmPaperLength
50	| dmPaperWidth
52	| dmScale
54	| dmCopies
56	| dmDefaultSource
58	| dmPrintQuality
  	| <unnamed-tag> <alignment member> (size=44)
  	| <unnamed-tag> <alignment member> (size=44)
44	| _POINTL dmPosition
52	| dmDisplayOrientation
56	| dmDisplayFixedOutput
  	| <unnamed-tag> <alignment member> (size=44)
60	| dmColor
62	| dmDuplex
64	| dmYResolution
66	| dmTTOption
68	| dmCollate
70	| dmFormName
102	| dmLogPixels
104	| dmBitsPerPel
108	| dmPelsWidth
112	| dmPelsHeight
  	| <unnamed-tag> <alignment member> (size=116)
116	| dmDisplayFlags
116	| dmNup
120	| dmDisplayFrequency
124	| dmICMMethod
128	| dmICMIntent
132	| dmMediaType
136	| dmDitherType
140	| dmReserved1
144	| dmReserved2
148	| dmPanningWidth
152	| dmPanningHeight
	+---

class _devicemodeW::<unnamed-tag>::<unnamed-tag>	size(16):
	+---
 0	| dmOrientation
 2	| dmPaperSize
 4	| dmPaperLength
 6	| dmPaperWidth
 8	| dmScale
10	| dmCopies
12	| dmDefaultSource
14	| dmPrintQuality
	+---

class _devicemodeW::<unnamed-tag>::<unnamed-tag>	size(16):
	+---
 0	| _POINTL dmPosition
 8	| dmDisplayOrientation
12	| dmDisplayFixedOutput
	+---

class _devicemodeW::<unnamed-tag>	size(16):
	+---
 0	| dmOrientation
 2	| dmPaperSize
 4	| dmPaperLength
 6	| dmPaperWidth
 8	| dmScale
10	| dmCopies
12	| dmDefaultSource
14	| dmPrintQuality
 0	| _POINTL dmPosition
 8	| dmDisplayOrientation
12	| dmDisplayFixedOutput
	+---

class _devicemodeW::<unnamed-tag>	size(4):
	+---
 0	| dmDisplayFlags
 0	| dmNup
	+---

class _devicemodeW	size(220):
	+---
 0	| dmDeviceName
64	| dmSpecVersion
66	| dmDriverVersion
68	| dmSize
70	| dmDriverExtra
72	| dmFields
  	| <unnamed-tag> <alignment member> (size=76)
  	| <unnamed-tag> <alignment member> (size=76)
76	| dmOrientation
78	| dmPaperSize
80	| dmPaperLength
82	| dmPaperWidth
84	| dmScale
86	| dmCopies
88	| dmDefaultSource
90	| dmPrintQuality
  	| <unnamed-tag> <alignment member> (size=76)
  	| <unnamed-tag> <alignment member> (size=76)
76	| _POINTL dmPosition
84	| dmDisplayOrientation
88	| dmDisplayFixedOutput
  	| <unnamed-tag> <alignment member> (size=76)
92	| dmColor
94	| dmDuplex
96	| dmYResolution
98	| dmTTOption
100	| dmCollate
102	| dmFormName
166	| dmLogPixels
168	| dmBitsPerPel
172	| dmPelsWidth
176	| dmPelsHeight
  	| <unnamed-tag> <alignment member> (size=180)
180	| dmDisplayFlags
180	| dmNup
184	| dmDisplayFrequency
188	| dmICMMethod
192	| dmICMIntent
196	| dmMediaType
200	| dmDitherType
204	| dmReserved1
208	| dmReserved2
212	| dmPanningWidth
216	| dmPanningHeight
	+---

class _DISPLAY_DEVICEA	size(424):
	+---
 0	| cb
 4	| DeviceName
36	| DeviceString
164	| StateFlags
168	| DeviceID
296	| DeviceKey
	+---

class _DISPLAY_DEVICEW	size(840):
	+---
 0	| cb
 4	| DeviceName
68	| DeviceString
324	| StateFlags
328	| DeviceID
584	| DeviceKey
	+---

class DISPLAYCONFIG_RATIONAL	size(8):
	+---
 0	| Numerator
 4	| Denominator
	+---

class DISPLAYCONFIG_2DREGION	size(8):
	+---
 0	| cx
 4	| cy
	+---

class DISPLAYCONFIG_VIDEO_SIGNAL_INFO::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| videoStandard (bitstart=0,nbits=16)
 0.	| vSyncFreqDivider (bitstart=16,nbits=6)
 0.	| reserved (bitstart=22,nbits=10)
	+---

class DISPLAYCONFIG_VIDEO_SIGNAL_INFO::<unnamed-tag>	size(4):
	+---
 0	| <unnamed-type-AdditionalSignalInfo> AdditionalSignalInfo
 0	| videoStandard
	+---

class DISPLAYCONFIG_VIDEO_SIGNAL_INFO	size(48):
	+---
 0	| pixelRate
 8	| DISPLAYCONFIG_RATIONAL hSyncFreq
16	| DISPLAYCONFIG_RATIONAL vSyncFreq
24	| DISPLAYCONFIG_2DREGION activeSize
32	| DISPLAYCONFIG_2DREGION totalSize
  	| <unnamed-tag> <alignment member> (size=40)
40	| <unnamed-type-AdditionalSignalInfo> AdditionalSignalInfo
40	| videoStandard
44	| DISPLAYCONFIG_SCANLINE_ORDERING scanLineOrdering
	+---

class DISPLAYCONFIG_SOURCE_MODE	size(20):
	+---
 0	| width
 4	| height
 8	| DISPLAYCONFIG_PIXELFORMAT pixelFormat
12	| _POINTL position
	+---

class DISPLAYCONFIG_TARGET_MODE	size(48):
	+---
 0	| DISPLAYCONFIG_VIDEO_SIGNAL_INFO targetVideoSignalInfo
	+---

class DISPLAYCONFIG_DESKTOP_IMAGE_INFO	size(40):
	+---
 0	| _POINTL PathSourceSize
 8	| _RECTL DesktopImageRegion
24	| _RECTL DesktopImageClip
	+---

class DISPLAYCONFIG_MODE_INFO::<unnamed-tag>	size(48):
	+---
 0	| DISPLAYCONFIG_TARGET_MODE targetMode
 0	| DISPLAYCONFIG_SOURCE_MODE sourceMode
 0	| DISPLAYCONFIG_DESKTOP_IMAGE_INFO desktopImageInfo
	+---

class DISPLAYCONFIG_MODE_INFO	size(64):
	+---
 0	| DISPLAYCONFIG_MODE_INFO_TYPE infoType
 4	| id
 8	| _LUID adapterId
  	| <unnamed-tag> <alignment member> (size=16)
16	| DISPLAYCONFIG_TARGET_MODE targetMode
16	| DISPLAYCONFIG_SOURCE_MODE sourceMode
16	| DISPLAYCONFIG_DESKTOP_IMAGE_INFO desktopImageInfo
	+---

class DISPLAYCONFIG_PATH_SOURCE_INFO::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| cloneGroupId (bitstart=0,nbits=16)
 0.	| sourceModeInfoIdx (bitstart=16,nbits=16)
	+---

class DISPLAYCONFIG_PATH_SOURCE_INFO::<unnamed-tag>	size(4):
	+---
 0	| modeInfoIdx
 0.	| cloneGroupId (bitstart=0,nbits=16)
 0.	| sourceModeInfoIdx (bitstart=16,nbits=16)
	+---

class DISPLAYCONFIG_PATH_SOURCE_INFO	size(20):
	+---
 0	| _LUID adapterId
 8	| id
  	| <unnamed-tag> <alignment member> (size=12)
12	| modeInfoIdx
  	| <unnamed-tag> <alignment member> (size=12)
12.	| cloneGroupId (bitstart=0,nbits=16)
12.	| sourceModeInfoIdx (bitstart=16,nbits=16)
  	| <unnamed-tag> <alignment member> (size=12)
16	| statusFlags
	+---

class DISPLAYCONFIG_PATH_TARGET_INFO::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| desktopModeInfoIdx (bitstart=0,nbits=16)
 0.	| targetModeInfoIdx (bitstart=16,nbits=16)
	+---

class DISPLAYCONFIG_PATH_TARGET_INFO::<unnamed-tag>	size(4):
	+---
 0	| modeInfoIdx
 0.	| desktopModeInfoIdx (bitstart=0,nbits=16)
 0.	| targetModeInfoIdx (bitstart=16,nbits=16)
	+---

class DISPLAYCONFIG_PATH_TARGET_INFO	size(48):
	+---
 0	| _LUID adapterId
 8	| id
  	| <unnamed-tag> <alignment member> (size=12)
12	| modeInfoIdx
  	| <unnamed-tag> <alignment member> (size=12)
12.	| desktopModeInfoIdx (bitstart=0,nbits=16)
12.	| targetModeInfoIdx (bitstart=16,nbits=16)
  	| <unnamed-tag> <alignment member> (size=12)
16	| DISPLAYCONFIG_VIDEO_OUTPUT_TECHNOLOGY outputTechnology
20	| DISPLAYCONFIG_ROTATION rotation
24	| DISPLAYCONFIG_SCALING scaling
28	| DISPLAYCONFIG_RATIONAL refreshRate
36	| DISPLAYCONFIG_SCANLINE_ORDERING scanLineOrdering
40	| targetAvailable
44	| statusFlags
	+---

class DISPLAYCONFIG_PATH_INFO	size(72):
	+---
 0	| DISPLAYCONFIG_PATH_SOURCE_INFO sourceInfo
20	| DISPLAYCONFIG_PATH_TARGET_INFO targetInfo
68	| flags
	+---

class DISPLAYCONFIG_DEVICE_INFO_HEADER	size(20):
	+---
 0	| DISPLAYCONFIG_DEVICE_INFO_TYPE type
 4	| size
 8	| _LUID adapterId
16	| id
	+---

class DISPLAYCONFIG_SOURCE_DEVICE_NAME	size(84):
	+---
 0	| DISPLAYCONFIG_DEVICE_INFO_HEADER header
20	| viewGdiDeviceName
	+---

class DISPLAYCONFIG_TARGET_DEVICE_NAME_FLAGS::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| friendlyNameFromEdid (bitstart=0,nbits=1)
 0.	| friendlyNameForced (bitstart=1,nbits=1)
 0.	| edidIdsValid (bitstart=2,nbits=1)
 0.	| reserved (bitstart=3,nbits=29)
	+---

class DISPLAYCONFIG_TARGET_DEVICE_NAME_FLAGS::<unnamed-tag>	size(4):
	+---
 0.	| friendlyNameFromEdid (bitstart=0,nbits=1)
 0.	| friendlyNameForced (bitstart=1,nbits=1)
 0.	| edidIdsValid (bitstart=2,nbits=1)
 0.	| reserved (bitstart=3,nbits=29)
 0	| value
	+---

class DISPLAYCONFIG_TARGET_DEVICE_NAME_FLAGS	size(4):
	+---
 0.	| friendlyNameFromEdid (bitstart=0,nbits=1)
 0.	| friendlyNameForced (bitstart=1,nbits=1)
 0.	| edidIdsValid (bitstart=2,nbits=1)
 0.	| reserved (bitstart=3,nbits=29)
 0	| value
	+---

class DISPLAYCONFIG_TARGET_DEVICE_NAME	size(420):
	+---
 0	| DISPLAYCONFIG_DEVICE_INFO_HEADER header
20	| DISPLAYCONFIG_TARGET_DEVICE_NAME_FLAGS flags
24	| DISPLAYCONFIG_VIDEO_OUTPUT_TECHNOLOGY outputTechnology
28	| edidManufactureId
30	| edidProductCodeId
32	| connectorInstance
36	| monitorFriendlyDeviceName
164	| monitorDevicePath
	+---

class DISPLAYCONFIG_TARGET_PREFERRED_MODE	size(80):
	+---
 0	| DISPLAYCONFIG_DEVICE_INFO_HEADER header
20	| width
24	| height
  	| <alignment member> (size=4)
32	| DISPLAYCONFIG_TARGET_MODE targetMode
	+---

class DISPLAYCONFIG_ADAPTER_NAME	size(276):
	+---
 0	| DISPLAYCONFIG_DEVICE_INFO_HEADER header
20	| adapterDevicePath
	+---

class DISPLAYCONFIG_TARGET_BASE_TYPE	size(24):
	+---
 0	| DISPLAYCONFIG_DEVICE_INFO_HEADER header
20	| DISPLAYCONFIG_VIDEO_OUTPUT_TECHNOLOGY baseOutputTechnology
	+---

class DISPLAYCONFIG_SET_TARGET_PERSISTENCE::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| bootPersistenceOn (bitstart=0,nbits=1)
 0.	| reserved (bitstart=1,nbits=31)
	+---

class DISPLAYCONFIG_SET_TARGET_PERSISTENCE::<unnamed-tag>	size(4):
	+---
 0.	| bootPersistenceOn (bitstart=0,nbits=1)
 0.	| reserved (bitstart=1,nbits=31)
 0	| value
	+---

class DISPLAYCONFIG_SET_TARGET_PERSISTENCE	size(24):
	+---
 0	| DISPLAYCONFIG_DEVICE_INFO_HEADER header
  	| <unnamed-tag> <alignment member> (size=20)
  	| <unnamed-tag> <alignment member> (size=20)
20.	| bootPersistenceOn (bitstart=0,nbits=1)
20.	| reserved (bitstart=1,nbits=31)
  	| <unnamed-tag> <alignment member> (size=20)
20	| value
	+---

class DISPLAYCONFIG_SUPPORT_VIRTUAL_RESOLUTION::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0.	| disableMonitorVirtualResolution (bitstart=0,nbits=1)
 0.	| reserved (bitstart=1,nbits=31)
	+---

class DISPLAYCONFIG_SUPPORT_VIRTUAL_RESOLUTION::<unnamed-tag>	size(4):
	+---
 0.	| disableMonitorVirtualResolution (bitstart=0,nbits=1)
 0.	| reserved (bitstart=1,nbits=31)
 0	| value
	+---

class DISPLAYCONFIG_SUPPORT_VIRTUAL_RESOLUTION	size(24):
	+---
 0	| DISPLAYCONFIG_DEVICE_INFO_HEADER header
  	| <unnamed-tag> <alignment member> (size=20)
  	| <unnamed-tag> <alignment member> (size=20)
20.	| disableMonitorVirtualResolution (bitstart=0,nbits=1)
20.	| reserved (bitstart=1,nbits=31)
  	| <unnamed-tag> <alignment member> (size=20)
20	| value
	+---

class _RGNDATAHEADER	size(32):
	+---
 0	| dwSize
 4	| iType
 8	| nCount
12	| nRgnSize
16	| tagRECT rcBound
	+---

class _RGNDATA	size(36):
	+---
 0	| _RGNDATAHEADER rdh
32	| Buffer
  	| <alignment member> (size=3)
	+---

class _ABC	size(12):
	+---
 0	| abcA
 4	| abcB
 8	| abcC
	+---

class _ABCFLOAT	size(12):
	+---
 0	| abcfA
 4	| abcfB
 8	| abcfC
	+---

class _OUTLINETEXTMETRICA	size(212):
	+---
 0	| otmSize
 4	| tagTEXTMETRICA otmTextMetrics
60	| otmFiller
61	| tagPANOSE otmPanoseNumber
  	| <alignment member> (size=1)
72	| otmfsSelection
76	| otmfsType
80	| otmsCharSlopeRise
84	| otmsCharSlopeRun
88	| otmItalicAngle
92	| otmEMSquare
96	| otmAscent
100	| otmDescent
104	| otmLineGap
108	| otmsCapEmHeight
112	| otmsXHeight
116	| tagRECT otmrcFontBox
132	| otmMacAscent
136	| otmMacDescent
140	| otmMacLineGap
144	| otmusMinimumPPEM
148	| tagPOINT otmptSubscriptSize
156	| tagPOINT otmptSubscriptOffset
164	| tagPOINT otmptSuperscriptSize
172	| tagPOINT otmptSuperscriptOffset
180	| otmsStrikeoutSize
184	| otmsStrikeoutPosition
188	| otmsUnderscoreSize
192	| otmsUnderscorePosition
196	| otmpFamilyName
200	| otmpFaceName
204	| otmpStyleName
208	| otmpFullName
	+---

class _OUTLINETEXTMETRICW	size(216):
	+---
 0	| otmSize
 4	| tagTEXTMETRICW otmTextMetrics
64	| otmFiller
65	| tagPANOSE otmPanoseNumber
  	| <alignment member> (size=1)
76	| otmfsSelection
80	| otmfsType
84	| otmsCharSlopeRise
88	| otmsCharSlopeRun
92	| otmItalicAngle
96	| otmEMSquare
100	| otmAscent
104	| otmDescent
108	| otmLineGap
112	| otmsCapEmHeight
116	| otmsXHeight
120	| tagRECT otmrcFontBox
136	| otmMacAscent
140	| otmMacDescent
144	| otmMacLineGap
148	| otmusMinimumPPEM
152	| tagPOINT otmptSubscriptSize
160	| tagPOINT otmptSubscriptOffset
168	| tagPOINT otmptSuperscriptSize
176	| tagPOINT otmptSuperscriptOffset
184	| otmsStrikeoutSize
188	| otmsStrikeoutPosition
192	| otmsUnderscoreSize
196	| otmsUnderscorePosition
200	| otmpFamilyName
204	| otmpFaceName
208	| otmpStyleName
212	| otmpFullName
	+---

class tagPOLYTEXTA	size(40):
	+---
 0	| x
 4	| y
 8	| n
12	| lpstr
16	| uiFlags
20	| tagRECT rcl
36	| pdx
	+---

class tagPOLYTEXTW	size(40):
	+---
 0	| x
 4	| y
 8	| n
12	| lpstr
16	| uiFlags
20	| tagRECT rcl
36	| pdx
	+---

class _FIXED	size(4):
	+---
 0	| fract
 2	| value
	+---

class _MAT2	size(16):
	+---
 0	| _FIXED eM11
 4	| _FIXED eM12
 8	| _FIXED eM21
12	| _FIXED eM22
	+---

class _GLYPHMETRICS	size(20):
	+---
 0	| gmBlackBoxX
 4	| gmBlackBoxY
 8	| tagPOINT gmptGlyphOrigin
16	| gmCellIncX
18	| gmCellIncY
	+---

class tagPOINTFX	size(8):
	+---
 0	| _FIXED x
 4	| _FIXED y
	+---

class tagTTPOLYCURVE	size(12):
	+---
 0	| wType
 2	| cpfx
 4	| apfx
	+---

class tagTTPOLYGONHEADER	size(16):
	+---
 0	| cb
 4	| dwType
 8	| tagPOINTFX pfxStart
	+---

class tagGCP_RESULTSA	size(36):
	+---
 0	| lStructSize
 4	| lpOutString
 8	| lpOrder
12	| lpDx
16	| lpCaretPos
20	| lpClass
24	| lpGlyphs
28	| nGlyphs
32	| nMaxFit
	+---

class tagGCP_RESULTSW	size(36):
	+---
 0	| lStructSize
 4	| lpOutString
 8	| lpOrder
12	| lpDx
16	| lpCaretPos
20	| lpClass
24	| lpGlyphs
28	| nGlyphs
32	| nMaxFit
	+---

class _RASTERIZER_STATUS	size(6):
	+---
 0	| nSize
 2	| wFlags
 4	| nLanguageID
	+---

class tagPIXELFORMATDESCRIPTOR	size(40):
	+---
 0	| nSize
 2	| nVersion
 4	| dwFlags
 8	| iPixelType
 9	| cColorBits
10	| cRedBits
11	| cRedShift
12	| cGreenBits
13	| cGreenShift
14	| cBlueBits
15	| cBlueShift
16	| cAlphaBits
17	| cAlphaShift
18	| cAccumBits
19	| cAccumRedBits
20	| cAccumGreenBits
21	| cAccumBlueBits
22	| cAccumAlphaBits
23	| cDepthBits
24	| cStencilBits
25	| cAuxBuffers
26	| iLayerType
27	| bReserved
28	| dwLayerMask
32	| dwVisibleMask
36	| dwDamageMask
	+---

class tagWCRANGE	size(4):
	+---
 0	| wcLow
 2	| cGlyphs
	+---

class tagGLYPHSET	size(20):
	+---
 0	| cbThis
 4	| flAccel
 8	| cGlyphsSupported
12	| cRanges
16	| ranges
	+---

class tagDESIGNVECTOR	size(72):
	+---
 0	| dvReserved
 4	| dvNumAxes
 8	| dvValues
	+---

class tagAXISINFOA	size(24):
	+---
 0	| axMinValue
 4	| axMaxValue
 8	| axAxisName
	+---

class tagAXISINFOW	size(40):
	+---
 0	| axMinValue
 4	| axMaxValue
 8	| axAxisName
	+---

class tagAXESLISTA	size(392):
	+---
 0	| axlReserved
 4	| axlNumAxes
 8	| axlAxisInfo
	+---

class tagAXESLISTW	size(648):
	+---
 0	| axlReserved
 4	| axlNumAxes
 8	| axlAxisInfo
	+---

class tagENUMLOGFONTEXDVA	size(260):
	+---
 0	| tagENUMLOGFONTEXA elfEnumLogfontEx
188	| tagDESIGNVECTOR elfDesignVector
	+---

class tagENUMLOGFONTEXDVW	size(420):
	+---
 0	| tagENUMLOGFONTEXW elfEnumLogfontEx
348	| tagDESIGNVECTOR elfDesignVector
	+---

class tagENUMTEXTMETRICA	size(488):
	+---
 0	| tagNEWTEXTMETRICEXA etmNewTextMetricEx
96	| tagAXESLISTA etmAxesList
	+---

class tagENUMTEXTMETRICW	size(748):
	+---
 0	| tagNEWTEXTMETRICEXW etmNewTextMetricEx
100	| tagAXESLISTW etmAxesList
	+---

class _TRIVERTEX	size(16):
	+---
 0	| x
 4	| y
 8	| Red
10	| Green
12	| Blue
14	| Alpha
	+---

class _GRADIENT_TRIANGLE	size(12):
	+---
 0	| Vertex1
 4	| Vertex2
 8	| Vertex3
	+---

class _GRADIENT_RECT	size(8):
	+---
 0	| UpperLeft
 4	| LowerRight
	+---

class _BLENDFUNCTION	size(4):
	+---
 0	| BlendOp
 1	| BlendFlags
 2	| SourceConstantAlpha
 3	| AlphaFormat
	+---

class tagDIBSECTION	size(84):
	+---
 0	| tagBITMAP dsBm
24	| tagBITMAPINFOHEADER dsBmih
64	| dsBitfields
76	| dshSection
80	| dsOffset
	+---

class tagCOLORADJUSTMENT	size(24):
	+---
 0	| caSize
 2	| caFlags
 4	| caIlluminantIndex
 6	| caRedGamma
 8	| caGreenGamma
10	| caBlueGamma
12	| caReferenceBlack
14	| caReferenceWhite
16	| caContrast
18	| caBrightness
20	| caColorfulness
22	| caRedGreenTint
	+---

class _DOCINFOA	size(20):
	+---
 0	| cbSize
 4	| lpszDocName
 8	| lpszOutput
12	| lpszDatatype
16	| fwType
	+---

class _DOCINFOW	size(20):
	+---
 0	| cbSize
 4	| lpszDocName
 8	| lpszOutput
12	| lpszDatatype
16	| fwType
	+---

class tagKERNINGPAIR	size(8):
	+---
 0	| wFirst
 2	| wSecond
 4	| iKernAmount
	+---

class tagEMR	size(8):
	+---
 0	| iType
 4	| nSize
	+---

class tagEMRTEXT	size(40):
	+---
 0	| _POINTL ptlReference
 8	| nChars
12	| offString
16	| fOptions
20	| _RECTL rcl
36	| offDx
	+---

class tagABORTPATH	size(8):
	+---
 0	| tagEMR emr
	+---

class tagEMRSELECTCLIPPATH	size(12):
	+---
 0	| tagEMR emr
 8	| iMode
	+---

class tagEMRSETMITERLIMIT	size(12):
	+---
 0	| tagEMR emr
 8	| eMiterLimit
	+---

class tagEMRRESTOREDC	size(12):
	+---
 0	| tagEMR emr
 8	| iRelative
	+---

class tagEMRSETARCDIRECTION	size(12):
	+---
 0	| tagEMR emr
 8	| iArcDirection
	+---

class tagEMRSETMAPPERFLAGS	size(12):
	+---
 0	| tagEMR emr
 8	| dwFlags
	+---

class tagEMRSETTEXTCOLOR	size(12):
	+---
 0	| tagEMR emr
 8	| crColor
	+---

class tagEMRSELECTOBJECT	size(12):
	+---
 0	| tagEMR emr
 8	| ihObject
	+---

class tagEMRSELECTPALETTE	size(12):
	+---
 0	| tagEMR emr
 8	| ihPal
	+---

class tagEMRRESIZEPALETTE	size(16):
	+---
 0	| tagEMR emr
 8	| ihPal
12	| cEntries
	+---

class tagEMRSETPALETTEENTRIES	size(24):
	+---
 0	| tagEMR emr
 8	| ihPal
12	| iStart
16	| cEntries
20	| aPalEntries
	+---

class tagEMRSETCOLORADJUSTMENT	size(32):
	+---
 0	| tagEMR emr
 8	| tagCOLORADJUSTMENT ColorAdjustment
	+---

class tagEMRGDICOMMENT	size(16):
	+---
 0	| tagEMR emr
 8	| cbData
12	| Data
  	| <alignment member> (size=3)
	+---

class tagEMREOF	size(20):
	+---
 0	| tagEMR emr
 8	| nPalEntries
12	| offPalEntries
16	| nSizeLast
	+---

class tagEMRLINETO	size(16):
	+---
 0	| tagEMR emr
 8	| _POINTL ptl
	+---

class tagEMROFFSETCLIPRGN	size(16):
	+---
 0	| tagEMR emr
 8	| _POINTL ptlOffset
	+---

class tagEMRFILLPATH	size(24):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
	+---

class tagEMREXCLUDECLIPRECT	size(24):
	+---
 0	| tagEMR emr
 8	| _RECTL rclClip
	+---

class tagEMRSETVIEWPORTORGEX	size(16):
	+---
 0	| tagEMR emr
 8	| _POINTL ptlOrigin
	+---

class tagEMRSETVIEWPORTEXTEX	size(16):
	+---
 0	| tagEMR emr
 8	| tagSIZE szlExtent
	+---

class tagEMRSCALEVIEWPORTEXTEX	size(24):
	+---
 0	| tagEMR emr
 8	| xNum
12	| xDenom
16	| yNum
20	| yDenom
	+---

class tagEMRSETWORLDTRANSFORM	size(32):
	+---
 0	| tagEMR emr
 8	| tagXFORM xform
	+---

class tagEMRMODIFYWORLDTRANSFORM	size(36):
	+---
 0	| tagEMR emr
 8	| tagXFORM xform
32	| iMode
	+---

class tagEMRSETPIXELV	size(20):
	+---
 0	| tagEMR emr
 8	| _POINTL ptlPixel
16	| crColor
	+---

class tagEMREXTFLOODFILL	size(24):
	+---
 0	| tagEMR emr
 8	| _POINTL ptlStart
16	| crColor
20	| iMode
	+---

class tagEMRELLIPSE	size(24):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBox
	+---

class tagEMRROUNDRECT	size(32):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBox
24	| tagSIZE szlCorner
	+---

class tagEMRARC	size(40):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBox
24	| _POINTL ptlStart
32	| _POINTL ptlEnd
	+---

class tagEMRANGLEARC	size(28):
	+---
 0	| tagEMR emr
 8	| _POINTL ptlCenter
16	| nRadius
20	| eStartAngle
24	| eSweepAngle
	+---

class tagEMRPOLYLINE	size(36):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| cptl
28	| aptl
	+---

class tagEMRPOLYLINE16	size(32):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| cpts
28	| apts
	+---

class tagEMRPOLYDRAW	size(40):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| cptl
28	| aptl
36	| abTypes
  	| <alignment member> (size=3)
	+---

class tagEMRPOLYDRAW16	size(36):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| cpts
28	| apts
32	| abTypes
  	| <alignment member> (size=3)
	+---

class tagEMRPOLYPOLYLINE	size(44):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| nPolys
28	| cptl
32	| aPolyCounts
36	| aptl
	+---

class tagEMRPOLYPOLYLINE16	size(40):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| nPolys
28	| cpts
32	| aPolyCounts
36	| apts
	+---

class tagEMRINVERTRGN	size(32):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| cbRgnData
28	| RgnData
  	| <alignment member> (size=3)
	+---

class tagEMRFILLRGN	size(36):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| cbRgnData
28	| ihBrush
32	| RgnData
  	| <alignment member> (size=3)
	+---

class tagEMRFRAMERGN	size(44):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| cbRgnData
28	| ihBrush
32	| tagSIZE szlStroke
40	| RgnData
  	| <alignment member> (size=3)
	+---

class tagEMREXTSELECTCLIPRGN	size(20):
	+---
 0	| tagEMR emr
 8	| cbRgnData
12	| iMode
16	| RgnData
  	| <alignment member> (size=3)
	+---

class tagEMREXTTEXTOUTA	size(76):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| iGraphicsMode
28	| exScale
32	| eyScale
36	| tagEMRTEXT emrtext
	+---

class tagEMRPOLYTEXTOUTA	size(80):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| iGraphicsMode
28	| exScale
32	| eyScale
36	| cStrings
40	| aemrtext
	+---

class tagEMRBITBLT	size(100):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| xDest
28	| yDest
32	| cxDest
36	| cyDest
40	| dwRop
44	| xSrc
48	| ySrc
52	| tagXFORM xformSrc
76	| crBkColorSrc
80	| iUsageSrc
84	| offBmiSrc
88	| cbBmiSrc
92	| offBitsSrc
96	| cbBitsSrc
	+---

class tagEMRSTRETCHBLT	size(108):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| xDest
28	| yDest
32	| cxDest
36	| cyDest
40	| dwRop
44	| xSrc
48	| ySrc
52	| tagXFORM xformSrc
76	| crBkColorSrc
80	| iUsageSrc
84	| offBmiSrc
88	| cbBmiSrc
92	| offBitsSrc
96	| cbBitsSrc
100	| cxSrc
104	| cySrc
	+---

class tagEMRMASKBLT	size(128):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| xDest
28	| yDest
32	| cxDest
36	| cyDest
40	| dwRop
44	| xSrc
48	| ySrc
52	| tagXFORM xformSrc
76	| crBkColorSrc
80	| iUsageSrc
84	| offBmiSrc
88	| cbBmiSrc
92	| offBitsSrc
96	| cbBitsSrc
100	| xMask
104	| yMask
108	| iUsageMask
112	| offBmiMask
116	| cbBmiMask
120	| offBitsMask
124	| cbBitsMask
	+---

class tagEMRPLGBLT	size(140):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| aptlDest
48	| xSrc
52	| ySrc
56	| cxSrc
60	| cySrc
64	| tagXFORM xformSrc
88	| crBkColorSrc
92	| iUsageSrc
96	| offBmiSrc
100	| cbBmiSrc
104	| offBitsSrc
108	| cbBitsSrc
112	| xMask
116	| yMask
120	| iUsageMask
124	| offBmiMask
128	| cbBmiMask
132	| offBitsMask
136	| cbBitsMask
	+---

class tagEMRSETDIBITSTODEVICE	size(76):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| xDest
28	| yDest
32	| xSrc
36	| ySrc
40	| cxSrc
44	| cySrc
48	| offBmiSrc
52	| cbBmiSrc
56	| offBitsSrc
60	| cbBitsSrc
64	| iUsageSrc
68	| iStartScan
72	| cScans
	+---

class tagEMRSTRETCHDIBITS	size(80):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| xDest
28	| yDest
32	| xSrc
36	| ySrc
40	| cxSrc
44	| cySrc
48	| offBmiSrc
52	| cbBmiSrc
56	| offBitsSrc
60	| cbBitsSrc
64	| iUsageSrc
68	| dwRop
72	| cxDest
76	| cyDest
	+---

class tagEMREXTCREATEFONTINDIRECTW	size(332):
	+---
 0	| tagEMR emr
 8	| ihFont
12	| tagEXTLOGFONTW elfw
	+---

class tagEMRCREATEPALETTE	size(20):
	+---
 0	| tagEMR emr
 8	| ihPal
12	| tagLOGPALETTE lgpl
	+---

class tagEMRCREATEPEN	size(28):
	+---
 0	| tagEMR emr
 8	| ihPen
12	| tagLOGPEN lopn
	+---

class tagEMREXTCREATEPEN	size(56):
	+---
 0	| tagEMR emr
 8	| ihPen
12	| offBmi
16	| cbBmi
20	| offBits
24	| cbBits
28	| tagEXTLOGPEN32 elp
	+---

class tagEMRCREATEBRUSHINDIRECT	size(24):
	+---
 0	| tagEMR emr
 8	| ihBrush
12	| tagLOGBRUSH32 lb
	+---

class tagEMRCREATEMONOBRUSH	size(32):
	+---
 0	| tagEMR emr
 8	| ihBrush
12	| iUsage
16	| offBmi
20	| cbBmi
24	| offBits
28	| cbBits
	+---

class tagEMRCREATEDIBPATTERNBRUSHPT	size(32):
	+---
 0	| tagEMR emr
 8	| ihBrush
12	| iUsage
16	| offBmi
20	| cbBmi
24	| offBits
28	| cbBits
	+---

class tagEMRFORMAT	size(16):
	+---
 0	| dSignature
 4	| nVersion
 8	| cbData
12	| offData
	+---

class tagEMRGLSRECORD	size(16):
	+---
 0	| tagEMR emr
 8	| cbData
12	| Data
  	| <alignment member> (size=3)
	+---

class tagEMRGLSBOUNDEDRECORD	size(32):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| cbData
28	| Data
  	| <alignment member> (size=3)
	+---

class tagEMRPIXELFORMAT	size(48):
	+---
 0	| tagEMR emr
 8	| tagPIXELFORMATDESCRIPTOR pfd
	+---

class tagEMRCREATECOLORSPACE	size(340):
	+---
 0	| tagEMR emr
 8	| ihCS
12	| tagLOGCOLORSPACEA lcs
	+---

class tagEMRSETCOLORSPACE	size(12):
	+---
 0	| tagEMR emr
 8	| ihCS
	+---

class tagEMREXTESCAPE	size(20):
	+---
 0	| tagEMR emr
 8	| iEscape
12	| cbEscData
16	| EscData
  	| <alignment member> (size=3)
	+---

class tagEMRNAMEDESCAPE	size(24):
	+---
 0	| tagEMR emr
 8	| iEscape
12	| cbDriver
16	| cbEscData
20	| EscData
  	| <alignment member> (size=3)
	+---

class tagEMRSETICMPROFILE	size(24):
	+---
 0	| tagEMR emr
 8	| dwFlags
12	| cbName
16	| cbData
20	| Data
  	| <alignment member> (size=3)
	+---

class tagEMRCREATECOLORSPACEW	size(612):
	+---
 0	| tagEMR emr
 8	| ihCS
12	| tagLOGCOLORSPACEW lcs
600	| dwFlags
604	| cbData
608	| Data
  	| <alignment member> (size=3)
	+---

class tagCOLORMATCHTOTARGET	size(28):
	+---
 0	| tagEMR emr
 8	| dwAction
12	| dwFlags
16	| cbName
20	| cbData
24	| Data
  	| <alignment member> (size=3)
	+---

class tagCOLORCORRECTPALETTE	size(24):
	+---
 0	| tagEMR emr
 8	| ihPalette
12	| nFirstEntry
16	| nPalEntries
20	| nReserved
	+---

class tagEMRALPHABLEND	size(108):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| xDest
28	| yDest
32	| cxDest
36	| cyDest
40	| dwRop
44	| xSrc
48	| ySrc
52	| tagXFORM xformSrc
76	| crBkColorSrc
80	| iUsageSrc
84	| offBmiSrc
88	| cbBmiSrc
92	| offBitsSrc
96	| cbBitsSrc
100	| cxSrc
104	| cySrc
	+---

class tagEMRGRADIENTFILL	size(52):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| nVer
28	| nTri
32	| ulMode
36	| Ver
	+---

class tagEMRTRANSPARENTBLT	size(108):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| xDest
28	| yDest
32	| cxDest
36	| cyDest
40	| dwRop
44	| xSrc
48	| ySrc
52	| tagXFORM xformSrc
76	| crBkColorSrc
80	| iUsageSrc
84	| offBmiSrc
88	| cbBmiSrc
92	| offBitsSrc
96	| cbBitsSrc
100	| cxSrc
104	| cySrc
	+---

class _POINTFLOAT	size(8):
	+---
 0	| x
 4	| y
	+---

class _GLYPHMETRICSFLOAT	size(24):
	+---
 0	| gmfBlackBoxX
 4	| gmfBlackBoxY
 8	| _POINTFLOAT gmfptGlyphOrigin
16	| gmfCellIncX
20	| gmfCellIncY
	+---

class tagLAYERPLANEDESCRIPTOR	size(32):
	+---
 0	| nSize
 2	| nVersion
 4	| dwFlags
 8	| iPixelType
 9	| cColorBits
10	| cRedBits
11	| cRedShift
12	| cGreenBits
13	| cGreenShift
14	| cBlueBits
15	| cBlueShift
16	| cAlphaBits
17	| cAlphaShift
18	| cAccumBits
19	| cAccumRedBits
20	| cAccumGreenBits
21	| cAccumBlueBits
22	| cAccumAlphaBits
23	| cDepthBits
24	| cStencilBits
25	| cAuxBuffers
26	| iLayerPlane
27	| bReserved
28	| crTransparent
	+---

class _WGLSWAP	size(8):
	+---
 0	| hdc
 4	| uiFlags
	+---

class tagCBT_CREATEWNDA	size(8):
	+---
 0	| lpcs
 4	| hwndInsertAfter
	+---

class tagCBT_CREATEWNDW	size(8):
	+---
 0	| lpcs
 4	| hwndInsertAfter
	+---

class tagCBTACTIVATESTRUCT	size(8):
	+---
 0	| fMouse
 4	| hWndActive
	+---

class tagWTSSESSION_NOTIFICATION	size(8):
	+---
 0	| cbSize
 4	| dwSessionId
	+---

class <unnamed-tag>	size(20):
	+---
 0	| hwnd
 4	| tagRECT rc
	+---

class tagEVENTMSG	size(20):
	+---
 0	| message
 4	| paramL
 8	| paramH
12	| time
16	| hwnd
	+---

class tagCWPSTRUCT	size(16):
	+---
 0	| lParam
 4	| wParam
 8	| message
12	| hwnd
	+---

class tagCWPRETSTRUCT	size(20):
	+---
 0	| lResult
 4	| lParam
 8	| wParam
12	| message
16	| hwnd
	+---

class tagKBDLLHOOKSTRUCT	size(20):
	+---
 0	| vkCode
 4	| scanCode
 8	| flags
12	| time
16	| dwExtraInfo
	+---

class tagMSLLHOOKSTRUCT	size(24):
	+---
 0	| tagPOINT pt
 8	| mouseData
12	| flags
16	| time
20	| dwExtraInfo
	+---

class tagDEBUGHOOKINFO	size(20):
	+---
 0	| idThread
 4	| idThreadInstaller
 8	| lParam
12	| wParam
16	| code
	+---

class tagMOUSEHOOKSTRUCT	size(20):
	+---
 0	| tagPOINT pt
 8	| hwnd
12	| wHitTestCode
16	| dwExtraInfo
	+---

class tagMOUSEHOOKSTRUCTEX	size(24):
	+---
 0	| +--- (base class tagMOUSEHOOKSTRUCT)
 0	| | tagPOINT pt
 8	| | hwnd
12	| | wHitTestCode
16	| | dwExtraInfo
	| +---
20	| mouseData
	+---

class tagHARDWAREHOOKSTRUCT	size(16):
	+---
 0	| hwnd
 4	| message
 8	| wParam
12	| lParam
	+---

class tagMOUSEMOVEPOINT	size(16):
	+---
 0	| x
 4	| y
 8	| time
12	| dwExtraInfo
	+---

class tagUSEROBJECTFLAGS	size(12):
	+---
 0	| fInherit
 4	| fReserved
 8	| dwFlags
	+---

class tagWNDCLASSEXA	size(48):
	+---
 0	| cbSize
 4	| style
 8	| lpfnWndProc
12	| cbClsExtra
16	| cbWndExtra
20	| hInstance
24	| hIcon
28	| hCursor
32	| hbrBackground
36	| lpszMenuName
40	| lpszClassName
44	| hIconSm
	+---

class tagWNDCLASSEXW	size(48):
	+---
 0	| cbSize
 4	| style
 8	| lpfnWndProc
12	| cbClsExtra
16	| cbWndExtra
20	| hInstance
24	| hIcon
28	| hCursor
32	| hbrBackground
36	| lpszMenuName
40	| lpszClassName
44	| hIconSm
	+---

class tagWNDCLASSA	size(40):
	+---
 0	| style
 4	| lpfnWndProc
 8	| cbClsExtra
12	| cbWndExtra
16	| hInstance
20	| hIcon
24	| hCursor
28	| hbrBackground
32	| lpszMenuName
36	| lpszClassName
	+---

class tagWNDCLASSW	size(40):
	+---
 0	| style
 4	| lpfnWndProc
 8	| cbClsExtra
12	| cbWndExtra
16	| hInstance
20	| hIcon
24	| hCursor
28	| hbrBackground
32	| lpszMenuName
36	| lpszClassName
	+---

class tagMSG	size(28):
	+---
 0	| hwnd
 4	| message
 8	| wParam
12	| lParam
16	| time
20	| tagPOINT pt
	+---

class tagMINMAXINFO	size(40):
	+---
 0	| tagPOINT ptReserved
 8	| tagPOINT ptMaxSize
16	| tagPOINT ptMaxPosition
24	| tagPOINT ptMinTrackSize
32	| tagPOINT ptMaxTrackSize
	+---

class tagCOPYDATASTRUCT	size(12):
	+---
 0	| dwData
 4	| cbData
 8	| lpData
	+---

class tagMDINEXTMENU	size(12):
	+---
 0	| hmenuIn
 4	| hmenuNext
 8	| hwndNext
	+---

class <unnamed-tag>	size(24):
	+---
 0	| _GUID PowerSetting
16	| DataLength
20	| Data
  	| <alignment member> (size=3)
	+---

class tagWINDOWPOS	size(28):
	+---
 0	| hwnd
 4	| hwndInsertAfter
 8	| x
12	| y
16	| cx
20	| cy
24	| flags
	+---

class tagNCCALCSIZE_PARAMS	size(52):
	+---
 0	| rgrc
48	| lppos
	+---

class tagTRACKMOUSEEVENT	size(16):
	+---
 0	| cbSize
 4	| dwFlags
 8	| hwndTrack
12	| dwHoverTime
	+---

class tagACCEL	size(6):
	+---
 0	| fVirt
  	| <alignment member> (size=1)
 2	| key
 4	| cmd
	+---

class tagPAINTSTRUCT	size(64):
	+---
 0	| hdc
 4	| fErase
 8	| tagRECT rcPaint
24	| fRestore
28	| fIncUpdate
32	| rgbReserved
	+---

class tagCREATESTRUCTA	size(48):
	+---
 0	| lpCreateParams
 4	| hInstance
 8	| hMenu
12	| hwndParent
16	| cy
20	| cx
24	| y
28	| x
32	| style
36	| lpszName
40	| lpszClass
44	| dwExStyle
	+---

class tagCREATESTRUCTW	size(48):
	+---
 0	| lpCreateParams
 4	| hInstance
 8	| hMenu
12	| hwndParent
16	| cy
20	| cx
24	| y
28	| x
32	| style
36	| lpszName
40	| lpszClass
44	| dwExStyle
	+---

class tagWINDOWPLACEMENT	size(44):
	+---
 0	| length
 4	| flags
 8	| showCmd
12	| tagPOINT ptMinPosition
20	| tagPOINT ptMaxPosition
28	| tagRECT rcNormalPosition
	+---

class tagNMHDR	size(12):
	+---
 0	| hwndFrom
 4	| idFrom
 8	| code
	+---

class tagSTYLESTRUCT	size(8):
	+---
 0	| styleOld
 4	| styleNew
	+---

class tagMEASUREITEMSTRUCT	size(24):
	+---
 0	| CtlType
 4	| CtlID
 8	| itemID
12	| itemWidth
16	| itemHeight
20	| itemData
	+---

class tagDRAWITEMSTRUCT	size(48):
	+---
 0	| CtlType
 4	| CtlID
 8	| itemID
12	| itemAction
16	| itemState
20	| hwndItem
24	| hDC
28	| tagRECT rcItem
44	| itemData
	+---

class tagDELETEITEMSTRUCT	size(20):
	+---
 0	| CtlType
 4	| CtlID
 8	| itemID
12	| hwndItem
16	| itemData
	+---

class tagCOMPAREITEMSTRUCT	size(32):
	+---
 0	| CtlType
 4	| CtlID
 8	| hwndItem
12	| itemID1
16	| itemData1
20	| itemID2
24	| itemData2
28	| dwLocaleId
	+---

class <unnamed-tag>	size(20):
	+---
 0	| cbSize
 4	| hdesk
 8	| hwnd
12	| _LUID luid
	+---

class tagUPDATELAYEREDWINDOWINFO	size(40):
	+---
 0	| cbSize
 4	| hdcDst
 8	| pptDst
12	| psize
16	| hdcSrc
20	| pptSrc
24	| crKey
28	| pblend
32	| dwFlags
36	| prcDirty
	+---

class <unnamed-tag>	size(20):
	+---
 0	| cbSize
 4	| hwnd
 8	| dwFlags
12	| uCount
16	| dwTimeout
	+---

class <unnamed-tag>	size(18):
	+---
 0	| style
 4	| dwExtendedStyle
 8	| cdit
10	| x
12	| y
14	| cx
16	| cy
	+---

class <unnamed-tag>	size(18):
	+---
 0	| style
 4	| dwExtendedStyle
 8	| x
10	| y
12	| cx
14	| cy
16	| id
	+---

class tagMOUSEINPUT	size(24):
	+---
 0	| dx
 4	| dy
 8	| mouseData
12	| dwFlags
16	| time
20	| dwExtraInfo
	+---

class tagKEYBDINPUT	size(16):
	+---
 0	| wVk
 2	| wScan
 4	| dwFlags
 8	| time
12	| dwExtraInfo
	+---

class tagHARDWAREINPUT	size(8):
	+---
 0	| uMsg
 4	| wParamL
 6	| wParamH
	+---

class tagINPUT::<unnamed-tag>	size(24):
	+---
 0	| tagMOUSEINPUT mi
 0	| tagKEYBDINPUT ki
 0	| tagHARDWAREINPUT hi
	+---

class tagINPUT	size(28):
	+---
 0	| type
  	| <unnamed-tag> <alignment member> (size=4)
 4	| tagMOUSEINPUT mi
 4	| tagKEYBDINPUT ki
 4	| tagHARDWAREINPUT hi
	+---

class HTOUCHINPUT__	size(4):
	+---
 0	| unused
	+---

class tagTOUCHINPUT	size(40):
	+---
 0	| x
 4	| y
 8	| hSource
12	| dwID
16	| dwFlags
20	| dwMask
24	| dwTime
28	| dwExtraInfo
32	| cxContact
36	| cyContact
	+---

class tagPOINTER_INFO	size(88):
	+---
 0	| pointerType
 4	| pointerId
 8	| frameId
12	| pointerFlags
16	| sourceDevice
20	| hwndTarget
24	| tagPOINT ptPixelLocation
32	| tagPOINT ptHimetricLocation
40	| tagPOINT ptPixelLocationRaw
48	| tagPOINT ptHimetricLocationRaw
56	| dwTime
60	| historyCount
64	| InputData
68	| dwKeyStates
72	| PerformanceCount
80	| tagPOINTER_BUTTON_CHANGE_TYPE ButtonChangeType
  	| <alignment member> (size=4)
	+---

class tagPOINTER_TOUCH_INFO	size(136):
	+---
 0	| tagPOINTER_INFO pointerInfo
88	| touchFlags
92	| touchMask
96	| tagRECT rcContact
112	| tagRECT rcContactRaw
128	| orientation
132	| pressure
	+---

class tagPOINTER_PEN_INFO	size(112):
	+---
 0	| tagPOINTER_INFO pointerInfo
88	| penFlags
92	| penMask
96	| pressure
100	| rotation
104	| tiltX
108	| tiltY
	+---

class tagUSAGE_PROPERTIES	size(32):
	+---
 0	| level
 2	| page
 4	| usage
  	| <alignment member> (size=2)
 8	| logicalMinimum
12	| logicalMaximum
16	| unit
18	| exponent
20	| count
  	| <alignment member> (size=3)
24	| physicalMinimum
28	| physicalMaximum
	+---

class tagPOINTER_TYPE_INFO::<unnamed-tag>	size(136):
	+---
 0	| tagPOINTER_TOUCH_INFO touchInfo
 0	| tagPOINTER_PEN_INFO penInfo
	+---

class tagPOINTER_TYPE_INFO	size(144):
	+---
 0	| type
  	| <alignment member> (size=4)
  	| <unnamed-tag> <alignment member> (size=8)
 8	| tagPOINTER_TOUCH_INFO touchInfo
 8	| tagPOINTER_PEN_INFO penInfo
	+---

class tagINPUT_INJECTION_VALUE	size(12):
	+---
 0	| page
 2	| usage
 4	| value
 8	| index
  	| <alignment member> (size=2)
	+---

class tagTOUCH_HIT_TESTING_PROXIMITY_EVALUATION	size(12):
	+---
 0	| score
  	| <alignment member> (size=2)
 4	| tagPOINT adjustedPoint
	+---

class tagTOUCH_HIT_TESTING_INPUT	size(48):
	+---
 0	| pointerId
 4	| tagPOINT point
12	| tagRECT boundingBox
28	| tagRECT nonOccludedBoundingBox
44	| orientation
	+---

class tagINPUT_TRANSFORM::<unnamed-tag>::<unnamed-tag>	size(64):
	+---
 0	| _11
 4	| _12
 8	| _13
12	| _14
16	| _21
20	| _22
24	| _23
28	| _24
32	| _31
36	| _32
40	| _33
44	| _34
48	| _41
52	| _42
56	| _43
60	| _44
	+---

class tagINPUT_TRANSFORM::<unnamed-tag>	size(64):
	+---
 0	| _11
 4	| _12
 8	| _13
12	| _14
16	| _21
20	| _22
24	| _23
28	| _24
32	| _31
36	| _32
40	| _33
44	| _34
48	| _41
52	| _42
56	| _43
60	| _44
 0	| m
	+---

class tagINPUT_TRANSFORM	size(64):
	+---
 0	| _11
 4	| _12
 8	| _13
12	| _14
16	| _21
20	| _22
24	| _23
28	| _24
32	| _31
36	| _32
40	| _33
44	| _34
48	| _41
52	| _42
56	| _43
60	| _44
 0	| m
	+---

class tagLASTINPUTINFO	size(8):
	+---
 0	| cbSize
 4	| dwTime
	+---

class tagTPMPARAMS	size(20):
	+---
 0	| cbSize
 4	| tagRECT rcExclude
	+---

class tagMENUINFO	size(28):
	+---
 0	| cbSize
 4	| fMask
 8	| dwStyle
12	| cyMax
16	| hbrBack
20	| dwContextHelpID
24	| dwMenuData
	+---

class tagMENUGETOBJECTINFO	size(20):
	+---
 0	| dwFlags
 4	| uPos
 8	| hmenu
12	| riid
16	| pvObj
	+---

class tagMENUITEMINFOA	size(48):
	+---
 0	| cbSize
 4	| fMask
 8	| fType
12	| fState
16	| wID
20	| hSubMenu
24	| hbmpChecked
28	| hbmpUnchecked
32	| dwItemData
36	| dwTypeData
40	| cch
44	| hbmpItem
	+---

class tagMENUITEMINFOW	size(48):
	+---
 0	| cbSize
 4	| fMask
 8	| fType
12	| fState
16	| wID
20	| hSubMenu
24	| hbmpChecked
28	| hbmpUnchecked
32	| dwItemData
36	| dwTypeData
40	| cch
44	| hbmpItem
	+---

class tagDROPSTRUCT	size(28):
	+---
 0	| hwndSource
 4	| hwndSink
 8	| wFmt
12	| dwData
16	| tagPOINT ptDrop
24	| dwControlData
	+---

class tagDRAWTEXTPARAMS	size(20):
	+---
 0	| cbSize
 4	| iTabLength
 8	| iLeftMargin
12	| iRightMargin
16	| uiLengthDrawn
	+---

class tagHELPINFO	size(28):
	+---
 0	| cbSize
 4	| iContextType
 8	| iCtrlId
12	| hItemHandle
16	| dwContextId
20	| tagPOINT MousePos
	+---

class tagMSGBOXPARAMSA	size(40):
	+---
 0	| cbSize
 4	| hwndOwner
 8	| hInstance
12	| lpszText
16	| lpszCaption
20	| dwStyle
24	| lpszIcon
28	| dwContextHelpId
32	| lpfnMsgBoxCallback
36	| dwLanguageId
	+---

class tagMSGBOXPARAMSW	size(40):
	+---
 0	| cbSize
 4	| hwndOwner
 8	| hInstance
12	| lpszText
16	| lpszCaption
20	| dwStyle
24	| lpszIcon
28	| dwContextHelpId
32	| lpfnMsgBoxCallback
36	| dwLanguageId
	+---

class <unnamed-tag>	size(4):
	+---
 0	| versionNumber
 2	| offset
	+---

class <unnamed-tag>	size(6):
	+---
 0	| mtOption
 2	| mtID
 4	| mtString
	+---

class _ICONINFO	size(20):
	+---
 0	| fIcon
 4	| xHotspot
 8	| yHotspot
12	| hbmMask
16	| hbmColor
	+---

class tagCURSORSHAPE	size(24):
	+---
 0	| xHotSpot
 4	| yHotSpot
 8	| cx
12	| cy
16	| cbWidth
20	| Planes
21	| BitsPixel
  	| <alignment member> (size=2)
	+---

class _ICONINFOEXA	size(548):
	+---
 0	| cbSize
 4	| fIcon
 8	| xHotspot
12	| yHotspot
16	| hbmMask
20	| hbmColor
24	| wResID
26	| szModName
286	| szResName
  	| <alignment member> (size=2)
	+---

class _ICONINFOEXW	size(1068):
	+---
 0	| cbSize
 4	| fIcon
 8	| xHotspot
12	| yHotspot
16	| hbmMask
20	| hbmColor
24	| wResID
26	| szModName
546	| szResName
  	| <alignment member> (size=2)
	+---

class tagSCROLLINFO	size(28):
	+---
 0	| cbSize
 4	| fMask
 8	| nMin
12	| nMax
16	| nPage
20	| nPos
24	| nTrackPos
	+---

class tagMDICREATESTRUCTA	size(36):
	+---
 0	| szClass
 4	| szTitle
 8	| hOwner
12	| x
16	| y
20	| cx
24	| cy
28	| style
32	| lParam
	+---

class tagMDICREATESTRUCTW	size(36):
	+---
 0	| szClass
 4	| szTitle
 8	| hOwner
12	| x
16	| y
20	| cx
24	| cy
28	| style
32	| lParam
	+---

class tagCLIENTCREATESTRUCT	size(8):
	+---
 0	| hWindowMenu
 4	| idFirstChild
	+---

class tagMULTIKEYHELPA	size(8):
	+---
 0	| mkSize
 4	| mkKeylist
 5	| szKeyphrase
  	| <alignment member> (size=2)
	+---

class tagMULTIKEYHELPW	size(8):
	+---
 0	| mkSize
 4	| mkKeylist
 6	| szKeyphrase
	+---

class tagHELPWININFOA	size(28):
	+---
 0	| wStructSize
 4	| x
 8	| y
12	| dx
16	| dy
20	| wMax
24	| rgchMember
  	| <alignment member> (size=2)
	+---

class tagHELPWININFOW	size(28):
	+---
 0	| wStructSize
 4	| x
 8	| y
12	| dx
16	| dy
20	| wMax
24	| rgchMember
	+---

class tagTouchPredictionParameters	size(16):
	+---
 0	| cbSize
 4	| dwLatency
 8	| dwSampleTime
12	| bUseHWTimeStamp
	+---

class tagNONCLIENTMETRICSA	size(344):
	+---
 0	| cbSize
 4	| iBorderWidth
 8	| iScrollWidth
12	| iScrollHeight
16	| iCaptionWidth
20	| iCaptionHeight
24	| tagLOGFONTA lfCaptionFont
84	| iSmCaptionWidth
88	| iSmCaptionHeight
92	| tagLOGFONTA lfSmCaptionFont
152	| iMenuWidth
156	| iMenuHeight
160	| tagLOGFONTA lfMenuFont
220	| tagLOGFONTA lfStatusFont
280	| tagLOGFONTA lfMessageFont
340	| iPaddedBorderWidth
	+---

class tagNONCLIENTMETRICSW	size(504):
	+---
 0	| cbSize
 4	| iBorderWidth
 8	| iScrollWidth
12	| iScrollHeight
16	| iCaptionWidth
20	| iCaptionHeight
24	| tagLOGFONTW lfCaptionFont
116	| iSmCaptionWidth
120	| iSmCaptionHeight
124	| tagLOGFONTW lfSmCaptionFont
216	| iMenuWidth
220	| iMenuHeight
224	| tagLOGFONTW lfMenuFont
316	| tagLOGFONTW lfStatusFont
408	| tagLOGFONTW lfMessageFont
500	| iPaddedBorderWidth
	+---

class tagMINIMIZEDMETRICS	size(20):
	+---
 0	| cbSize
 4	| iWidth
 8	| iHorzGap
12	| iVertGap
16	| iArrange
	+---

class tagICONMETRICSA	size(76):
	+---
 0	| cbSize
 4	| iHorzSpacing
 8	| iVertSpacing
12	| iTitleWrap
16	| tagLOGFONTA lfFont
	+---

class tagICONMETRICSW	size(108):
	+---
 0	| cbSize
 4	| iHorzSpacing
 8	| iVertSpacing
12	| iTitleWrap
16	| tagLOGFONTW lfFont
	+---

class tagANIMATIONINFO	size(8):
	+---
 0	| cbSize
 4	| iMinAnimate
	+---

class tagSERIALKEYSA	size(28):
	+---
 0	| cbSize
 4	| dwFlags
 8	| lpszActivePort
12	| lpszPort
16	| iBaudRate
20	| iPortState
24	| iActive
	+---

class tagSERIALKEYSW	size(28):
	+---
 0	| cbSize
 4	| dwFlags
 8	| lpszActivePort
12	| lpszPort
16	| iBaudRate
20	| iPortState
24	| iActive
	+---

class tagHIGHCONTRASTA	size(12):
	+---
 0	| cbSize
 4	| dwFlags
 8	| lpszDefaultScheme
	+---

class tagHIGHCONTRASTW	size(12):
	+---
 0	| cbSize
 4	| dwFlags
 8	| lpszDefaultScheme
	+---

class _VIDEOPARAMETERS	size(356):
	+---
 0	| _GUID Guid
16	| dwOffset
20	| dwCommand
24	| dwFlags
28	| dwMode
32	| dwTVStandard
36	| dwAvailableModes
40	| dwAvailableTVStandard
44	| dwFlickerFilter
48	| dwOverScanX
52	| dwOverScanY
56	| dwMaxUnscaledX
60	| dwMaxUnscaledY
64	| dwPositionX
68	| dwPositionY
72	| dwBrightness
76	| dwContrast
80	| dwCPType
84	| dwCPCommand
88	| dwCPStandard
92	| dwCPKey
96	| bCP_APSTriggerBits
100	| bOEMCopyProtection
	+---

class tagFILTERKEYS	size(24):
	+---
 0	| cbSize
 4	| dwFlags
 8	| iWaitMSec
12	| iDelayMSec
16	| iRepeatMSec
20	| iBounceMSec
	+---

class tagSTICKYKEYS	size(8):
	+---
 0	| cbSize
 4	| dwFlags
	+---

class tagMOUSEKEYS	size(28):
	+---
 0	| cbSize
 4	| dwFlags
 8	| iMaxSpeed
12	| iTimeToMaxSpeed
16	| iCtrlSpeed
20	| dwReserved1
24	| dwReserved2
	+---

class tagACCESSTIMEOUT	size(12):
	+---
 0	| cbSize
 4	| dwFlags
 8	| iTimeOutMSec
	+---

class tagSOUNDSENTRYA	size(48):
	+---
 0	| cbSize
 4	| dwFlags
 8	| iFSTextEffect
12	| iFSTextEffectMSec
16	| iFSTextEffectColorBits
20	| iFSGrafEffect
24	| iFSGrafEffectMSec
28	| iFSGrafEffectColor
32	| iWindowsEffect
36	| iWindowsEffectMSec
40	| lpszWindowsEffectDLL
44	| iWindowsEffectOrdinal
	+---

class tagSOUNDSENTRYW	size(48):
	+---
 0	| cbSize
 4	| dwFlags
 8	| iFSTextEffect
12	| iFSTextEffectMSec
16	| iFSTextEffectColorBits
20	| iFSGrafEffect
24	| iFSGrafEffectMSec
28	| iFSGrafEffectColor
32	| iWindowsEffect
36	| iWindowsEffectMSec
40	| lpszWindowsEffectDLL
44	| iWindowsEffectOrdinal
	+---

class tagTOGGLEKEYS	size(8):
	+---
 0	| cbSize
 4	| dwFlags
	+---

class tagAUDIODESCRIPTION	size(12):
	+---
 0	| cbSize
 4	| Enabled
 8	| Locale
	+---

class tagMONITORINFO	size(40):
	+---
 0	| cbSize
 4	| tagRECT rcMonitor
20	| tagRECT rcWork
36	| dwFlags
	+---

class tagMONITORINFOEXA	size(72):
	+---
 0	| +--- (base class tagMONITORINFO)
 0	| | cbSize
 4	| | tagRECT rcMonitor
20	| | tagRECT rcWork
36	| | dwFlags
	| +---
40	| szDevice
	+---

class tagMONITORINFOEXW	size(104):
	+---
 0	| +--- (base class tagMONITORINFO)
 0	| | cbSize
 4	| | tagRECT rcMonitor
20	| | tagRECT rcWork
36	| | dwFlags
	| +---
40	| szDevice
	+---

class tagGUITHREADINFO	size(48):
	+---
 0	| cbSize
 4	| flags
 8	| hwndActive
12	| hwndFocus
16	| hwndCapture
20	| hwndMenuOwner
24	| hwndMoveSize
28	| hwndCaret
32	| tagRECT rcCaret
	+---

class tagCURSORINFO	size(20):
	+---
 0	| cbSize
 4	| flags
 8	| hCursor
12	| tagPOINT ptScreenPos
	+---

class tagWINDOWINFO	size(60):
	+---
 0	| cbSize
 4	| tagRECT rcWindow
20	| tagRECT rcClient
36	| dwStyle
40	| dwExStyle
44	| dwWindowStatus
48	| cxWindowBorders
52	| cyWindowBorders
56	| atomWindowType
58	| wCreatorVersion
	+---

class tagTITLEBARINFO	size(44):
	+---
 0	| cbSize
 4	| tagRECT rcTitleBar
20	| rgstate
	+---

class tagTITLEBARINFOEX	size(140):
	+---
 0	| cbSize
 4	| tagRECT rcTitleBar
20	| rgstate
44	| rgrect
	+---

class tagMENUBARINFO	size(32):
	+---
 0	| cbSize
 4	| tagRECT rcBar
20	| hMenu
24	| hwndMenu
28.	| fBarFocused (bitstart=0,nbits=1)
28.	| fFocused (bitstart=1,nbits=1)
	+---

class tagSCROLLBARINFO	size(60):
	+---
 0	| cbSize
 4	| tagRECT rcScrollBar
20	| dxyLineButton
24	| xyThumbTop
28	| xyThumbBottom
32	| reserved
36	| rgstate
	+---

class tagCOMBOBOXINFO	size(52):
	+---
 0	| cbSize
 4	| tagRECT rcItem
20	| tagRECT rcButton
36	| stateButton
40	| hwndCombo
44	| hwndItem
48	| hwndList
	+---

class tagALTTABINFO	size(40):
	+---
 0	| cbSize
 4	| cItems
 8	| cColumns
12	| cRows
16	| iColFocus
20	| iRowFocus
24	| cxItem
28	| cyItem
32	| tagPOINT ptStart
	+---

class HRAWINPUT__	size(4):
	+---
 0	| unused
	+---

class tagRAWINPUTHEADER	size(16):
	+---
 0	| dwType
 4	| dwSize
 8	| hDevice
12	| wParam
	+---

class tagRAWMOUSE::<unnamed-tag>::<unnamed-tag>	size(4):
	+---
 0	| usButtonFlags
 2	| usButtonData
	+---

class tagRAWMOUSE::<unnamed-tag>	size(4):
	+---
 0	| ulButtons
 0	| usButtonFlags
 2	| usButtonData
	+---

class tagRAWMOUSE	size(24):
	+---
 0	| usFlags
  	| <alignment member> (size=2)
  	| <unnamed-tag> <alignment member> (size=4)
 4	| ulButtons
  	| <unnamed-tag> <alignment member> (size=4)
 4	| usButtonFlags
 6	| usButtonData
  	| <unnamed-tag> <alignment member> (size=4)
 8	| ulRawButtons
12	| lLastX
16	| lLastY
20	| ulExtraInformation
	+---

class tagRAWKEYBOARD	size(16):
	+---
 0	| MakeCode
 2	| Flags
 4	| Reserved
 6	| VKey
 8	| Message
12	| ExtraInformation
	+---

class tagRAWHID	size(12):
	+---
 0	| dwSizeHid
 4	| dwCount
 8	| bRawData
  	| <alignment member> (size=3)
	+---

class tagRAWINPUT::<unnamed-tag>	size(24):
	+---
 0	| tagRAWMOUSE mouse
 0	| tagRAWKEYBOARD keyboard
 0	| tagRAWHID hid
	+---

class tagRAWINPUT	size(40):
	+---
 0	| tagRAWINPUTHEADER header
16	| <unnamed-type-data> data
	+---

class tagRID_DEVICE_INFO_MOUSE	size(16):
	+---
 0	| dwId
 4	| dwNumberOfButtons
 8	| dwSampleRate
12	| fHasHorizontalWheel
	+---

class tagRID_DEVICE_INFO_KEYBOARD	size(24):
	+---
 0	| dwType
 4	| dwSubType
 8	| dwKeyboardMode
12	| dwNumberOfFunctionKeys
16	| dwNumberOfIndicators
20	| dwNumberOfKeysTotal
	+---

class tagRID_DEVICE_INFO_HID	size(16):
	+---
 0	| dwVendorId
 4	| dwProductId
 8	| dwVersionNumber
12	| usUsagePage
14	| usUsage
	+---

class tagRID_DEVICE_INFO::<unnamed-tag>	size(24):
	+---
 0	| tagRID_DEVICE_INFO_MOUSE mouse
 0	| tagRID_DEVICE_INFO_KEYBOARD keyboard
 0	| tagRID_DEVICE_INFO_HID hid
	+---

class tagRID_DEVICE_INFO	size(32):
	+---
 0	| cbSize
 4	| dwType
  	| <unnamed-tag> <alignment member> (size=8)
 8	| tagRID_DEVICE_INFO_MOUSE mouse
 8	| tagRID_DEVICE_INFO_KEYBOARD keyboard
 8	| tagRID_DEVICE_INFO_HID hid
	+---

class tagRAWINPUTDEVICE	size(12):
	+---
 0	| usUsagePage
 2	| usUsage
 4	| dwFlags
 8	| hwndTarget
	+---

class tagRAWINPUTDEVICELIST	size(8):
	+---
 0	| hDevice
 4	| dwType
	+---

class tagPOINTER_DEVICE_INFO	size(1064):
	+---
 0	| displayOrientation
 4	| device
 8	| tagPOINTER_DEVICE_TYPE pointerDeviceType
12	| monitor
16	| startingCursorId
20	| maxActiveContacts
22	| productString
  	| <alignment member> (size=2)
	+---

class tagPOINTER_DEVICE_PROPERTY	size(28):
	+---
 0	| logicalMin
 4	| logicalMax
 8	| physicalMin
12	| physicalMax
16	| unit
20	| unitExponent
24	| usagePageId
26	| usageId
	+---

class tagPOINTER_DEVICE_CURSOR_INFO	size(8):
	+---
 0	| cursorId
 4	| tagPOINTER_DEVICE_CURSOR_TYPE cursor
	+---

class tagCHANGEFILTERSTRUCT	size(8):
	+---
 0	| cbSize
 4	| ExtStatus
	+---

class HGESTUREINFO__	size(4):
	+---
 0	| unused
	+---

class tagGESTUREINFO	size(48):
	+---
 0	| cbSize
 4	| dwFlags
 8	| dwID
12	| hwndTarget
16	| tagPOINTS ptsLocation
20	| dwInstanceID
24	| dwSequenceID
  	| <alignment member> (size=4)
32	| ullArguments
40	| cbExtraArgs
  	| <alignment member> (size=4)
	+---

class tagGESTURENOTIFYSTRUCT	size(20):
	+---
 0	| cbSize
 4	| dwFlags
 8	| hwndTarget
12	| tagPOINTS ptsLocation
16	| dwInstanceID
	+---

class tagGESTURECONFIG	size(12):
	+---
 0	| dwID
 4	| dwWant
 8	| dwBlock
	+---

class tagINPUT_MESSAGE_SOURCE	size(8):
	+---
 0	| tagINPUT_MESSAGE_DEVICE_TYPE deviceType
 4	| tagINPUT_MESSAGE_ORIGIN_ID originId
	+---

class _ENUM_FLAG_SIZED_INTEGER<enum tagAR_STATE>	size(1):
	+---
	+---

class _ENUM_FLAG_SIZED_INTEGER<enum ORIENTATION_PREFERENCE>	size(1):
	+---
	+---

class _cpinfo	size(20):
	+---
 0	| MaxCharSize
 4	| DefaultChar
 6	| LeadByte
  	| <alignment member> (size=2)
	+---

class _cpinfoexA	size(284):
	+---
 0	| MaxCharSize
 4	| DefaultChar
 6	| LeadByte
18	| UnicodeDefaultChar
20	| CodePage
24	| CodePageName
	+---

class _cpinfoexW	size(544):
	+---
 0	| MaxCharSize
 4	| DefaultChar
 6	| LeadByte
18	| UnicodeDefaultChar
20	| CodePage
24	| CodePageName
	+---

class _numberfmtA	size(24):
	+---
 0	| NumDigits
 4	| LeadingZero
 8	| Grouping
12	| lpDecimalSep
16	| lpThousandSep
20	| NegativeOrder
	+---

class _numberfmtW	size(24):
	+---
 0	| NumDigits
 4	| LeadingZero
 8	| Grouping
12	| lpDecimalSep
16	| lpThousandSep
20	| NegativeOrder
	+---

class _currencyfmtA	size(32):
	+---
 0	| NumDigits
 4	| LeadingZero
 8	| Grouping
12	| lpDecimalSep
16	| lpThousandSep
20	| NegativeOrder
24	| PositiveOrder
28	| lpCurrencySymbol
	+---

class _currencyfmtW	size(32):
	+---
 0	| NumDigits
 4	| LeadingZero
 8	| Grouping
12	| lpDecimalSep
16	| lpThousandSep
20	| NegativeOrder
24	| PositiveOrder
28	| lpCurrencySymbol
	+---

class _nlsversioninfo	size(32):
	+---
 0	| dwNLSVersionInfoSize
 4	| dwNLSVersion
 8	| dwDefinedVersion
12	| dwEffectiveId
16	| _GUID guidCustomVersion
	+---

class _nlsversioninfoex	size(32):
	+---
 0	| dwNLSVersionInfoSize
 4	| dwNLSVersion
 8	| dwDefinedVersion
12	| dwEffectiveId
16	| _GUID guidCustomVersion
	+---

class _FILEMUIINFO	size(80):
	+---
 0	| dwSize
 4	| dwVersion
 8	| dwFileType
12	| pChecksum
28	| pServiceChecksum
44	| dwLanguageNameOffset
48	| dwTypeIDMainSize
52	| dwTypeIDMainOffset
56	| dwTypeNameMainOffset
60	| dwTypeIDMUISize
64	| dwTypeIDMUIOffset
68	| dwTypeNameMUIOffset
72	| abBuffer
	+---

class _COORD	size(4):
	+---
 0	| X
 2	| Y
	+---

class _SMALL_RECT	size(8):
	+---
 0	| Left
 2	| Top
 4	| Right
 6	| Bottom
	+---

class _KEY_EVENT_RECORD::<unnamed-tag>	size(2):
	+---
 0	| UnicodeChar
 0	| AsciiChar
	+---

class _KEY_EVENT_RECORD	size(16):
	+---
 0	| bKeyDown
 4	| wRepeatCount
 6	| wVirtualKeyCode
 8	| wVirtualScanCode
10	| <unnamed-type-uChar> uChar
12	| dwControlKeyState
	+---

class _MOUSE_EVENT_RECORD	size(16):
	+---
 0	| _COORD dwMousePosition
 4	| dwButtonState
 8	| dwControlKeyState
12	| dwEventFlags
	+---

class _WINDOW_BUFFER_SIZE_RECORD	size(4):
	+---
 0	| _COORD dwSize
	+---

class _MENU_EVENT_RECORD	size(4):
	+---
 0	| dwCommandId
	+---

class _FOCUS_EVENT_RECORD	size(4):
	+---
 0	| bSetFocus
	+---

class _INPUT_RECORD::<unnamed-tag>	size(16):
	+---
 0	| _KEY_EVENT_RECORD KeyEvent
 0	| _MOUSE_EVENT_RECORD MouseEvent
 0	| _WINDOW_BUFFER_SIZE_RECORD WindowBufferSizeEvent
 0	| _MENU_EVENT_RECORD MenuEvent
 0	| _FOCUS_EVENT_RECORD FocusEvent
	+---

class _INPUT_RECORD	size(20):
	+---
 0	| EventType
  	| <alignment member> (size=2)
 4	| <unnamed-type-Event> Event
	+---

class _CHAR_INFO::<unnamed-tag>	size(2):
	+---
 0	| UnicodeChar
 0	| AsciiChar
	+---

class _CHAR_INFO	size(4):
	+---
 0	| <unnamed-type-Char> Char
 2	| Attributes
	+---

class _CONSOLE_SCREEN_BUFFER_INFO	size(22):
	+---
 0	| _COORD dwSize
 4	| _COORD dwCursorPosition
 8	| wAttributes
10	| _SMALL_RECT srWindow
18	| _COORD dwMaximumWindowSize
	+---

class _CONSOLE_SCREEN_BUFFER_INFOEX	size(96):
	+---
 0	| cbSize
 4	| _COORD dwSize
 8	| _COORD dwCursorPosition
12	| wAttributes
14	| _SMALL_RECT srWindow
22	| _COORD dwMaximumWindowSize
26	| wPopupAttributes
28	| bFullscreenSupported
32	| ColorTable
	+---

class _CONSOLE_CURSOR_INFO	size(8):
	+---
 0	| dwSize
 4	| bVisible
	+---

class _CONSOLE_FONT_INFO	size(8):
	+---
 0	| nFont
 4	| _COORD dwFontSize
	+---

class _CONSOLE_FONT_INFOEX	size(84):
	+---
 0	| cbSize
 4	| nFont
 8	| _COORD dwFontSize
12	| FontFamily
16	| FontWeight
20	| FaceName
	+---

class _CONSOLE_HISTORY_INFO	size(16):
	+---
 0	| cbSize
 4	| HistoryBufferSize
 8	| NumberOfHistoryBuffers
12	| dwFlags
	+---

class _CONSOLE_SELECTION_INFO	size(16):
	+---
 0	| dwFlags
 4	| _COORD dwSelectionAnchor
 8	| _SMALL_RECT srSelection
	+---

class _CONSOLE_READCONSOLE_CONTROL	size(16):
	+---
 0	| nLength
 4	| nInitialChars
 8	| dwCtrlWakeupMask
12	| dwControlKeyState
	+---

class tagVS_FIXEDFILEINFO	size(52):
	+---
 0	| dwSignature
 4	| dwStrucVersion
 8	| dwFileVersionMS
12	| dwFileVersionLS
16	| dwProductVersionMS
20	| dwProductVersionLS
24	| dwFileFlagsMask
28	| dwFileFlags
32	| dwFileOS
36	| dwFileType
40	| dwFileSubtype
44	| dwFileDateMS
48	| dwFileDateLS
	+---

class val_context	size(12):
	+---
 0	| valuelen
 4	| value_context
 8	| val_buff_ptr
	+---

class pvalueA	size(16):
	+---
 0	| pv_valuename
 4	| pv_valuelen
 8	| pv_value_context
12	| pv_type
	+---

class pvalueW	size(16):
	+---
 0	| pv_valuename
 4	| pv_valuelen
 8	| pv_value_context
12	| pv_type
	+---

class provider_info	size(24):
	+---
 0	| pi_R0_1val
 4	| pi_R0_allvals
 8	| pi_R3_1val
12	| pi_R3_allvals
16	| pi_flags
20	| pi_key_context
	+---

class value_entA	size(16):
	+---
 0	| ve_valuename
 4	| ve_valuelen
 8	| ve_valueptr
12	| ve_type
	+---

class value_entW	size(16):
	+---
 0	| ve_valuename
 4	| ve_valuelen
 8	| ve_valueptr
12	| ve_type
	+---

class _NETRESOURCEA	size(32):
	+---
 0	| dwScope
 4	| dwType
 8	| dwDisplayType
12	| dwUsage
16	| lpLocalName
20	| lpRemoteName
24	| lpComment
28	| lpProvider
	+---

class _NETRESOURCEW	size(32):
	+---
 0	| dwScope
 4	| dwType
 8	| dwDisplayType
12	| dwUsage
16	| lpLocalName
20	| lpRemoteName
24	| lpComment
28	| lpProvider
	+---

class _CONNECTDLGSTRUCTA	size(20):
	+---
 0	| cbStructure
 4	| hwndOwner
 8	| lpConnRes
12	| dwFlags
16	| dwDevNum
	+---

class _CONNECTDLGSTRUCTW	size(20):
	+---
 0	| cbStructure
 4	| hwndOwner
 8	| lpConnRes
12	| dwFlags
16	| dwDevNum
	+---

class _DISCDLGSTRUCTA	size(20):
	+---
 0	| cbStructure
 4	| hwndOwner
 8	| lpLocalName
12	| lpRemoteName
16	| dwFlags
	+---

class _DISCDLGSTRUCTW	size(20):
	+---
 0	| cbStructure
 4	| hwndOwner
 8	| lpLocalName
12	| lpRemoteName
16	| dwFlags
	+---

class _UNIVERSAL_NAME_INFOA	size(4):
	+---
 0	| lpUniversalName
	+---

class _UNIVERSAL_NAME_INFOW	size(4):
	+---
 0	| lpUniversalName
	+---

class _REMOTE_NAME_INFOA	size(12):
	+---
 0	| lpUniversalName
 4	| lpConnectionName
 8	| lpRemainingPath
	+---

class _REMOTE_NAME_INFOW	size(12):
	+---
 0	| lpUniversalName
 4	| lpConnectionName
 8	| lpRemainingPath
	+---

class _NETINFOSTRUCT	size(32):
	+---
 0	| cbStructure
 4	| dwProviderVersion
 8	| dwStatus
12	| dwCharacteristics
16	| dwHandle
20	| wNetType
  	| <alignment member> (size=2)
24	| dwPrinters
28	| dwDrives
	+---

class _NETCONNECTINFOSTRUCT	size(20):
	+---
 0	| cbStructure
 4	| dwFlags
 8	| dwSpeed
12	| dwDelay
16	| dwOptDataSize
	+---

class <unnamed-tag>	size(8):
	+---
 0	| Data
	+---

class _SERVICE_CUSTOM_SYSTEM_STATE_CHANGE_DATA_ITEM::<unnamed-tag>::<unnamed-tag>	size(8):
	+---
 0	| DataOffset
 4	| Data
  	| <alignment member> (size=3)
	+---

class _SERVICE_CUSTOM_SYSTEM_STATE_CHANGE_DATA_ITEM::<unnamed-tag>	size(8):
	+---
 0	| SERVICE_TRIGGER_CUSTOM_STATE_ID CustomStateId
 0	| <unnamed-type-s> s
	+---

class _SERVICE_CUSTOM_SYSTEM_STATE_CHANGE_DATA_ITEM	size(8):
	+---
 0	| <unnamed-type-u> u
	+---

class _SERVICE_DESCRIPTIONA	size(4):
	+---
 0	| lpDescription
	+---

class _SERVICE_DESCRIPTIONW	size(4):
	+---
 0	| lpDescription
	+---

class _SC_ACTION	size(8):
	+---
 0	| _SC_ACTION_TYPE Type
 4	| Delay
	+---

class _SERVICE_FAILURE_ACTIONSA	size(20):
	+---
 0	| dwResetPeriod
 4	| lpRebootMsg
 8	| lpCommand
12	| cActions
16	| lpsaActions
	+---

class _SERVICE_FAILURE_ACTIONSW	size(20):
	+---
 0	| dwResetPeriod
 4	| lpRebootMsg
 8	| lpCommand
12	| cActions
16	| lpsaActions
	+---

class _SERVICE_DELAYED_AUTO_START_INFO	size(4):
	+---
 0	| fDelayedAutostart
	+---

class _SERVICE_FAILURE_ACTIONS_FLAG	size(4):
	+---
 0	| fFailureActionsOnNonCrashFailures
	+---

class _SERVICE_SID_INFO	size(4):
	+---
 0	| dwServiceSidType
	+---

class _SERVICE_REQUIRED_PRIVILEGES_INFOA	size(4):
	+---
 0	| pmszRequiredPrivileges
	+---

class _SERVICE_REQUIRED_PRIVILEGES_INFOW	size(4):
	+---
 0	| pmszRequiredPrivileges
	+---

class _SERVICE_PRESHUTDOWN_INFO	size(4):
	+---
 0	| dwPreshutdownTimeout
	+---

class _SERVICE_TRIGGER_SPECIFIC_DATA_ITEM	size(12):
	+---
 0	| dwDataType
 4	| cbData
 8	| pData
	+---

class _SERVICE_TRIGGER	size(20):
	+---
 0	| dwTriggerType
 4	| dwAction
 8	| pTriggerSubtype
12	| cDataItems
16	| pDataItems
	+---

class _SERVICE_TRIGGER_INFO	size(12):
	+---
 0	| cTriggers
 4	| pTriggers
 8	| pReserved
	+---

class _SERVICE_PREFERRED_NODE_INFO	size(4):
	+---
 0	| usPreferredNode
 2	| fDelete
  	| <alignment member> (size=1)
	+---

class _SERVICE_TIMECHANGE_INFO	size(16):
	+---
 0	| _LARGE_INTEGER liNewTime
 8	| _LARGE_INTEGER liOldTime
	+---

class _SERVICE_LAUNCH_PROTECTED_INFO	size(4):
	+---
 0	| dwLaunchProtected
	+---

class SC_HANDLE__	size(4):
	+---
 0	| unused
	+---

class SERVICE_STATUS_HANDLE__	size(4):
	+---
 0	| unused
	+---

class _SERVICE_STATUS	size(28):
	+---
 0	| dwServiceType
 4	| dwCurrentState
 8	| dwControlsAccepted
12	| dwWin32ExitCode
16	| dwServiceSpecificExitCode
20	| dwCheckPoint
24	| dwWaitHint
	+---

class _SERVICE_STATUS_PROCESS	size(36):
	+---
 0	| dwServiceType
 4	| dwCurrentState
 8	| dwControlsAccepted
12	| dwWin32ExitCode
16	| dwServiceSpecificExitCode
20	| dwCheckPoint
24	| dwWaitHint
28	| dwProcessId
32	| dwServiceFlags
	+---

class _ENUM_SERVICE_STATUSA	size(36):
	+---
 0	| lpServiceName
 4	| lpDisplayName
 8	| _SERVICE_STATUS ServiceStatus
	+---

class _ENUM_SERVICE_STATUSW	size(36):
	+---
 0	| lpServiceName
 4	| lpDisplayName
 8	| _SERVICE_STATUS ServiceStatus
	+---

class _ENUM_SERVICE_STATUS_PROCESSA	size(44):
	+---
 0	| lpServiceName
 4	| lpDisplayName
 8	| _SERVICE_STATUS_PROCESS ServiceStatusProcess
	+---

class _ENUM_SERVICE_STATUS_PROCESSW	size(44):
	+---
 0	| lpServiceName
 4	| lpDisplayName
 8	| _SERVICE_STATUS_PROCESS ServiceStatusProcess
	+---

class _QUERY_SERVICE_LOCK_STATUSA	size(12):
	+---
 0	| fIsLocked
 4	| lpLockOwner
 8	| dwLockDuration
	+---

class _QUERY_SERVICE_LOCK_STATUSW	size(12):
	+---
 0	| fIsLocked
 4	| lpLockOwner
 8	| dwLockDuration
	+---

class _QUERY_SERVICE_CONFIGA	size(36):
	+---
 0	| dwServiceType
 4	| dwStartType
 8	| dwErrorControl
12	| lpBinaryPathName
16	| lpLoadOrderGroup
20	| dwTagId
24	| lpDependencies
28	| lpServiceStartName
32	| lpDisplayName
	+---

class _QUERY_SERVICE_CONFIGW	size(36):
	+---
 0	| dwServiceType
 4	| dwStartType
 8	| dwErrorControl
12	| lpBinaryPathName
16	| lpLoadOrderGroup
20	| dwTagId
24	| lpDependencies
28	| lpServiceStartName
32	| lpDisplayName
	+---

class _SERVICE_TABLE_ENTRYA	size(8):
	+---
 0	| lpServiceName
 4	| lpServiceProc
	+---

class _SERVICE_TABLE_ENTRYW	size(8):
	+---
 0	| lpServiceName
 4	| lpServiceProc
	+---

class _SERVICE_NOTIFY_1	size(52):
	+---
 0	| dwVersion
 4	| pfnNotifyCallback
 8	| pContext
12	| dwNotificationStatus
16	| _SERVICE_STATUS_PROCESS ServiceStatus
	+---

class _SERVICE_NOTIFY_2A	size(60):
	+---
 0	| dwVersion
 4	| pfnNotifyCallback
 8	| pContext
12	| dwNotificationStatus
16	| _SERVICE_STATUS_PROCESS ServiceStatus
52	| dwNotificationTriggered
56	| pszServiceNames
	+---

class _SERVICE_NOTIFY_2W	size(60):
	+---
 0	| dwVersion
 4	| pfnNotifyCallback
 8	| pContext
12	| dwNotificationStatus
16	| _SERVICE_STATUS_PROCESS ServiceStatus
52	| dwNotificationTriggered
56	| pszServiceNames
	+---

class _SERVICE_CONTROL_STATUS_REASON_PARAMSA	size(44):
	+---
 0	| dwReason
 4	| pszComment
 8	| _SERVICE_STATUS_PROCESS ServiceStatus
	+---

class _SERVICE_CONTROL_STATUS_REASON_PARAMSW	size(44):
	+---
 0	| dwReason
 4	| pszComment
 8	| _SERVICE_STATUS_PROCESS ServiceStatus
	+---

class _SERVICE_START_REASON	size(4):
	+---
 0	| dwReason
	+---

class _MODEMDEVCAPS	size(80):
	+---
 0	| dwActualSize
 4	| dwRequiredSize
 8	| dwDevSpecificOffset
12	| dwDevSpecificSize
16	| dwModemProviderVersion
20	| dwModemManufacturerOffset
24	| dwModemManufacturerSize
28	| dwModemModelOffset
32	| dwModemModelSize
36	| dwModemVersionOffset
40	| dwModemVersionSize
44	| dwDialOptions
48	| dwCallSetupFailTimer
52	| dwInactivityTimeout
56	| dwSpeakerVolume
60	| dwSpeakerMode
64	| dwModemOptions
68	| dwMaxDTERate
72	| dwMaxDCERate
76	| abVariablePortion
  	| <alignment member> (size=3)
	+---

class _MODEMSETTINGS	size(48):
	+---
 0	| dwActualSize
 4	| dwRequiredSize
 8	| dwDevSpecificOffset
12	| dwDevSpecificSize
16	| dwCallSetupFailTimer
20	| dwInactivityTimeout
24	| dwSpeakerVolume
28	| dwSpeakerMode
32	| dwPreferredModemOptions
36	| dwNegotiatedModemOptions
40	| dwNegotiatedDCERate
44	| abVariablePortion
  	| <alignment member> (size=3)
	+---

class HIMC__	size(4):
	+---
 0	| unused
	+---

class HIMCC__	size(4):
	+---
 0	| unused
	+---

class tagCOMPOSITIONFORM	size(28):
	+---
 0	| dwStyle
 4	| tagPOINT ptCurrentPos
12	| tagRECT rcArea
	+---

class tagCANDIDATEFORM	size(32):
	+---
 0	| dwIndex
 4	| dwStyle
 8	| tagPOINT ptCurrentPos
16	| tagRECT rcArea
	+---

class tagCANDIDATELIST	size(28):
	+---
 0	| dwSize
 4	| dwStyle
 8	| dwCount
12	| dwSelection
16	| dwPageStart
20	| dwPageSize
24	| dwOffset
	+---

class tagREGISTERWORDA	size(8):
	+---
 0	| lpReading
 4	| lpWord
	+---

class tagREGISTERWORDW	size(8):
	+---
 0	| lpReading
 4	| lpWord
	+---

class tagRECONVERTSTRING	size(32):
	+---
 0	| dwSize
 4	| dwVersion
 8	| dwStrLen
12	| dwStrOffset
16	| dwCompStrLen
20	| dwCompStrOffset
24	| dwTargetStrLen
28	| dwTargetStrOffset
	+---

class tagSTYLEBUFA	size(36):
	+---
 0	| dwStyle
 4	| szDescription
	+---

class tagSTYLEBUFW	size(68):
	+---
 0	| dwStyle
 4	| szDescription
	+---

class tagIMEMENUITEMINFOA	size(112):
	+---
 0	| cbSize
 4	| fType
 8	| fState
12	| wID
16	| hbmpChecked
20	| hbmpUnchecked
24	| dwItemData
28	| szString
108	| hbmpItem
	+---

class tagIMEMENUITEMINFOW	size(192):
	+---
 0	| cbSize
 4	| fType
 8	| fState
12	| wID
16	| hbmpChecked
20	| hbmpUnchecked
24	| dwItemData
28	| szString
188	| hbmpItem
	+---

class tagIMECHARPOSITION	size(36):
	+---
 0	| dwSize
 4	| dwCharPos
 8	| tagPOINT pt
16	| cLineHeight
20	| tagRECT rcDocument
	+---

class PropPoxVaccine	size(1):
	+---
	+---

class cIGZUnknown	size(4):
	+---
 0	| {vfptr}
	+---

cIGZUnknown::$vftable@:
	| &cIGZUnknown_meta
	|  0
 0	| &cIGZUnknown::QueryInterface 
 1	| &cIGZUnknown::AddRef 
 2	| &cIGZUnknown::Release 

cIGZUnknown::QueryInterface this adjustor: 0
cIGZUnknown::AddRef this adjustor: 0
cIGZUnknown::Release this adjustor: 0

class cIGZString	size(4):
	+---
 0	| +--- (base class cIGZUnknown)
 0	| | {vfptr}
	| +---
	+---

cIGZString::$vftable@:
	| &cIGZString_meta
	|  0
 0	| &cIGZUnknown::QueryInterface 
 1	| &cIGZUnknown::AddRef 
 2	| &cIGZUnknown::Release 
 3	| &cIGZString::FromChar 
 4	| &cIGZString::FromChar 
 5	| &cIGZString::ToChar 
 6	| &cIGZString::Data 
 7	| &cIGZString::Strlen 
 8	| &cIGZString::IsEqual 
 9	| &cIGZString::IsEqual 
10	| &cIGZString::IsEqual 
11	| &cIGZString::CompareTo 
12	| &cIGZString::CompareTo 
13	| &cIGZString::= 
14	| &cIGZString::Copy 
15	| &cIGZString::Resize 
16	| &cIGZString::Append 
17	| &cIGZString::Append 
18	| &cIGZString::Insert 
19	| &cIGZString::Insert 
20	| &cIGZString::Replace 
21	| &cIGZString::Replace 
22	| &cIGZString::Erase 
23	| &cIGZString::Find 
24	| &cIGZString::Find 
25	| &cIGZString::RFind 
26	| &cIGZString::RFind 
27	| &cIGZString::Sprintf 

cIGZString::FromChar this adjustor: 0
cIGZString::FromChar this adjustor: 0
cIGZString::ToChar this adjustor: 0
cIGZString::Data this adjustor: 0
cIGZString::Strlen this adjustor: 0
cIGZString::IsEqual this adjustor: 0
cIGZString::IsEqual this adjustor: 0
cIGZString::IsEqual this adjustor: 0
cIGZString::CompareTo this adjustor: 0
cIGZString::CompareTo this adjustor: 0
cIGZString::= this adjustor: 0
cIGZString::Copy this adjustor: 0
cIGZString::Resize this adjustor: 0
cIGZString::Append this adjustor: 0
cIGZString::Append this adjustor: 0
cIGZString::Insert this adjustor: 0
cIGZString::Insert this adjustor: 0
cIGZString::Replace this adjustor: 0
cIGZString::Replace this adjustor: 0
cIGZString::Erase this adjustor: 0
cIGZString::Find this adjustor: 0
cIGZString::Find this adjustor: 0
cIGZString::RFind this adjustor: 0
cIGZString::RFind this adjustor: 0
cIGZString::Sprintf this adjustor: 0

class cISC4DBSegmentIStream	size(4):
	+---
 0	| +--- (base class cIGZUnknown)
 0	| | {vfptr}
	| +---
	+---

cISC4DBSegmentIStream::$vftable@:
	| &cISC4DBSegmentIStream_meta
	|  0
 0	| &cIGZUnknown::QueryInterface 
 1	| &cIGZUnknown::AddRef 
 2	| &cIGZUnknown::Release 

class cGZPersistResourceKey	size(12):
	+---
 0	| tid
 4	| gid
 8	| iid
	+---

class cRZUnknown	size(8):
	+---
 0	| {vfptr}
 4	| mnRefCount
	+---

cRZUnknown::$vftable@:
	| &cRZUnknown_meta
	|  0
 0	| &cRZUnknown::QueryInterface 
 1	| &cRZUnknown::AddRef 
 2	| &cRZUnknown::Release 
 3	| &cRZUnknown::{dtor} 
 4	| &cRZUnknown::RemoveRef 
 5	| &cRZUnknown::RefCount 

cRZUnknown::QueryInterface this adjustor: 0
cRZUnknown::AddRef this adjustor: 0
cRZUnknown::Release this adjustor: 0
cRZUnknown::{dtor} this adjustor: 0
cRZUnknown::RemoveRef this adjustor: 0
cRZUnknown::RefCount this adjustor: 0
cRZUnknown::__delDtor this adjustor: 0
cRZUnknown::__vecDelDtor this adjustor: 0

class cIGZPersistDBSerialRecord	size(4):
	+---
 0	| +--- (base class cIGZUnknown)
 0	| | {vfptr}
	| +---
	+---

cIGZPersistDBSerialRecord::$vftable@:
	| &cIGZPersistDBSerialRecord_meta
	|  0
 0	| &cIGZUnknown::QueryInterface 
 1	| &cIGZUnknown::AddRef 
 2	| &cIGZUnknown::Release 
 3	| &cIGZPersistDBSerialRecord::AsIGZPersistDBRecord 
 4	| &cIGZPersistDBSerialRecord::GetFieldUint8 
 5	| &cIGZPersistDBSerialRecord::GetFieldUint8 
 6	| &cIGZPersistDBSerialRecord::GetFieldSint8 
 7	| &cIGZPersistDBSerialRecord::GetFieldSint8 
 8	| &cIGZPersistDBSerialRecord::GetFieldUint16 
 9	| &cIGZPersistDBSerialRecord::GetFieldUint16 
10	| &cIGZPersistDBSerialRecord::GetFieldSint16 
11	| &cIGZPersistDBSerialRecord::GetFieldSint16 
12	| &cIGZPersistDBSerialRecord::GetFieldUint32 
13	| &cIGZPersistDBSerialRecord::GetFieldUint32 
14	| &cIGZPersistDBSerialRecord::GetFieldSint32 
15	| &cIGZPersistDBSerialRecord::GetFieldSint32 
16	| &cIGZPersistDBSerialRecord::GetFieldUint64 
17	| &cIGZPersistDBSerialRecord::GetFieldUint64 
18	| &cIGZPersistDBSerialRecord::GetFieldSint64 
19	| &cIGZPersistDBSerialRecord::GetFieldSint64 
20	| &cIGZPersistDBSerialRecord::GetFieldFloat32 
21	| &cIGZPersistDBSerialRecord::GetFieldFloat32 
22	| &cIGZPersistDBSerialRecord::GetFieldFloat64 
23	| &cIGZPersistDBSerialRecord::GetFieldFloat64 
24	| &cIGZPersistDBSerialRecord::GetFieldString 
25	| &cIGZPersistDBSerialRecord::GetFieldResKey 
26	| &cIGZPersistDBSerialRecord::GetFieldVariant 
27	| &cIGZPersistDBSerialRecord::GetFieldVoid 
28	| &cIGZPersistDBSerialRecord::SetFieldUint8 
29	| &cIGZPersistDBSerialRecord::SetFieldUint8 
30	| &cIGZPersistDBSerialRecord::SetFieldSint8 
31	| &cIGZPersistDBSerialRecord::SetFieldSint8 
32	| &cIGZPersistDBSerialRecord::SetFieldUint16 
33	| &cIGZPersistDBSerialRecord::SetFieldUint16 
34	| &cIGZPersistDBSerialRecord::SetFieldSint16 
35	| &cIGZPersistDBSerialRecord::SetFieldSint16 
36	| &cIGZPersistDBSerialRecord::SetFieldUint32 
37	| &cIGZPersistDBSerialRecord::SetFieldUint32 
38	| &cIGZPersistDBSerialRecord::SetFieldSint32 
39	| &cIGZPersistDBSerialRecord::SetFieldSint32 
40	| &cIGZPersistDBSerialRecord::SetFieldUint64 
41	| &cIGZPersistDBSerialRecord::SetFieldUint64 
42	| &cIGZPersistDBSerialRecord::SetFieldSint64 
43	| &cIGZPersistDBSerialRecord::SetFieldSint64 
44	| &cIGZPersistDBSerialRecord::SetFieldFloat32 
45	| &cIGZPersistDBSerialRecord::SetFieldFloat32 
46	| &cIGZPersistDBSerialRecord::SetFieldFloat64 
47	| &cIGZPersistDBSerialRecord::SetFieldFloat64 
48	| &cIGZPersistDBSerialRecord::SetFieldString 
49	| &cIGZPersistDBSerialRecord::SetFieldResKey 
50	| &cIGZPersistDBSerialRecord::SetFieldVariant 
51	| &cIGZPersistDBSerialRecord::SetFieldVoid 
52	| &cIGZPersistDBSerialRecord::GetSize 
53	| &cIGZPersistDBSerialRecord::SetSize 
54	| &cIGZPersistDBSerialRecord::GetPosition 
55	| &cIGZPersistDBSerialRecord::SeekAbsolute 
56	| &cIGZPersistDBSerialRecord::SeekRelative 
57	| &cIGZPersistDBSerialRecord::{dtor} 

cIGZPersistDBSerialRecord::AsIGZPersistDBRecord this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldUint8 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldUint8 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldSint8 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldSint8 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldUint16 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldUint16 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldSint16 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldSint16 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldUint32 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldUint32 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldSint32 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldSint32 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldUint64 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldUint64 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldSint64 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldSint64 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldFloat32 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldFloat32 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldFloat64 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldFloat64 this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldString this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldResKey this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldVariant this adjustor: 0
cIGZPersistDBSerialRecord::GetFieldVoid this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldUint8 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldUint8 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldSint8 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldSint8 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldUint16 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldUint16 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldSint16 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldSint16 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldUint32 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldUint32 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldSint32 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldSint32 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldUint64 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldUint64 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldSint64 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldSint64 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldFloat32 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldFloat32 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldFloat64 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldFloat64 this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldString this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldResKey this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldVariant this adjustor: 0
cIGZPersistDBSerialRecord::SetFieldVoid this adjustor: 0
cIGZPersistDBSerialRecord::GetSize this adjustor: 0
cIGZPersistDBSerialRecord::SetSize this adjustor: 0
cIGZPersistDBSerialRecord::GetPosition this adjustor: 0
cIGZPersistDBSerialRecord::SeekAbsolute this adjustor: 0
cIGZPersistDBSerialRecord::SeekRelative this adjustor: 0
cIGZPersistDBSerialRecord::{dtor} this adjustor: 0
cIGZPersistDBSerialRecord::__delDtor this adjustor: 0
cIGZPersistDBSerialRecord::__vecDelDtor this adjustor: 0

class cIGZOStream	size(4):
	+---
 0	| +--- (base class cIGZUnknown)
 0	| | {vfptr}
	| +---
	+---

cIGZOStream::$vftable@:
	| &cIGZOStream_meta
	|  0
 0	| &cIGZUnknown::QueryInterface 
 1	| &cIGZUnknown::AddRef 
 2	| &cIGZUnknown::Release 
 3	| &cIGZOStream::Flush 
 4	| &cIGZOStream::SetSint8 
 5	| &cIGZOStream::SetUint8 
 6	| &cIGZOStream::SetSint16 
 7	| &cIGZOStream::SetUint16 
 8	| &cIGZOStream::SetSint32 
 9	| &cIGZOStream::SetUint32 
10	| &cIGZOStream::SetSint64 
11	| &cIGZOStream::SetUint64 
12	| &cIGZOStream::SetFloat32 
13	| &cIGZOStream::SetFloat64 
14	| &cIGZOStream::SetRZCharStr 
15	| &cIGZOStream::SetGZStr 
16	| &cIGZOStream::SetGZSerializable 
17	| &cIGZOStream::SetVoid 
18	| &cIGZOStream::GetError 
19	| &cIGZOStream::SetUserData 
20	| &cIGZOStream::GetUserData 

cIGZOStream::Flush this adjustor: 0
cIGZOStream::SetSint8 this adjustor: 0
cIGZOStream::SetUint8 this adjustor: 0
cIGZOStream::SetSint16 this adjustor: 0
cIGZOStream::SetUint16 this adjustor: 0
cIGZOStream::SetSint32 this adjustor: 0
cIGZOStream::SetUint32 this adjustor: 0
cIGZOStream::SetSint64 this adjustor: 0
cIGZOStream::SetUint64 this adjustor: 0
cIGZOStream::SetFloat32 this adjustor: 0
cIGZOStream::SetFloat64 this adjustor: 0
cIGZOStream::SetRZCharStr this adjustor: 0
cIGZOStream::SetGZStr this adjustor: 0
cIGZOStream::SetGZSerializable this adjustor: 0
cIGZOStream::SetVoid this adjustor: 0
cIGZOStream::GetError this adjustor: 0
cIGZOStream::SetUserData this adjustor: 0
cIGZOStream::GetUserData this adjustor: 0

class cISC4DBSegmentOStream	size(4):
	+---
 0	| +--- (base class cIGZOStream)
 0	| | +--- (base class cIGZUnknown)
 0	| | | {vfptr}
	| | +---
	| +---
	+---

cISC4DBSegmentOStream::$vftable@:
	| &cISC4DBSegmentOStream_meta
	|  0
 0	| &cIGZUnknown::QueryInterface 
 1	| &cIGZUnknown::AddRef 
 2	| &cIGZUnknown::Release 
 3	| &cIGZOStream::Flush 
 4	| &cIGZOStream::SetSint8 
 5	| &cIGZOStream::SetUint8 
 6	| &cIGZOStream::SetSint16 
 7	| &cIGZOStream::SetUint16 
 8	| &cIGZOStream::SetSint32 
 9	| &cIGZOStream::SetUint32 
10	| &cIGZOStream::SetSint64 
11	| &cIGZOStream::SetUint64 
12	| &cIGZOStream::SetFloat32 
13	| &cIGZOStream::SetFloat64 
14	| &cIGZOStream::SetRZCharStr 
15	| &cIGZOStream::SetGZStr 
16	| &cIGZOStream::SetGZSerializable 
17	| &cIGZOStream::SetVoid 
18	| &cIGZOStream::GetError 
19	| &cIGZOStream::SetUserData 
20	| &cIGZOStream::GetUserData 
21	| &cISC4DBSegmentOStream::Open 
22	| &cISC4DBSegmentOStream::Close 
23	| &cISC4DBSegmentOStream::IsOpen 
24	| &cISC4DBSegmentOStream::GetRecord 
25	| &cISC4DBSegmentOStream::GetSegment 
26	| &cISC4DBSegmentOStream::WriteGZSerializable 
27	| &cISC4DBSegmentOStream::WriteResKey 
28	| &cISC4DBSegmentOStream::WriteVariant 

cISC4DBSegmentOStream::Open this adjustor: 0
cISC4DBSegmentOStream::Close this adjustor: 0
cISC4DBSegmentOStream::IsOpen this adjustor: 0
cISC4DBSegmentOStream::GetRecord this adjustor: 0
cISC4DBSegmentOStream::GetSegment this adjustor: 0
cISC4DBSegmentOStream::WriteGZSerializable this adjustor: 0
cISC4DBSegmentOStream::WriteResKey this adjustor: 0
cISC4DBSegmentOStream::WriteVariant this adjustor: 0

class cISC4DBSegment	size(4):
	+---
 0	| +--- (base class cIGZUnknown)
 0	| | {vfptr}
	| +---
	+---

cISC4DBSegment::$vftable@:
	| &cISC4DBSegment_meta
	|  0
 0	| &cIGZUnknown::QueryInterface 
 1	| &cIGZUnknown::AddRef 
 2	| &cIGZUnknown::Release 
 3	| &cISC4DBSegment::AsIGZPersistDBSegment 
 4	| &cISC4DBSegment::GetCOMSerializer 
 5	| &cISC4DBSegment::OpenIStream 
 6	| &cISC4DBSegment::CloseIStream 
 7	| &cISC4DBSegment::LoadClassObjects 
 8	| &cISC4DBSegment::OpenOStream 
 9	| &cISC4DBSegment::CloseOStream 
10	| &cISC4DBSegment::SaveClassObjects 
11	| &cISC4DBSegment::GetLastError 
12	| &cISC4DBSegment::GetPercentageCompletion 
13	| &cISC4DBSegment::SetPercentageCompletion 

cISC4DBSegment::AsIGZPersistDBSegment this adjustor: 0
cISC4DBSegment::GetCOMSerializer this adjustor: 0
cISC4DBSegment::OpenIStream this adjustor: 0
cISC4DBSegment::CloseIStream this adjustor: 0
cISC4DBSegment::LoadClassObjects this adjustor: 0
cISC4DBSegment::OpenOStream this adjustor: 0
cISC4DBSegment::CloseOStream this adjustor: 0
cISC4DBSegment::SaveClassObjects this adjustor: 0
cISC4DBSegment::GetLastError this adjustor: 0
cISC4DBSegment::GetPercentageCompletion this adjustor: 0
cISC4DBSegment::SetPercentageCompletion this adjustor: 0

class cISC4COMSerializer	size(4):
	+---
 0	| +--- (base class cIGZUnknown)
 0	| | {vfptr}
	| +---
	+---

cISC4COMSerializer::$vftable@:
	| &cISC4COMSerializer_meta
	|  0
 0	| &cIGZUnknown::QueryInterface 
 1	| &cIGZUnknown::AddRef 
 2	| &cIGZUnknown::Release 
 3	| &cISC4COMSerializer::Open 
 4	| &cISC4COMSerializer::Close 
 5	| &cISC4COMSerializer::GetMode 
 6	| &cISC4COMSerializer::LoadClassObjects 
 7	| &cISC4COMSerializer::SaveClassObjects 
 8	| &cISC4COMSerializer::WriteGZSerializable 
 9	| &cISC4COMSerializer::ReadGZSerializable 

cISC4COMSerializer::Open this adjustor: 0
cISC4COMSerializer::Close this adjustor: 0
cISC4COMSerializer::GetMode this adjustor: 0
cISC4COMSerializer::LoadClassObjects this adjustor: 0
cISC4COMSerializer::SaveClassObjects this adjustor: 0
cISC4COMSerializer::WriteGZSerializable this adjustor: 0
cISC4COMSerializer::ReadGZSerializable this adjustor: 0

class cIGZSerializable	size(4):
	+---
 0	| +--- (base class cIGZUnknown)
 0	| | {vfptr}
	| +---
	+---

cIGZSerializable::$vftable@:
	| &cIGZSerializable_meta
	|  0
 0	| &cIGZUnknown::QueryInterface 
 1	| &cIGZUnknown::AddRef 
 2	| &cIGZUnknown::Release 
 3	| &cIGZSerializable::Write 
 4	| &cIGZSerializable::Read 
 5	| &cIGZSerializable::GetGZCLSID 

cIGZSerializable::Write this adjustor: 0
cIGZSerializable::Read this adjustor: 0
cIGZSerializable::GetGZCLSID this adjustor: 0

class cSC4COMSerializer::cIDInfo	size(4):
	+---
 0	| pSerializable
	+---

class SC4Win32Map<unsigned int,struct cSC4COMSerializer::cIDInfo>	size(12):
	+---
 0	| mpAnchor
 4	| mnSize
 8	| dwUnknown
	+---

class cSC4COMSerializer::cClassInfo	size(20):
	+---
 0	| dwUnknown1
 4	| dwUnknown2
 8	| ?$SC4Win32Map@IUcIDInfo@cSC4COMSerializer@@ dataPendingWrite
	+---

class SC4Win32Map<unsigned int,struct cSC4COMSerializer::cClassInfo>	size(12):
	+---
 0	| mpAnchor
 4	| mnSize
 8	| dwUnknown
	+---

class cSC4COMSerializer	size(48):
	+---
 0	| +--- (base class cISC4COMSerializer)
 0	| | +--- (base class cIGZUnknown)
 0	| | | {vfptr}
	| | +---
	| +---
 4	| byteUnknown1
 5	| __align_1
 8	| ?$SC4Win32Map@IUcClassInfo@cSC4COMSerializer@@ tempClassMap
20	| ?$SC4Win32Map@IUcClassInfo@cSC4COMSerializer@@ realClassMap
32	| dwMode
36	| dwTotalObjects
40	| byteAlreadyRead
41	| byteAlreadyWritten
42	| __align_2
44	| pOpenSegment
	+---

cSC4COMSerializer::$vftable@:
	| &cSC4COMSerializer_meta
	|  0
 0	| &cIGZUnknown::QueryInterface 
 1	| &cIGZUnknown::AddRef 
 2	| &cIGZUnknown::Release 
 3	| &cSC4COMSerializer::Open 
 4	| &cSC4COMSerializer::Close 
 5	| &cSC4COMSerializer::GetMode 
 6	| &cSC4COMSerializer::LoadClassObjects 
 7	| &cSC4COMSerializer::SaveClassObjects 
 8	| &cSC4COMSerializer::WriteGZSerializable 
 9	| &cSC4COMSerializer::ReadGZSerializable 

cSC4COMSerializer::Open this adjustor: 0
cSC4COMSerializer::Close this adjustor: 0
cSC4COMSerializer::GetMode this adjustor: 0
cSC4COMSerializer::LoadClassObjects this adjustor: 0
cSC4COMSerializer::SaveClassObjects this adjustor: 0
cSC4COMSerializer::WriteGZSerializable this adjustor: 0
cSC4COMSerializer::ReadGZSerializable this adjustor: 0

class eastl::rbtree_iterator<struct eastl::pair<unsigned int,struct cSC4COMSerializer::cClassInfo>,struct eastl::pair<unsigned int,struct cSC4COMSerializer::cClassInfo> *,struct eastl::pair<unsigned int,struct cSC4COMSerializer::cClassInfo> &>	size(4):
	+---
 0	| mpNode
	+---

class eastl::pair<unsigned int,struct cSC4COMSerializer::cClassInfo>	size(24):
	+---
 0	| first
 4	| cClassInfo second
	+---

class eastl::rbtree_iterator<struct eastl::pair<unsigned int,struct cSC4COMSerializer::cIDInfo>,struct eastl::pair<unsigned int,struct cSC4COMSerializer::cIDInfo> *,struct eastl::pair<unsigned int,struct cSC4COMSerializer::cIDInfo> &>	size(4):
	+---
 0	| mpNode
	+---

class eastl::pair<unsigned int,struct cSC4COMSerializer::cIDInfo>	size(8):
	+---
 0	| first
 4	| cIDInfo second
	+---

class std::is_const<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::allocator<unsigned char>	size(1):
	+---
	+---

class std::_Is_default_allocator<class std::allocator<unsigned char>,void>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::conditional<1,struct std::_Default_allocator_traits<class std::allocator<unsigned char> >,struct std::_Normal_allocator_traits<class std::allocator<unsigned char> > >	size(1):
	+---
	+---

class std::_Default_allocator_traits<class std::allocator<unsigned char> >	size(1):
	+---
	+---

class std::allocator_traits<class std::allocator<unsigned char> >	size(1):
	+---
 0	| +--- (base class std::_Default_allocator_traits<class std::allocator<unsigned char> >)
	| +---
	+---

class std::is_same<unsigned char *,unsigned char *>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_same<unsigned char const *,unsigned char const *>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_simple_alloc<class std::allocator<unsigned char> >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::conditional<1,struct std::_Simple_types<unsigned char>,struct std::_Vec_iter_types<unsigned char,unsigned int,int,unsigned char *,unsigned char const *,unsigned char &,unsigned char const &> >	size(1):
	+---
	+---

class std::_Vec_base_types<unsigned char,class std::allocator<unsigned char> >	size(1):
	+---
	+---

class std::_Simple_types<unsigned char>	size(1):
	+---
	+---

class std::is_empty<class std::allocator<unsigned char> >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_final<class std::allocator<unsigned char> >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::_Vector_val<struct std::_Simple_types<unsigned char> >	size(12):
	+---
 0	| +--- (base class std::_Container_base0)
	| +---
 0	| _Myfirst
 4	| _Mylast
 8	| _Myend
	+---

class std::_Compressed_pair<class std::allocator<unsigned char>,class std::_Vector_val<struct std::_Simple_types<unsigned char> >,1>	size(12):
	+---
 0	| +--- (base class std::allocator<unsigned char>)
	| +---
 0	| ?$_Vector_val@U?$_Simple_types@E@std@@ _Myval2
	+---

class std::_Vector_alloc<struct std::_Vec_base_types<unsigned char,class std::allocator<unsigned char> > >	size(12):
	+---
 0	| ?$_Compressed_pair@V?$allocator@E@std@@V?$_Vector_val@U?$_Simple_types@E@std@@@2@$00 _Mypair
	+---

class std::is_same<unsigned char,unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_nothrow_constructible<class std::allocator<unsigned char> >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_nothrow_default_constructible<class std::allocator<unsigned char> >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::vector<unsigned char,class std::allocator<unsigned char> >	size(12):
	+---
 0	| +--- (base class std::_Vector_alloc<struct std::_Vec_base_types<unsigned char,class std::allocator<unsigned char> > >)
 0	| | ?$_Compressed_pair@V?$allocator@E@std@@V?$_Vector_val@U?$_Simple_types@E@std@@@2@$00 _Mypair
	| +---
	+---

class eastl::rbtree_iterator<struct eastl::pair<unsigned int,struct cSC4COMSerializer::cIDInfo>,struct eastl::pair<unsigned int,struct cSC4COMSerializer::cIDInfo> const *,struct eastl::pair<unsigned int,struct cSC4COMSerializer::cIDInfo> const &>	size(4):
	+---
 0	| mpNode
	+---

class hook_shim_t	size(4):
	+---
 0	| pfnSave
 0	| pfnVoid
	+---

class std::vector<unsigned char,class std::allocator<unsigned char> >::resize::__l2::<lambda_1c24340e0c23a1361b49dbc3231bff51>	size(4):
	+---
 0	| __this
	+---

class eastl::rbtree_node<struct eastl::pair<unsigned int,struct cSC4COMSerializer::cClassInfo> >	size(40):
	+---
 0	| +--- (base class eastl::rbtree_node_base)
 0	| | mColor
  	| C:\Program Files (x86)\Microsoft Visual Studio\2017\Community\VC\Tools\MSVC\14.11.25503\include\vector(1495): warning C4530: C++ exception handler used, but unwind semantics are not enabled. Specify /EHsc
C:\Program Files (x86)\Microsoft Visual Studio\2017\Community\VC\Tools\MSVC\14.11.25503\include\vector(1532): note: see reference to function template instantiation 'void std::vector<uint8_t,std::allocator<_Ty>>::_Resize<std::vector<_Ty,std::allocator<_Ty>>::resize::<lambda_1c24340e0c23a1361b49dbc3231bff51>>(const unsigned int,_Lambda)' being compiled
        with
        [
            _Ty=uint8_t,
            _Lambda=std::vector<uint8_t,std::allocator<uint8_t>>::resize::<lambda_1c24340e0c23a1361b49dbc3231bff51>
        ]
C:\Program Files (x86)\Microsoft Visual Studio\2017\Community\VC\Tools\MSVC\14.11.25503\include\vector(1532): note: see reference to function template instantiation 'void std::vector<uint8_t,std::allocator<_Ty>>::_Resize<std::vector<_Ty,std::allocator<_Ty>>::resize::<lambda_1c24340e0c23a1361b49dbc3231bff51>>(const unsigned int,_Lambda)' being compiled
        with
        [
            _Ty=uint8_t,
            _Lambda=std::vector<uint8_t,std::allocator<uint8_t>>::resize::<lambda_1c24340e0c23a1361b49dbc3231bff51>
        ]
C:\Program Files (x86)\Microsoft Visual Studio\2017\Community\VC\Tools\MSVC\14.11.25503\include\vector(1526): note: while compiling class template member function 'void std::vector<uint8_t,std::allocator<_Ty>>::resize(const unsigned int)'
        with
        [
            _Ty=uint8_t
        ]
PropPoxVaccine.cpp(555): note: see reference to function template instantiation 'void std::vector<uint8_t,std::allocator<_Ty>>::resize(const unsigned int)' being compiled
        with
        [
            _Ty=uint8_t
        ]
PropPoxVaccine.cpp(553): note: see reference to class template instantiation 'std::vector<uint8_t,std::allocator<_Ty>>' being compiled
        with
        [
            _Ty=uint8_t
        ]
| <alignment member> (size=3)
 4	| | mpNodeParent
 8	| | mpNodeLeft
12	| | mpNodeRight
	| +---
16	| ?$pair@IUcClassInfo@cSC4COMSerializer@@ mValue
	+---

class eastl::rbtree_node<struct eastl::pair<unsigned int,struct cSC4COMSerializer::cIDInfo> >	size(24):
	+---
 0	| +--- (base class eastl::rbtree_node_base)
 0	| | mColor
  	| | <alignment member> (size=3)
 4	| | mpNodeParent
 8	| | mpNodeLeft
12	| | mpNodeRight
	| +---
16	| ?$pair@IUcIDInfo@cSC4COMSerializer@@ mValue
	+---

class __vcrt_va_list_is_reference<struct __crt_locale_pointers * const>	size(1):
	+---
	+---

class __vcrt_va_list_is_reference<wchar_t const * const>	size(1):
	+---
	+---

class __vcrt_va_list_is_reference<wchar_t const *>	size(1):
	+---
	+---

class __vcrt_va_list_is_reference<struct __crt_locale_pointers *>	size(1):
	+---
	+---

class __vcrt_va_list_is_reference<char const * const>	size(1):
	+---
	+---

class __vcrt_va_list_is_reference<char const *>	size(1):
	+---
	+---

class std::_Is_function<unsigned char>	size(1):
	+---
	+---

class std::is_function<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::is_lvalue_reference<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::is_rvalue_reference<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::is_reference<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::is_void<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::is_object<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::remove_cv<unsigned char>	size(1):
	+---
	+---

class std::_Iterator_traits_pointer_base<unsigned char,1>	size(1):
	+---
	+---

class std::iterator_traits<unsigned char *>	size(1):
	+---
 0	| +--- (base class std::_Iterator_traits_pointer_base<unsigned char,1>)
	| +---
	+---

class std::remove_cv<unsigned char *>	size(1):
	+---
	+---

class std::_Is_pointer<unsigned char *>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_pointer<unsigned char *>	size(1):
	+---
 0	| +--- (base class std::_Is_pointer<unsigned char *>)
 0	| | +--- (base class std::integral_constant<bool,1>)
	| | +---
	| +---
	+---

class std::is_integral<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Is_floating_point<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::is_floating_point<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::is_arithmetic<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_enum<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::_Is_pointer<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::is_pointer<unsigned char>	size(1):
	+---
 0	| +--- (base class std::_Is_pointer<unsigned char>)
 0	| | +--- (base class std::integral_constant<bool,0>)
	| | +---
	| +---
	+---

class std::_Is_memfunptr<unsigned char>	size(1):
	+---
	+---

class std::_Is_member_object_pointer<unsigned char,0>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::is_member_object_pointer<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::is_member_function_pointer<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::is_member_pointer<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::is_same<unsigned char,std::nullptr_t>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::is_null_pointer<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::is_scalar<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_volatile<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,0>)
	| +---
	+---

class std::negation<struct std::is_volatile<unsigned char> >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::negation<struct std::is_member_pointer<unsigned char> >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Conjunction<1,struct std::negation<struct std::is_member_pointer<unsigned char> > >	size(1):
	+---
	+---

class std::_Conjunction<1,struct std::negation<struct std::is_volatile<unsigned char> >,struct std::negation<struct std::is_member_pointer<unsigned char> > >	size(1):
	+---
	+---

class std::_Conjunction<1,struct std::is_scalar<unsigned char>,struct std::negation<struct std::is_volatile<unsigned char> >,struct std::negation<struct std::is_member_pointer<unsigned char> > >	size(1):
	+---
	+---

class std::_Conjunction<1,struct std::is_pointer<unsigned char *>,struct std::is_scalar<unsigned char>,struct std::negation<struct std::is_volatile<unsigned char> >,struct std::negation<struct std::is_member_pointer<unsigned char> > >	size(1):
	+---
	+---

class std::conjunction<struct std::is_pointer<unsigned char *>,struct std::is_scalar<unsigned char>,struct std::negation<struct std::is_volatile<unsigned char> >,struct std::negation<struct std::is_member_pointer<unsigned char> > >	size(1):
	+---
 0	| +--- (base class std::negation<struct std::is_member_pointer<unsigned char> >)
 0	| | +--- (base class std::integral_constant<bool,1>)
	| | +---
	| +---
	+---

class std::_Disjunction<1,struct std::_Is_default_allocator<class std::allocator<unsigned char>,void>,struct std::_Has_no_alloc_construct<void,class std::allocator<unsigned char>,unsigned char *> >	size(1):
	+---
	+---

class std::disjunction<struct std::_Is_default_allocator<class std::allocator<unsigned char>,void>,struct std::_Has_no_alloc_construct<void,class std::allocator<unsigned char>,unsigned char *> >	size(1):
	+---
 0	| +--- (base class std::_Is_default_allocator<class std::allocator<unsigned char>,void>)
 0	| | +--- (base class std::integral_constant<bool,1>)
	| | +---
	| +---
	+---

class std::_Conjunction<1,struct std::disjunction<struct std::_Is_default_allocator<class std::allocator<unsigned char>,void>,struct std::_Has_no_alloc_construct<void,class std::allocator<unsigned char>,unsigned char *> > >	size(1):
	+---
	+---

class std::_Conjunction<1,struct std::integral_constant<bool,1>,struct std::disjunction<struct std::_Is_default_allocator<class std::allocator<unsigned char>,void>,struct std::_Has_no_alloc_construct<void,class std::allocator<unsigned char>,unsigned char *> > >	size(1):
	+---
	+---

class std::conjunction<struct std::integral_constant<bool,1>,struct std::disjunction<struct std::_Is_default_allocator<class std::allocator<unsigned char>,void>,struct std::_Has_no_alloc_construct<void,class std::allocator<unsigned char>,unsigned char *> > >	size(1):
	+---
 0	| +--- (base class std::disjunction<struct std::_Is_default_allocator<class std::allocator<unsigned char>,void>,struct std::_Has_no_alloc_construct<void,class std::allocator<unsigned char>,unsigned char *> >)
 0	| | +--- (base class std::_Is_default_allocator<class std::allocator<unsigned char>,void>)
 0	| | | +--- (base class std::integral_constant<bool,1>)
	| | | +---
	| | +---
	| +---
	+---

class std::is_trivially_destructible<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Disjunction<1,struct std::_Is_default_allocator<class std::allocator<unsigned char>,void>,struct std::_Has_no_alloc_destroy<class std::allocator<unsigned char>,unsigned char *,void> >	size(1):
	+---
	+---

class std::disjunction<struct std::_Is_default_allocator<class std::allocator<unsigned chaC:\Program Files (x86)\Microsoft Visual Studio\2017\Community\VC\Tools\MSVC\14.11.25503\include\type_traits(2342): warning C4577: 'noexcept' used with no exception handling mode specified; termination on exception is not guaranteed. Specify /EHsc
r>,void>,struct std::_Has_no_alloc_destroy<class std::allocator<unsigned char>,unsigned char *,void> >	size(1):
	+---
 0	| +--- (base class std::_Is_default_allocator<class std::allocator<unsigned char>,void>)
 0	| | +--- (base class std::integral_constant<bool,1>)
	| | +---
	| +---
	+---

class std::_Conjunction<1,struct std::disjunction<struct std::_Is_default_allocator<class std::allocator<unsigned char>,void>,struct std::_Has_no_alloc_destroy<class std::allocator<unsigned char>,unsigned char *,void> > >	size(1):
	+---
	+---

class std::_Conjunction<1,struct std::is_trivially_destructible<unsigned char>,struct std::disjunction<struct std::_Is_default_allocator<class std::allocator<unsigned char>,void>,struct std::_Has_no_alloc_destroy<class std::allocator<unsigned char>,unsigned char *,void> > >	size(1):
	+---
	+---

class std::conjunction<struct std::is_trivially_destructible<unsigned char>,struct std::disjunction<struct std::_Is_default_allocator<class std::allocator<unsigned char>,void>,struct std::_Has_no_alloc_destroy<class std::allocator<unsigned char>,unsigned char *,void> > >	size(1):
	+---
 0	| +--- (base class std::disjunction<struct std::_Is_default_allocator<class std::allocator<unsigned char>,void>,struct std::_Has_no_alloc_destroy<class std::allocator<unsigned char>,unsigned char *,void> >)
 0	| | +--- (base class std::_Is_default_allocator<class std::allocator<unsigned char>,void>)
 0	| | | +--- (base class std::integral_constant<bool,1>)
	| | | +---
	| | +---
	| +---
	+---

class std::is_nothrow_constructible<unsigned char,unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_nothrow_move_constructible<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::_Disjunction<1,struct std::is_nothrow_move_constructible<unsigned char>,struct std::negation<struct std::is_copy_constructible<unsigned char> > >	size(1):
	+---
	+---

class std::disjunction<struct std::is_nothrow_move_constructible<unsigned char>,struct std::negation<struct std::is_copy_constructible<unsigned char> > >	size(1):
	+---
 0	| +--- (base class std::is_nothrow_move_constructible<unsigned char>)
 0	| | +--- (base class std::integral_constant<bool,1>)
	| | +---
	| +---
	+---

class std::is_trivially_assignable<unsigned char &,unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_trivially_copyable<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::is_trivial<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,1>)
	| +---
	+---

class std::conditional<1,struct std::_Really_trivial_ptr_iterator_tag,struct std::_Trivially_copyable_ptr_iterator_tag>	size(1):
	+---
	+---

class std::conditional<1,struct std::_Really_trivial_ptr_iterator_tag,struct std::_General_ptr_iterator_tag>	size(1):
	+---
	+---

class std::_Ptr_cat_helper<unsigned char,unsigned char>	size(1):
	+---
	+---

class std::remove_reference<unsigned char &>	size(1):
	+---
	+---

class std::_Disjunction<1,struct std::_Is_default_allocator<class std::allocator<unsigned char>,void>,struct std::_Has_no_alloc_construct<void,class std::allocator<unsigned char>,unsigned char *,unsigned char &&> >	size(1):
	+---
	+---

class std::disjunction<struct std::_Is_default_allocator<class std::allocator<unsigned char>,void>,struct std::_Has_no_alloc_construct<void,class std::allocator<unsigned char>,unsigned char *,unsigned char &&> >	size(1):
	+---
 0	| +--- (base class std::_Is_default_allocator<class std::allocator<unsigned char>,void>)
 0	| | +--- (base class std::integral_constant<bool,1>)
	| | +---
	| +---
	+---
Microsoft (R) Incremental Linker Version 14.11.25506.0
Copyright (C) Microsoft Corporation.  All rights reserved.

/out:PropPoxVaccine.exe 
PropPoxVaccine.obj 
LINK : fatal error LNK1561: entry point must be defined
